{
  "title": "Cornbread, Apple, and Pine Nut Dressing (With Fresh Sage)",
  "requires": "",
  "ingredients": [
    "¾ cup pine nuts",
    "¾ stick (6 tablespoons) unsalted butter",
    "3 cups coarsely diced onion",
    "1½ teaspoons dried thyme, crumbled",
    "3 large baking apples (about 1½ pounds total);",
    "such as Rome Beauty; peeled, cored and coarsely chopped",
    "½ cup chopped fresh sage",
    "1 teaspoon salt",
    "12 cups coarsely crumbled cornbread; make the cornbread recipe twice",
    "2½ cups chicken broth, preferably homemade",
    "2 teaspoons freshly ground black pepper"
  ],
  "instructions": [
    "Position a rack in the middle of the oven and preheat the oven to 375° F.",
    "Butter a large, shallow, baking dish of about 4-quarts capacity and set aside for later.",
    "In a metal baking dish, such as a metal pie plate, spread the pine nuts in a single layer and bake, stirring once or twice, until they are golden brown, about 7 to 10 minutes.  When done transfer them to a bowl and allow them to cool.",
    "In a large skillet, or Dutch oven, melt the butter over medium heat.  When the butter is melted add the onions and the thyme and cook, covered, stirring once or twice, for about 5 minutes.  Add the apples and continue cooking, covered, stirring once or twice, for 5 minutes longer.  Remove from the heat and stir in the sage and the salt then allow the mixture to cool to room temperature.",
    "Preheat the oven up to 400° F.",
    "Using a large mixing bowl, thoroughly toss together the crumbled cornbread, the apple mixture, and the pine nuts until you have a uniform mixture.  Add the black pepper and the chicken broth and mix thoroughly.  Spoon the dressing into the baking dish and bake in the middle rack of the oven, uncovered, for about 40 minutes; or, until the top of the dressing is lightly browned and the dressing is steaming."
  ],
  "remarks": "The cornbread dressing that I learned to make from my mother is similar but calls for equal portions diced onion, celery, and green bell pepper.  I would suggest that this dressing might be improved on by cutting the amount of chopped onion from three cups to one cup each of onion, celery, and green bell pepper. Secondly, a rule of thumb that my mother taught me is that the amount of chicken stock called for is gauged when adding the chicken stock to the cornbread mixture.  You add chicken stock until the cornbread dressing mixture is a shade “wetter” (“more moist”) than what you want the dressing to be when it’s comes out of the oven.  (Don’t count of it drying out very much in the oven if you add too much chicken stock, so be careful.) It’s hard to beat the recipe for cornbread dressing that I got from my mother but this recipe sounded interesting and was not too different from my mother’s so it occurred that one of these days I might try making it. Yield:  Serves 12. Source:  The El Paso Chile Company’s Texas Border Cookbook, by W. Park Kerr and Norma Kerr, published by William Morrow and Co., Inc., New York, © 1992 by W. Park Kerr and Norma Kerr and Michael McLaughlin.",
  "yield": "",
  "source": "",
  "category": "11 - Thanksgiving"
}