{
  "title": "My Mother’s Cornbread Dressing",
  "requires": "",
  "ingredients": [
    "2 cups chopped celery",
    "2 cups chopped onion",
    "2 cups chopped bell pepper",
    "1 stick butter",
    "1 tablespoons sage",
    "1 teaspoon black pepper",
    "Salt to taste",
    "Chicken stock; the amount will vary as explained in the recipe",
    "Cornbread (the recommended standard cornbread recipe quantity)"
  ],
  "instructions": [
    "Before starting crumble your cornbread and set it aside.  Additionally, the chicken stock will need to be heated (warm-hot) when you add it to your cornbread/vegetable mixture.",
    "In a large cooking pot melt the stick of butter over medium-high heat.  Once the butter is melted and hot, lower the heat setting to low and add the vegetables; the onion, celery, and bell pepper and cook, stirring occasionally, until the onion becomes translucent.  Add the salt, pepper, and the sage and stir to mix the salt and spices uniformly.",
    "Preheat the oven to 350° F.",
    "Add the cornbread to the vegetables and mix all the ingredients well.  Begin adding your chicken stock until your dressing is “moist.”  The cornbread dressing should be just, “a little more moist than what you want your dressing to be” after baking.  Transfer the dressing to a Pyrex® baking dish, 7½- by 12-inch, and with a spatula smooth out the dressing within the baking dish.",
    "Bake the dressing in a preheated oven, for 30 to 40 minutes; or, until it develops a lightly colored crust on the surface."
  ],
  "remarks": "You should note that if you prefer a “moist” dressing you may have added a level of liquid (chicken broth) to the dressing that will inhibit a light browning crust from developing within the suggested baking time. If you are making this recipe for the first time bake the dressing based on the suggested time; and not based on appearance.) Yield:  Serves 6 to 10. Source:  My mother, Helen Reygadas de Perales.  (From a recipe she sent me by mail in 1968.)",
  "yield": "",
  "source": "",
  "category": "08 - Thanksgiving"
}