{
  "title": "Good Eats Turkey",
  "requires": "",
  "ingredients": [
    "1 (14 to 16 pound) frozen young turkey",
    "For the brine:",
    "1 cup kosher salt",
    "1/2 cup light brown sugar",
    "1-gallon vegetable stock",
    "1 tablespoon black peppercorns",
    "1/2 tablespoon allspice berries",
    "1/2 tablespoon candied ginger",
    "1 gallon iced water",
    "For the aromatics:",
    "1 red apple, sliced",
    "1/2 onion, sliced",
    "1 cinnamon stick",
    "1 cup water",
    "4 sprigs rosemary",
    "6 leaves sage",
    "Canola oil"
  ],
  "instructions": [
    "Combine all brine ingredients, except ice water, in a stockpot, and bring to a boil. Stir to dissolve solids, then remove from heat, cool to room temperature, and refrigerate until thoroughly chilled.",
    "Early on the day of cooking, (or late the night before) combine the brine and ice water in a clean 5-gallon bucket. Place thawed turkey breast side down in brine, cover, and refrigerate or set in cool area (like a basement) for 6 hours. Turn turkey over once, half way through brining.",
    "A few minutes before roasting, heat oven to 500 degrees. Combine the apple, onion, cinnamon stick, and cup of water in a microwave safe dish and microwave on high for 5 minutes.",
    "Remove bird from brine and rinse inside and out with cold water. Discard brine.",
    "Place bird on roasting rack inside wide, low pan and pat dry with paper towels. Add steeped aromatics to cavity along with rosemary and sage. Tuck back wings and coat whole bird liberally with canola (or other neutral) oil.",
    "Roast on lowest level of the oven at 500 degrees F. for 30 minutes. Remove from oven and cover breast with double layer of aluminum foil, insert probe thermometer into thickest part of the breast and return to oven, reducing temperature to 350 degrees F. Set thermometer alarm (if available) to 161 degrees. A 14 to 16-pound bird should require a total of 2 to 2 1/2 hours of roasting. Let turkey rest, loosely covered for 15 minutes before carving."
  ],
  "remarks": "Source:  Good Eats",
  "yield": "",
  "source": "",
  "category": "08 - Thanksgiving"
}