{
  "title": "Brioche",
  "requires": "",
  "ingredients": [
    "For the Sponge –",
    "⅓ cup warm whole milk (between 100° F. and 110° F.)",
    "2¼ teaspoons active dry yeast",
    "1 large egg",
    "2 cups unbleached all-purpose flour",
    "For the Dough –",
    "⅓ cup sugar",
    "1 teaspoon kosher salt",
    "4 large eggs, lightly beaten",
    "1½ cups (approximately) unbleached all-purpose flour",
    "1½ sticks (6 ounces) unsalted butter, at room temperature"
  ],
  "instructions": [
    "Put the milk, yeast, egg, and 1 cup of the flour in the bowl of a heavy-duty mixer.  Mix the ingredients together with a rubber spatula, mixing just until everything is blended.  Sprinkle over the remaining cup of flour to cover the sponge.",
    "Set the sponge aside to rest uncovered for 30 to 40 minutes.  After this resting time, the flour coating will crack.  (This is your indication that everything is moving along properly.)",
    "Add the sugar, salt, eggs, and 1 cup of the flour to the sponge.  Set the bowl into the mixer, attach the dough hook, and mix on low speed for a minute or two, just until the ingredients look as if they’re about to come together.  Still mixing, sprinkle in ½ cup more flour.  When the flour is incorporated, increase the mixer speed to medium and beat for about 15 minutes, stopping to scrape down the hook and bowl as needed.  During this mixing period, the dough should come together, wrap itself around the dough hook, and slap the sides of the bowl.  If, after 7 to 10 minutes, you don’t have a cohesive, slapping dough, add up to 3 tablespoons more of flour.  Continue to beat, giving the dough a full 15 minutes in the mixer – don’t skimp on the time; this is what will give the brioche its distinctive texture.",
    "Be warned – your mixer will become extremely hot.  Most heavy-duty mixers designed for making bread can handle this long beating, although if you plan to make successive batches of dough, you’ll have to let your machine cool down completely between batches.",
    "In order to incorporate the butter into the dough you must work the butter until it is the same consistency as the dough.  You can bash the butter into submission with a rolling pin or give it a kinder and gentler handling by using a dough scraper to smear it bit by bit across a smooth work surface.  When it’s ready, the butter will be smooth, soft, and still cool – not warm, oily, or greasy.",
    "With the mixer on medium-low, add the butter a few tablespoons at a time.  This is the point at which you’ll think you’ve made a huge mistake, because the dough that you worked so hard to make smooth will fall apart – carry on!  When all the butter has been added, raise the mixer speed to medium-high for a minute, then reduce the speed to medium and beat the dough for about 5 minutes, or until you once again hear the dough slapping against the sides of the bowl.  Clean the sides of the bowl frequently as you work; if it looks as though the dough is not coming together after 2 to 3 minutes, add up to 1 tablespoon more of flour.  When you’re finished, the dough should still feel somewhat cool.  It will be soft and still sticky and may cling slightly to the sides and bottom of the bowl.",
    "Transfer the dough to a very large buttered bowl, cover it tightly with plastic wrap, and let it rise at room temperature until doubled in bulk, 2 to 2½ hours.",
    "Deflate the dough by placing your fingers under it, lifting a section of dough, and then letting it fall back into the bowl.  Work your way around the circumference of the dough, lifting and releasing.  Cover the bowl tightly with plastic wrap and refrigerate the dough overnight, or for at least 4 to 6 hours, during which time it will continue to rise and may double in size again.",
    "After this long chill the dough is ready to use in any brioche recipe."
  ],
  "remarks": "If your are not going to use the dough after the second rise, deflate it, wrap it airtight, and store it in the freezer.  The dough can remain frozen for up to 1 month.  Thaw the dough, still wrapped, in the refrigerator overnight and use it directly from the refrigerator. Mix, mix, and mix some more.  Once all the ingredients except the butter have been added, the dough must be beaten for a long time – sometimes as long as 25 minutes – to develop its fine texture. Listen for the slapping sound.  The dough should wrap itself around the dough hook and visually and audibly slap the sides of the bowl.  If the dough doesn’t come together, add a few sprinkles of flour and continue to beat. Keep the butter smooth and cool.  The butter and the dough it goes into should have a similar consistency – soft, smooth, and still cool (never oily).  To get the butter to the right consistency, beat it with a rolling pin or smear it in pieces across a work surface. Add the butter bit by bit.  The butter should go into the dough a few tablespoons full at a time while you mix at medium-low speed.  Don’t panic when your beautiful dough breaks up with the first few additions of butter – press on.  The dough will come together and once again make that satisfying slapping sound. Brioche is an elegant yeasted dough, a cross between bread and pastry.  It is rich with butter and eggs, just a little sweet, pullable – gentle tug, and the bread stretches in long, lacy strands – and fine-textured, the result of bean beaten for close to half hour. In this version, the brioche is made with a sponge, which gives the yeast a leisurely proofing period and deep flavor.  You’ll notice that the sponge instructions call for adding the dry yeast without a presoak to dissolve it.  This is an unusual technique, one more commonly associated with the use of fresh yeast.  If you have doubts – have a bite! There is nothing difficult about making this perfect brioche, but you do need time and a heavy-duty mixer.",
  "yield": "Make about 2¼ pounds of dough.",
  "source": "Baking with Julia, Everyday Delights by Dorie Greenspan, William Morrow and Co., Inc., New York, © 1996 by A La Carte Communications, Inc.",
  "category": "02 - Baking"
}