{
  "title": "Catalan Pizzas (Cocas)",
  "requires": "",
  "ingredients": [
    "For the dough-",
    "1½ cups warm water",
    "1 teaspoon active dry yeast",
    "2 tablespoons extra-virgin olive oil",
    "1 teaspoon sea salt",
    "3 cups unbleached all-purpose flour",
    "1 cup semolina",
    "Cornmeal or semolina for the baking sheet",
    "For the topping-",
    "4 large fresh sweet red peppers",
    "2 thinly sliced medium onions",
    "3 to 4 garlic cloves, coarsely chopped",
    "¼ cup extra-virgin olive oil",
    "4 large ripe tomatoes, peeled, seeded, and chopped",
    "Sugar",
    "Sea salt and freshly ground black pepper",
    "8 ounces (Spanish style) chorizo, coarsely chopped",
    "¼ cup pine nuts, toasted"
  ],
  "instructions": [
    "To make the dough combine the warm water and the yeast and set it aside until the yeast has thoroughly dissolved.  Transfer the mixture to the bowl of an electric mixture and add the olive oil, salt and 1 cup of flour.  Using the dough hook, mix until well-blended, about 1 minute.  Add the remaining flour and the semolina.  Mix again until the dough forms a ball.  Or; mix the yeast, water, oil, salt, and the flours in a large mixing bowl and knead by hand, first in the bowl then on a lightly greased board, until it’s smooth and elastic.",
    "Turn the dough into a lightly greased mixing bowl.  Cover with plastic wrap and set aside in a warm (and preferably humid) place to rise until double; about 1 hour.",
    "While the dough is rising (Or make ahead!) roast and peel the red peppers.  (If you don’t have a gas grill place the peppers on a cookie sheet and in the oven set on broil.  As they are broiling keep checking the peppers and turning them so that the skins blacken but the insides don’t cook.  When well blackened remove them from the broiler and place inside a plastic bag and set aside to allow them to steam as they cool down.  When the peppers reach a temperature where they can be handled use a paring knife to remove the blackened skins.  Rinse under cold running water and place on paper towels.)  Cut the peppers open and remove and discard the seeds and the internal white membrane.  Cut them into long julienne strips.",
    "In a sauce pan set over medium-low heat add the oil.  When the oil is just barely smoking add the onions and the garlic and sauté until the onions are “very” soft, approximately 10 to 12 minutes.  Add the red peppers, tomatoes, sugar, salt and pepper and mix well.  Taste and adjust the sweetness and saltiness to your taste.  Raise the heat to medium-high and cook the tomato sauce until most of the liquid in the tomatoes has evaporated.  Remove the sauce pan and set aside to cool.",
    "Preheat the oven to 450° F.",
    "Prepare a pair of baking sheets by covering them with parchment and sprinkling them with cornmeal or semolina.",
    "Turn the dough out onto a flat work surface that has been floured.  Punch down the dough and cut it into 4 equal parts.  Roll each quarter into a round ball shape; then using a rolling pin roll each into a long oval.  Place the rolled dough on the baking sheets",
    "Divide the tomato and bell pepper topping onto the four dough ovals; spreading it out to about ¼-inch from the edge (to keep the edges from overcooking).  Lastly, spread the chopped chorizo and roasted pine nuts on top.",
    "Bake the cocas for about 20 minutes, or until their edges are golden brown and the topping is steaming.  Remove the cocas from the cooking sheets and set on a rack to cool slightly before serving.",
    "Yield:  Makes 8 servings (4 cocas).",
    "Source:  The Essentials Mediterranean by Nancy Harmon Jenkins, Harper Collins Publishers, Inc., New York, ©2003 by Nancy Harmon Jenkins."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "02 - Baking"
}