{
  "title": "Clover Leaf Rolls",
  "requires": "",
  "ingredients": [
    "1¼ cups milk",
    "2 tablespoons sugar",
    "4 tablespoons butter, at room temperature",
    "2 teaspoons active dry yeast",
    "1 egg",
    "2 teaspoons salt",
    "3½ to 4 cups all-purpose, unbleached, flour",
    "Melted butter, for glazing"
  ],
  "instructions": [
    "Heat the milk until its lukewarm (between 105° F. and 115° F.); test the temperature with your knuckle if you don’t use a thermometer.  When the milk is ready pour it into a large bowl and stir in the sugar, butter, and the yeast.  After stirring to mix, leave it for15 minutes to dissolve the yeast.",
    "Stir the egg and salt into the yeast mixture.  Gradually stir in 3½ cups of the flour then add just enough extra flour to obtain a rough dough.  Transfer the dough to a floured surface and knead until smooth and elastic.  Place the dough in a buttered bowl, cover with plastic, and leave it in a warm place until it doubles in volume, about 1½ hours.",
    "Grease or spray the insides of two 12-cup muffin tin pans.",
    "When the dough has risen punch down the dough and cut it into 4 equal pieces.  Roll out each piece into a rope 14 inches long.  Cut each rope into18 pieces then roll each little piece into a small ball.  Place three of the small balls, side by side, in each muffin cup.  Cut a piece of waxed paper to cover each pan and spray one side of the waxed paper with Pam©.  Cover the pans after you’ve put the dough balls into the cups and place them in a warm place to let the rolls rise until they double in volume, about 1½ hours.",
    "Preheat the oven to 400° F.",
    "Brush the risen rolls with melted butter.  Bake them until lightly browned, about 20 minutes.  Allow the rolls to cool slightly before serving."
  ],
  "remarks": "",
  "yield": "Makes about 24 rolls.",
  "source": "Yeast Breads, The Cooking Encyclopedia of Baking, Carole Clements, published by Lorentz Books, 27 West 20th Street, New York, NY 10011, © 1994, 2000 Anness Publishing Limited, Updated © 2001.",
  "category": "02 - Baking"
}