{
  "title": "Cornbread",
  "requires": "",
  "ingredients": [
    "4 tablespoons melted butter; or, bacon drippings",
    "¾ cup all-purpose flour",
    "1 tablespoon baking powder",
    "⅓ cup sugar",
    "¾ tablespoon salt",
    "1¼ cup yellow cornmeal; preferably stone-ground",
    "1 egg",
    "¾ cup milk"
  ],
  "instructions": [
    "Begin at least an hour ahead by taking the egg out of the refrigerator and allowing it to come to room temperature.  Similarly, place one of the tablespoons of butter in an 8 x 8 by 2-inch baking dish and allow it also to come to room temperature.  Place the remaining 3 tablespoons of butter in a Pyrex© measuring cup and again set it aside.  Measure out the ¾-cup of milk and set it aside to let it come to room temperature.  Sift together the flour, baking powder, salt, and sugar together into the mixing bowl in which you will mix the batter and set aside.",
    "When you begin the preparation begin by preheating the oven to 425° F.",
    "Start by melting the 3 tablespoons of butter in the measuring cup.  Spread the butter (use a brush if you don’t want to get your fingers greasy) coating the bottom and sides of the baking dish; then be ready to place it, the baking dish, in the heated oven for 15 minutes (when you are finishing making the batter).  You want to pour the cornbread batter into the hot baking dish.",
    "In a small bowl crack the egg, the melted 3 tablespoons of butter and the milk and with a whisk mix the ingredients.  (At this point you should already have the baking dish in the pre-heated oven.  If your baking dish hasn’t been in the pre-heated oven for at least 10 minutes wait!)",
    "Pour the liquid mixture into the dry ingredients and with a whisk thoroughly combine the ingredients to develop the batter with the fewest strokes possible.  Expect the batter to be thick and slightly lumpy.",
    "Remove the hot baking dish from the oven and place on a heating pad.  Carefully, pour the batter into the hot baking dish and with a spatula quickly spread and smooth out the batter.  Return the baking dish to the center rack of the oven and bake for 15 to 20 minutes; until a toothpick inserted in the center comes out clean.",
    "Remove when done and cool the baking dish on a wire rack.  When the cornbread has cooled enough to eat cut it into rectangles and bring to the table.",
    "Remarks:  The most cornbread recipes doesn’t call for sugar but the family tradition is to use just enough sugar to give the cornbread a sweet after taste.",
    "Yield:  Serves 4.",
    "Source:  Family recipe."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "02 - Baking"
}