{
  "title": "Country Onion Bread",
  "requires": "",
  "ingredients": [
    "6 tablespoons (¾ stick) unsalted butter",
    "1 tablespoon olive oil or vegetable oil",
    "1 pound onions, finely diced",
    "1½ teaspoons salt",
    "1½ teaspoons caraway seeds",
    "1½ teaspoons dill seeds",
    "1¼ cups warm water",
    "2 envelopes dry yeast",
    "1 tablespoon firmly packed light brown sugar",
    "½ cup warm water (between 105° F. and 115° F.)",
    "¼ cup molasses",
    "3 cups whole wheat flour",
    "3 cups (or more) unbleached all-purpose flour",
    "Cornmeal",
    "Milk",
    "½ teaspoon caraway seeds",
    "½ teaspoon dill seeds"
  ],
  "instructions": [
    "Melt the butter with the oil in a heavy, large skillet over medium-low heat.  Add the onions and cook them until they are softened and translucent, stirring occasionally, about 10 minutes.  After they are cooked, salt them and let them cool.",
    "Stir 1½ teaspoons each of caraway seeds and dill seeds into 1¼ cups warm water.  Let them stand 20 minutes.",
    "Sprinkle the yeast and sugar into ½ cup of warm water in a bowl of heavy-duty mixer fitted with dough hooks and run to dissolve.  Let the mixture stand until foamy and proofed, about 5 minutes.",
    "Add the water/seeds mixture and the molasses to the yeast mixture.  Add 1 cup each whole wheat and all-purpose flour and mix until the dough is smooth, about 1 minute.  Add the remaining flour, ½ cup at a time, alternating with the onion mixture (including butter and oil in the skillet) and knead until the dough is smooth, elastic and cleans sides of the bowl, 8 to 10 minutes.  (The dough can also be done by hand.)",
    "Oil a large bowl and in it place the dough, turning it to coat the entire surface.  Cover with a piece of plastic wrap and a kitchen towel and let it rise in a warm draft-free area until doubled in volume, about 1 hour.",
    "Line a baking sheet with parchment sprinkled with cornmeal.  Punch down the dough and turn it out onto a well floured surface.  Knead the dough gently for 3 to 4 minutes.  The dough should be springy.",
    "Knead the dough into a smooth 3-inch-high round.  (Or, divide the dough in half and knead each half into smooth 3-inch-high round.)  Transfer to a prepared baking sheet.  Cover the dough with a moistened kitchen towel and again let it rise in a warm, draft-free area until almost double in volume, approximately 35 minutes.",
    "Position a rack in the center of the oven and preheat the oven to 375° F.",
    "Make 3 parallel, ¼-inch-deep slashes, on the tops of the round loafs.  Brush lightly with milk.  Sprinkle with ½ teaspoon each of caraway and dill seeds.  Bake the rounds until they are a rich brown and sound hollow when rapped on the bottoms, about 40 minutes.  If the tops brown too quickly, cover with some parchment.",
    "Cool the bread for 2 hours on a rack before slicing.",
    "Remarks:  You can wrap the bread in plastic wrap and store it at room temperature overnight.  To reheat the next day unwrap the bread and place in a preheated oven, 350° F. for 5 to 7 minutes.  If you make two loafs, you can put one in the freezer wrapped in foil and save it for another occasion."
  ],
  "remarks": "Makes 1 large or 2 small round loafs.",
  "yield": "An Onion Sampler by Edena Sheldon, Bon Appétit, January 1985.",
  "source": "",
  "category": "02 - Baking"
}