{
  "title": "Double Corn Spoon Bread with  and Cheese",
  "requires": "",
  "ingredients": [
    "6 long  green chiles; or, chile Poblanos if you prefer",
    "8 eggs, well beaten",
    "2 (16-ounce) cans of cream-style corn",
    "2 cups (about 8-ounces) grated cheese such as Monterey Jack",
    "1½ cups yellow cornmeal, preferably stone-ground",
    "2 (4-ounce) jars of chopped roasted red (Pimentos) peppers, rinsed and drained",
    "⅔ cup cultured buttermilk",
    "5 pickled jalapeño chiles, stemmed, seeded, and minced (about ⅓ cup)",
    "2 teaspoons baking powder",
    "1½ teaspoons salt",
    "1 teaspoon baking soda"
  ],
  "instructions": [
    "The day or so, before making this recipe, roast the green chiles over an open flame or gas burner; or, under a preheated broiler, turning them until they are charred evenly on all sides.  Remove them from the fire or broiler and place them in a plastic bag and seal.  Allow them to steam, sealed in the plastic bag, until they are completely cooled.  When cooled rub away the burned peel (you can use cold running water to help remove the charred peel).  Stem and seed the chiles then chop them coarsely.  You should have about a 1 cup when done.",
    "Butter a 10- by 12-cup shallow casserole dish and set aside for later.",
    "Position a rack in the middle of the oven and preheat the oven up to 375° F.",
    "In a large mixing bowl, whisk together the eggs, the cream-style corn, and the cheese.  Stir in the cornmeal, the green chiles, red peppers, and the buttermilk.  Finally, add the sugar, the jalapeños, the baking powder, salt, and the baking soda and mix everything well.  Transfer the batter into the prepared casserole dish and place it in the center rack of the oven.",
    "Bake for 35 to 40 minutes; or, until the spoon bread is “puffed” and just “barely” set in the center of the casserole dish.",
    "The spoon bread can be served hot or warm.",
    "Remarks:  The one problem with this dish is the large number of eggs called for.  However, for a large gathering, it sound delicious."
  ],
  "remarks": "",
  "yield": "Serves 8 to 12 persons.",
  "source": "The El Paso Chile Company’s Texas Border Cookbook, by W. Park Kerr and Norma Kerr, published by William Morrow and Co., Inc., New York, © 1992 by W. Park Kerr and Norma Kerr and Michael McLaughlin.",
  "category": "02 - Baking"
}