{
  "title": "Ham Crescents",
  "requires": "",
  "ingredients": [
    "For the dough –",
    "1 envelope active dry yeast",
    "¼ cup lukewarm sour cream; plus 2-3 tablespoons to add when making the dough",
    "2½ cups unbleached all-purpose flour",
    "1stick plus 1 tablespoon butter; chilled and thinly sliced",
    "½ teaspoon salt",
    "For the filling –",
    "2 tablespoons chopped onion",
    "2 tablespoons minced parsley",
    "1 tablespoon butter",
    "11 ounces finely chopped smoked ham (grounded if possible)",
    "3 tablespoons sour cream",
    "1 teaspoon Düsseldorf-style mustard",
    "Making a egg-wash –",
    "1 egg lightly beaten",
    "1 tablespoon water"
  ],
  "instructions": [
    "Making the dough –",
    "In a small bowl proof 1 envelope of active dry yeast in the quarter cup of lukewarm sour cream for 10 minutes.",
    "Into a large mixing bowl sift 2½ cups of unbleached all-purpose flour then cut in 1 stick, plus 1 tablespoon, of chilled and thinly sliced butter.  Using your fingers rub the flour/butter mixture to distribute the butter evenly.  When done sprinkle the mixture with ½ teaspoon of salt and shape the flour/butter mixture with a well in the center inside the mixing bowl and pour in the yeast mixture.  Using a mixing spoon mix until the dough begin to form, then using your hand finish mixing until the dough ball forms.  Adding 2 or 3 tablespoons more of sour cream, if necessary, work to bind the dough into a dough ball; then knead the dough for 5 minutes; or, until the dough is smooth.  Cover the dough with plastic wrap and place it in the refrigerator to chill for 30 minutes.",
    "Making the filling –",
    "In a small skillet set over moderately high heat melt 1 tablespoon of butter and in it sauté 2 tablespoons each of chopped onion and minced parsley; until the onion is golden brown.  (If possible, put the smoked ham through a food grinder fitted with the “fine” blade and grind all of it.  If not, then dice the ham as fine a possible.)  Place the ham and the onion/parsley mixture in a bowl and add 3 tablespoons of sour cream and 1 teaspoon of Düsseldorf-style mustard and mix well.",
    "Assembling –",
    "Remove the dough from the refrigerator and divide it in half.  Return half of the dough back to the refrigerator, covered.  Roll out the second half of the dough into a rectangle as thinly as possible on a floured surface.  Using a fluted pastry wheel cut the dough into 4-inch wide strips (by 5-inch long) rectangles; then cut each rectangle along the diagonal into triangles with a 5-inch base.",
    "Divide half of the filling among the triangles along the base; then with the back of a wooden spoon spread the filling towards the top of each triangle in a single stroke pressing it into the dough as you spread it.  Roll up the triangles starting from the base towards the point of the triangle; lastly, twist the rolled dough into a crescent using your thumb and fingers.  Arrange the crescents, point ends down, 1 inch apart on parchment-lined baking sheets.  When all of them are done brush the tops with the egg wash; cover with plastic wrap and let them rise in a warm place for at least 30 minutes.  (To keep the plastic wrap from sticking to the crescents its best to spray the side of the plastic wrap lying against the crescents with a cooking spray such as Pam©.)  With the remaining dough, roll out and make the crescents in a similar manner.",
    "Preheat the oven set at 350° F; and bake the crescents for 25 minutes; or, until they reach a golden brown.",
    "Remarks:  These crescents are primarily used to accompany soups and salads."
  ],
  "remarks": "",
  "yield": "Makes about 40 pastries.",
  "source": "Gourmet Holidays: , by Lillian Langseth-Christensen, Gourmet Magazine, January 1978.",
  "category": "02 - Baking"
}