{
  "title": "Pizza Dough (Variation #2)",
  "requires": "",
  "ingredients": [
    "3 cups all-purpose flour",
    "1 package active dry yeast",
    "¾ to 1 cup warm water (105° to 115° F.)",
    "2 tablespoons olive oil",
    "1 tablespoon honey",
    "1 teaspoon salt"
  ],
  "instructions": [
    "Place the dry ingredients in a mixing bowl and mix well and set aside.  In a separate bowl stir together the warm water, the olive oil, and the honey and set aside.",
    "Grease, or butter, a bowl (in which to allow the dough to rise) and set aside.",
    "If you have a food processor, add the liquid ingredients to the dry in a slow steady stream until the dough forms on the blade. (You may use up to ¼ cup of additional water, if necessary.)  Without a food processor use an electric beater with dough hooks and, as indicated, add the dry liquid ingredients to the dry and work the mixture until a soft dough forms.",
    "Transfer the dough to lightly floured surface and knead it until it’s smooth and elastic; about a 10 minute process.  Place the dough in the greased bowl and turn it in the bowl to coat the dough with the grease (or butter).  Cover the bowl with a piece of plastic wrap and set it aside in a warm and damp place to rise.  Let the dough rest, for 30 to 45 minutes; longer if the room temperature is too cool.  When the dough is ready it should have at least doubled in volume.",
    "You can use all of the dough to make a large pizza or divide it into halves or fourths to make individual pizzas.  In each case roll the dough into a tight ball (or balls) and place them in a small shallow pan (or pans).  Cover the pan(s) with a damp towel and place them in the refrigerator.  Allow the dough to rest, covered with a damp towel, or towels, in the refrigerator until you’re ready to make the pizzas, as long as 3 to four hours.  However, remove the dough from the refrigerator one hour before baking and allow the dough to come to room temperature.",
    "Yield:  Make enough for four 9- or 10-inch pizzas.",
    "Source:  ’s Nouvelle Stars by Graham Wells, Cuisine Magazine, January 1984."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "02 - Baking"
}