{
  "title": "Pizza Casserole",
  "requires": "",
  "ingredients": [
    "½ cup butter or margarine",
    "1 large onion, chopped (about 1½ cups)",
    "2 8-ounce cans of tomato sauce",
    "¼ pound mushrooms, sliced (about 1⅔ cups)",
    "1 large garlic clove, minced",
    "½ teaspoon dried oregano, crumbled",
    "½ teaspoon dried basil, crumbled",
    "1 8-ounce package spaghetti, cooked al dente and drained",
    "1 4-ounce package thinly sliced pepperoni",
    "8 ounces mozzarella cheese, grated (about 2 cups)",
    "3½ ounces Swiss cheese, grated (about 1 cup)"
  ],
  "instructions": [
    "Preheat the oven to 350° F. and lightly grease a 9- by 13-inch baking dish.",
    "Melt the butter (or margarine) in a heavy medium skillet.  Add the onion and sauté it over medium-high heat until the onion is translucent, about 6 minutes.  Remove the sautéed onion from the skillet into a mixing bowl with a slotted spoon.  (If you are preparing the dish for refrigerating it, and cooking the next day, allow the onion and spaghetti to cool.  If you are cooking the dish the same day you are preparing it, it doesn’t matter if the spaghetti and onion are warm when you putting the ingredients together.)  Combine together the tomato sauce, mushrooms, garlic, oregano, basil, and the onion, mixing thoroughly.  Arrange the spaghetti in the bottom of the prepared dish.  Top the arranged spaghetti with half of the tomato mixture, dot with half of the pepperoni and then sprinkle half of the cheeses on top.  Repeat again; spread on top the cheese the remaining tomato mixture, then the remaining pepperoni, finally sprinkle the remaining cheeses on top.  (The casserole can be prepared ahead up to this point, cover with plastic, and refrigerated for up to one day.)",
    "Bake the dish in the middle of the oven for about 30 minutes.",
    "(Since everything is already cooked to the point of edibility (or may be eaten raw – the cheeses and mushrooms), the time in the oven serves not so much to cook the dish, as to allow the cheeses to melt and the flavors to meld together.  So the time in the oven can best be judged by the development of a brown crust on the melting cheeses.  About 30 minutes in the oven will generally suffice.)",
    "Yield:  Serves 6 to 8 persons.",
    "Source:  Too Busy to Cook?, Bon Appétit Magazine, October 1983."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "02 - Baking"
}