{
  "title": "Tortillas de Maíz (Corn Tortillas)",
  "requires": "",
  "ingredients": [
    "1 pound fresh-ground corn masa for tortillas; or,",
    "1¾ cup powdered corn flour (use Maseca, avoid the Masa Harina brand)",
    "1 cup plus 2 tablespoons hot tap water"
  ],
  "instructions": [
    "Heat a heavy rectangular griddle or (two skillets) to two different temperatures:  one side (or one of the skillets) heat to medium-low; the other side of the griddle (or the second skillet) heat to medium-high.",
    "Cut two squares of plastic to just cover the plates of a tortilla press (to be on the safe side, cut them from a food-storage bag; the thicker plastic is easier for beginners to work with).  Avoid colored plastic.",
    "Knead the masa (either fresh or reconstituted) with the warm water to make a soft (like cookie dough), but not sticky dough.  The softer the dough, the more tender the tortillas – but don’t make it so soft that it sticks to your hands.",
    "Open the press and lay one of the squares of plastic on the bottom plate.  Scoop out a walnut-sized piece of the dough, roll it into a ball and center it in the middle of the plastic.  Cover it with the second square of plastic.  Close the press and use the handle to flatten the ball into a 5- to 6-inch round disk.  Turn the plastic covered round disk of masa 180° and close the press and using the handle gently press to even out the thickness.",
    "Open the tortilla press and peel off the top piece of plastic.  Flip the uncovered side of the tortilla onto your palm, lining up the top of the tortilla with the top of you index finger.  Starting at the top, peel off the remaining sheet of plastic.  Part of the tortilla will be dangling off the bottom side of your hand.  Quickly lay the tortilla onto the cooler side of the griddle (or onto the cooler skillet):  Don’t flip it off your hand, which generally results in rumpled tortillas; instead, as you slowly sweep your hand across the griddle let the dangling part of the tortilla catch on the hot surface, then roll your hand from under the tortilla (the movement looks a little as if you are sweeping something off the griddle with the back of your hand).",
    "Bake for 15 to 30 seconds – just until the tortilla releases itself from the griddle.  It’ll look just a tiny bit dry around the edges, but don’t leave it too long or it will turn out dry and heavy.  Flip the tortilla onto the hot side of the griddle (or onto the hotter skillet) and bake until splotchy brown underneath, 30 to 45 seconds.  Turn it one last time (back to the side you first laid it), leaving it on the hot side, and bake for another 30 to 45 seconds to brown.",
    "During the last few seconds of baking a perfectly made tortilla will puff up like pita bread.  If yours doesn’t , it may have been baked too long on the first side or it may not have been baked on a hot enough surface.",
    "Transfer the cooked tortilla to a cloth-lined basket and continue making tortilla, stacking them one on top of another and keeping them covered.  As the cloth traps the steam, the tortillas will complete their final bit of “cooking.”",
    "Remarks [by Rick Bayless]:  Mexican food without corn tortillas is like Chinese food without rice.  Out of whack.  Missing the very canvas on which to paint all those wonderful flavors.  Now, the centrality of corn tortillas in Mexico may come as a surprise to you, since many of us north of the border don’t choose corn tortillas with our Mexican food.  The reason:  We may never have eaten a good fresh one – a just made one.  Corn tortillas, you see, are at their peak for only a few hours after they’re made.  So, no matter what your circumstances, I encourage you to experience the aromatic moist tenderness of fresh homemade tortillas at least once.",
    "Yield:  Makes 15 tortillas.",
    "Source:  Mexico One Plate at a Time by Rick Bayless, Scribner, 1230 Avenue of the Americas, New York, NY 10020, ©2000 by Rick Bayless."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "02 - Baking"
}