{
  "title": "Villa Italia Sausage Rolls",
  "requires": "",
  "ingredients": [
    "4 (4-inch) links of mild Italian sausage",
    "1 cup water; divided use",
    "3 tablespoons plus 1 teaspoon olive oil",
    "1 medium size onion, peeled and sliced into rings",
    "1 green bell pepper; washed cored, seeded and cut in long, thin julienne strips",
    "1 red pepper; washed cored, seeded and cut in long, thin julienne strips",
    "1 heaping teaspoon dried yeast",
    "1 teaspoon sugar",
    "1½ cups all-purpose unbleached flour",
    "½ teaspoon salt",
    "2 cups mozzarella cheese, grated",
    "Spaghetti or marinara sauce"
  ],
  "instructions": [
    "Preheat the oven to 350º F.",
    "Place the sausage links in an ovenproof container, add ½ cup of cold water, and place in the oven.  Roast the sausage, uncovered, for 30 to 45 minutes.  Remove from the oven and set the sausage on a metal grill and allow them to cool.  When the sausages are cool slice them lengthwise with a sharp knife; each into four equal pieces.  Set aside the sliced sausages lengths.",
    "In a heavy skillet, over medium heat, heat 3 tablespoons of olive oil until barely smoking, and when ready add the prepared onion and bell peppers.  Sauté the mixture for about 2 minutes then reduce the heat to low, cover and continue cooking for 10 minutes, stirring occasionally.  When the onion and bell pepper mixture is done, the onion will be uniformly translucent and the vegetables will be soft.  Remove from the heat and set aside.",
    "This recipe can be done ahead up to this point.  (However, remove the items from the refrigerator and allow them to come to room temperature before using.)",
    "Heat ½ cup of water to 105º to 115º F. in a small soup bowl or cup.  Sprinkle the yeast over the water and stir it until the yeast is completely dissolved.  Mix the sugar, the flour, and the salt in a mixing bowl.  Pour in the dissolved yeast; add a teaspoon of olive oil, and mix well to develop the dough.  Dump the dough onto a well floured work surface and knead lightly until the dough is soft and elastic.  Shape the dough into a ball and place it in a greased bowl; turn it so that the dough ball becomes coated in vegetable oil then cover with plastic wrap and let the dough rise in a draft-free warm environment for at least one hour.",
    "After an hour punch the dough down and knead it a few times, slightly.  Wrap the dough in plastic wrap and refrigerate for an additional hour.",
    "Preheat the oven to 400º F.",
    "Remove the dough from the refrigerator and on a work surface roll the dough into a 14-inch circle.  Cut the circle into four equal parts through the center to obtain 4 large pie shaped wedges.  Into each dough wedge place 4 of the sausage slices, add a fourth of the onion-bell pepper mixture, and a ½-cup of the grated cheese.  Roll the pie wedges, when filled, (from the wide side towards the point of the wedge – giving a last minute twist to each end to form the “horn”) to form a crescent and enclosing the ingredients.",
    "Place the crescents on a baking sheet and bake for 10 to 15 minutes; or, until the crescents are golden brown.",
    "Serve hot with spaghetti or marinara sauce."
  ],
  "remarks": "I would recommend that you make an egg wash using one egg yolk and a tablespoon of water and brush the crescents with this mixture to give the crescents a deeper golden finish when baked.",
  "yield": "Makes 4 individual servings.",
  "source": "Bread Recipe Stirs Memories, Dining Section,  Express-News, Wednesday, February 14, 2007.",
  "category": "02 - Baking"
}