{
  "title": "Yeasty White Bread (Pan Amarillo)",
  "requires": "",
  "ingredients": [
    "For the Sponge –",
    "2 tablespoons active dry yeast",
    "A pinch of sugar",
    "1 cup all-purpose flour",
    "For the Bread –",
    "1½ teaspoon salt",
    "5 cups all-purpose flour",
    "2 teaspoons vegetable shortening",
    "2 teaspoons sesame seeds"
  ],
  "instructions": [
    "Making the Sponge –",
    "In a medium bowl, whisk together the yeast, sugar, flour, and 1 cup warm water.",
    "Let it sit in a warm place for 15 minutes to proof.",
    "Making the Bread –",
    "In another medium bowl, mix the salt, sugar, and 4 cups of flour.  Make a well in",
    "the flour and add the sponge mixture.  Mix well, adding 1 cup more water.  Knead the",
    "dough for 10 to 15 minutes, working in up 1 additional cup of flour.  Put the dough in",
    "a greased bowl, then roll it around in the bowl to insure the dough is coated in the",
    "shortening.  Cover the bowl with a piece of plastic wrap that has had the side, which will",
    "be in contact with the dough, sprayed with Pam©.  Let the dough rise for 20 to 30 minutes,",
    "or until the dough has doubled in size, or until a dent remains when the dough is poked",
    "with your finger.",
    "Turn the dough out onto a floured work surface and knead it 8 times.  Cut the",
    "dough into 4 approximately equal pieces.  Then cut each quarter into 3 equal pieces.  There",
    "should be a total of 12 dough balls when you are done.  Roll each piece into a round ball.  Rub each ball with vegetable oil.  Sprinkle sesame seeds on the work surface.  Invert each ball onto the seeds.  Cover all the dough balls, there on the work surface, with plastic wrap (again spray the side in contact with the dough with Pam©) and let the dough rise on the table for 20 to 30 minutes.",
    "Uncover the dough balls and place them, sesame seeds up, on greased cookie",
    "sheets.  With the palm of your hand flatten each ball, then with a sharp knife, or razor",
    "blade, slice the top of each ball.  (Try to end with the flattened dough balls about one",
    "inch apart when you’re done flattening.)",
    "Place the cookie sheets in a cold oven.",
    "Turn the oven on, set at 400° F.  Bake for 30 minutes or until the bread is lightly",
    "browned and when the bottom crust of the bread makes a hollow sound when tapped.",
    "Remove the bread from the oven and allow it to cool on a rack.",
    "Remark:  This yeasty sandwich bread is made all over the state of Oaxaca where traditionally it is baked in wood-fired adobe ovens."
  ],
  "remarks": "",
  "yield": "Makes 12 rolls.",
  "source": "Seasons of My Heart, A Culinary Journey Through Oaxaca, Mexico by Susana Trilling, published by The Ballantine Publishing Group, © 1999 by Susana Trilling.",
  "category": "02 - Baking"
}