{
  "title": "Flavorful Brown Stock",
  "requires": "",
  "ingredients": [
    "4 parsley sprigs, rinsed and cleaned of yellow leaves plus a handful of stems",
    "1 white onion, chopped",
    "1 cup carrots, peeled and chopped",
    "1 cup celery, chopped",
    "1 imported bay leaf",
    "½ teaspoon thyme tied in washed cheesecloth",
    "2 large whole cloves of garlic, peeled and smashed",
    "1½ cups chopped, seeded but unpeeled ripe tomatoes; or, half fresh and half canned Italian",
    "plum tomatoes",
    "2 to 3 quarts of raw meaty beef bones",
    "1 bottle of inexpensive, full-bodied, red wine (a generic Bordeaux, Burgundy or Cabernet",
    "Sauvignon)"
  ],
  "instructions": [
    "Preheat the oven to 400° F.",
    "Arrange the beef bones in a roasting pan, in 1 layer if possible, and spread over the bones a handful of fresh parsley stems, a chopped onion, 1 cup peeled and chopped carrots, and 1 cup chopped celery.  Roast them for an hour or more in the middle third of the oven, turning and basting them occasionally.  You want the well browned but not burned.  Remove the pan from the oven.",
    "Lift out the ingredients and place everything into the stockpot.  Pour out and discard any accumulated fat.  Place the roasting pan on the grill and deglaze it by pouring in ½ inch of red wine, scrapping up all the brown bits and coagulated juices from the bottom of the pan with a wooden spoon.  Pour all this into the stockpot with the browned bones.",
    "Add all the remaining ingredients listed into the stockpot then add enough cold water to cover everything by 1 inch.  Bring everything to a boil as rapidly as possible, then reduce the heat to a simmer.  (If you keep the stock boiling you will cloud it.)  As the gray scum rises skim it off and discard it.  Keep skimming of the scum until it ceases – usually 7 to 8 minutes.  Set a cover, askew over the stockpot – never cover the pot completely or it will boil and cloud the stock.  Simmer the stock slowly, skimming off scum and fat occasionally, for about an hour.",
    "Remove the stockpot from the heat source and allow it to cool enough for you to be able to work with it comfortably.",
    "Drain the stock through a colander into a large saucepan or bowl, pressing the vegetables with the back of a large spoon to release all of the liquid possible.  Next pour the liquid through a fine-meshed sieve into a large bowl or container.  The fat will actually begin rise to the surface in a few minutes, but place the liquid in the refrigerator uncovered until it is cool then cover it and leave it overnight.  (This step is to remove the fat from the liquid.  To do this, the easiest way will be to refrigerate the liquid until the fat solidifies on the surface, then just lifting it off and discarding it.)",
    "Place the degreased stock in a pot over medium-high heat, add a small amount of salt (just enough that you can begin to taste the salt) and bring it to a boil.  (Up to this point no salt has been added to the stock because reducing the stock would make it too salty.  However, I [Julia Child] find it difficult to judge the stock quality when it has no salt.  So before reducing the stock, I [Julia Child] always stir in a very small amount of salt, just enough so that I can begin to taste the “flavor” of the stock.)",
    "Reduce the stock by half, or more, until it has developed full flavor and strength.  If you’ve done it correctly the reduced stock will taste almost unsalted, or very lightly salted.",
    "Pour the stock into a container, or containers, and let it cool, uncovered, in the refrigerator.  Once cooled, cover it and keep it cool in the refrigerator until you use it; or, freeze it.  Never cover a warm stock or it will sour.",
    "Yield:  Makes 2 to 3 quarts.",
    "Source:  Julia and Jacques Cooking at Home by Julia Child and Jacques Pepin, published by Alfred A. Knopf, Inc., © 1999 by A La Carte Communications."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "04 - Sauces, Stock, and Dressings"
}