{
  "title": "Melted Cheese Casserole with Mexican Sausage and Chiles (Queso Fundido con Chorizo y Rajas)",
  "requires": "",
  "ingredients": [
    "2 medium (about 6 ounces total) fresh poblano chiles",
    "4 ounces (about ½ cup) Mexican chorizo sausage, store-bought (casing removed); or,",
    "homemade",
    "1 medium white onion, sliced",
    "Salt",
    "12 corn tortillas, the fresher the better (store-bought are okay, but homemade will really",
    "shine here)",
    "8 ounces Chihuahua or other Mexican melting cheese, such as quesadilla or asadero",
    "(lacking Mexican cheese, this dish is delicious made with Monterey Jack),",
    "shredded (approximately 2 cups)",
    "About 1 teaspoon or so of crumbled dried oregano, preferably Mexican"
  ],
  "instructions": [
    "Roast the poblano chiles over an open flame or on a baking sheet 4 inches below a very hot broiler, turning regularly, until the skin is evenly blistered and blackened, about 5 minutes for an open flame, about 10 minutes for the broiler.  Be careful not to char the flesh, only the skin.  Cover with a kitchen towel and let stand for 5 minutes.  (Alternatively, place in a plastic bag and let them steam for 5 minutes.  This works best if you don’t have them evenly blistered and blackened.)  Rub off the blackened and blistered skin, then pull or cut out the stems and the seed pods.  Tear the chiles open and quickly rinse to remove any stray seeds and bits of skin that remain.  Cut into ¼-inch wide and about 2-inches long strips.",
    "Pre-heat the oven to 350° F.",
    "In a medium size skillet (preferably nonstick), cook the chorizo over medium heat, stirring to break up any clumps, until half-cooked, about 5 minutes.  (As the chorizo heats, it should render enough fat to cook the meat and onion; if the mixture seems dry (this happens with homemade chorizo), add a little oil.)  Add the onion and cook, stirring frequently, until the onion is richly golden and the chorizo is cooked through, about 10 minutes.  (If the mixture looks very oily, drain it.)  Stir in the poblano chile strips and taste it and season it with salt if you think it needs it.  Transfer the mixture to a 9- or 10-inch shallow baking dish, Mexican cazuela or pie plate if you have nothing else.  (I you finish cooking the mixture and you still think it looks too oily (this happens with poor quality store-bought chorizo), pour the mixture onto a plate in which you’ve set several layers of paper towels.  With a separate, folded, paper towel press the mixture gently to get the paper towels to absorb more of the oil.  Once you’re satisfied that you’ve removed as much oil as you’re going to get then pour the mixture into the baking dish you’re going to use.)",
    "Very lightly dampen a clean kitchen towel.  Check the tortillas to make sure that they are not sticking together.  Wrap them in the towel, then in foil, sealing the edges tightly.  Place the tortillas in the foil in the oven and set the timer for 7 minutes.",
    "When the timer goes off, stir the grated cheese into the warm chorizo mixture.  Set it alongside the tortillas and bake until the cheese is just melted but has not begun to separate or look greasy, about 5 minutes more.  Remove the casserole and tortillas from the oven.  Sprinkle the casserole with the crumbled oregano and serve immediately, accompanied with the tortillas."
  ],
  "remarks": "The chorizo-poblano mixture can be made a day ahead, covered and refrigerated.  Warm it in the casserole dish before stirring in the cheese and baking. This dish, “Queso Fundido” doesn’t hold well, so don’t put it in the oven until everyone is ready to make tacos. Yield:  Serves 6, as an appetizer; 4 as a casual meal. Source:  Mexico One Plate at a Time by Rick Bayless, Scribner, 1230 Avenue of the Americas, New York, NY 10020, ©2000 by Rick Bayless.",
  "yield": "",
  "source": "",
  "category": "03 - Appetizers"
}