{
  "title": "Mini-Swedish Meatballs",
  "requires": "",
  "ingredients": [
    "2 teaspoons butter or margarine",
    "2 tablespoons minced onion",
    "½ cup mashed potatoes",
    "¼ cup fine breadcrumbs",
    "½ pound lean ground beef",
    "¾ cup whipping cream",
    "Salt",
    "1 small egg",
    "Nutmeg, just a pinch",
    "2 tablespoons butter or margarine",
    "1 tablespoon vegetable oil",
    "1 tablespoon flour"
  ],
  "instructions": [
    "Melt the butter in a frying pan over medium-high heat and in it sauté the onion until it becomes pale and golden then remove it from the heat.  Set the onion mixture aside for the moment.",
    "In a mixing bowl combine the mashed potatoes, breadcrumbs, ground beef, ¼ cup of the cream, salt, egg, nutmeg and the sautéed onion.  Mix by hand until the ground beef mixture is light and well blended.  Pinch off a portion of the ground beef mixture, enough to make a marble size meatball, shape the meatball and place it on a plate.  Don’t crowd the meatballs on the plate and if you will need to have two or more levels of meatballs use plastic wrap to separate the levels. Repeat the process until all the meat is used up.  Cover the meatballs with a layer of plastic wrap and place the plate in the refrigerator to chill.  Leave the meatballs chilling until they can be handled without becoming misshaped.",
    "When ready to cook, heat the butter and oil together in a large skillet over medium-high heat.  Add the meatballs to the skillet and immediately lower the heat to medium.  Fry the meatballs, shaking the pan, so that all sides of the meatballs are brown and beginning to caramelize.  Remove them from the frying pan onto paper towels and allow them to drain but keep them warm.",
    "Return the skillet to medium-high heat, sprinkle the flour into the skillet juices, and stir to make a roué.  As the roué develops and starts to brown add the remaining cream.  Cook until the mixture thickens slightly.",
    "Pour the gravy over the meatballs and serve.",
    "Yield:  Make an appetizer for 6.",
    "Source:  Foreign Intrigue, Appetizer Favorites, by Zack Hanle,  Bon Appétit, October 1977."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "03 - Appetizers"
}