{
  "title": "Red Flannel Hash",
  "requires": "",
  "ingredients": [
    "3½ pounds uncooked lean corned beef; or, 1½ pounds unsliced cooked corned beef",
    "2 pounds red potatoes",
    "1 tablespoon salt",
    "A 16-ounce cooked beets, drained",
    "1 tablespoon bottled horseradish, or to taste, drained",
    "½ stick (¼ cup) unsalted butter",
    "½ cup heavy cream"
  ],
  "instructions": [
    "In a kettle of boiling water simmer the uncooked corned beef, covered, for 3 hours and 30 minutes to 4 hours; or, until it is tender.  Let the beef cool in the liquid, covered partially, then drain it and chill it, wrapped in foil, overnight.",
    "In another kettle combine the potatoes with enough water to cover them by 1½-inches and bring the water to a boil.  Add the salt and simmer the potatoes, covered, for 20 minutes, or until they are just tender.  Drain the potatoes, let them cool, and then chill them, covered, overnight.",
    "Cut the cooked corned beef across the grain into ½-inche slices and arrange the slices in one layer on a cutting board.  Cut the potatoes into ½-inche slices and arrange the slices over the corned beef.  Cut the beets into ½-inche slices and arrange the slices over the potatoes.  With a meat cleaver or large knife chop the mixture together until it is cut into ⅓-inch pieces and transfer it to a large shallow 3-quart baking dish.  Add the horseradish, 2 tablespoons of the butter, cut into bits, and pepper to taste, combine the mixture well, and bake it, covered, in a preheated moderately hot oven (375° F.) for 30 minutes.",
    "Tamp down the hash with the back of a spatula, dot it with the remaining 2 tablespoons butter, and drizzle it with the cream.  Bake the hash, uncovered, in a preheated very hot oven (450° F.) for 20 minutes, or until the top is golden and crisp.  Transfer the hash with a large spoon to a heated large platter and arrange fried green tomatoes around it.",
    "Sprinkle the hash and the tomatoes with parsley and serve."
  ],
  "remarks": "",
  "yield": "Serves 8.",
  "source": "Gourmet’s Menus:  Alfresco Breakfasts, Gourmet Magazine, September 1982.",
  "category": "03 - Appetizers"
}