{
  "title": "Spiced Beef Empanadas",
  "requires": "Pastry Crust Mix, look in the “Bread, Cakes, and Cookies Folder” for the recipe; use the measured as if for a double crust 8-inch pie.",
  "ingredients": [
    "1 teaspoon salt",
    "¼ cup raisins",
    "½ cup minced onion",
    "2 tablespoons oil",
    "½ pound ground chuck",
    "2 tablespoons pone nuts",
    "2 chilies pequins, crushed",
    "a pinch of cinnamon",
    "½ teaspoon ground cumin",
    "1 egg, lightly beaten"
  ],
  "instructions": [
    "Measure out and prepare the pastry crust mix as per instructions, except one needs only one dough ball, not two.  Dust the dough with flour and chill it, wrapped in wax paper for 1 hour.",
    "In a small bowl let the raisins soak in 1 cup of boiling water for 10 minutes then drain them and reserve them for use when you make the ground chuck.  In a small skillet lightly brown the pine nuts over medium heat and reserve them for use with the ground chuck.",
    "In a skillet sauté the minced onion in the 2 tablespoons of oil over moderately high heat for 5 minutes, or until the onion is softened and translucent.  Add the ground chuck, the raisins, the pine nuts, the chilies pequins, 1 teaspoon of salt, the ground cumin, and a pinch of cinnamon.  Cook the mixture over moderate heat for 5 minutes, or until the meat is no longer pink.  Remove the pan from the heat and let the mixture cool.",
    "Roll out the dough to approximately ⅛ inch thickness on a floured surface and with a 5 inch round cutter, cut out as many rounds as possible.  You should be able to make at least 6 or more.  Divide the filling among the rounds and brush the edges of each round with water.  Fold the rounds in half, shape them into crescents, and with a fork, crimp the edges to seal the empanadas decoratively.  Arrange them on a lightly buttered, or Pam sprayed, baking sheet and brush them with the lightly beaten egg.  Bake the empanadas in a preheated moderately hot oven set at 375° F. for about 30 minutes.",
    "Remarks:  An excellent “dish” for a picnic; or to make in order to save money when traveling.  Prepare ahead and then wrap them individually in foil and store on top of the drinks (so that they don’t come in contact with the ice) in an ice chest.  An hour or so before eating take them out and set them on the dash in the sun."
  ],
  "remarks": "",
  "yield": "Serves 4.",
  "source": "Gastronomie San Argent:  Meat Pies, Gourmet Magazine, October 1977.",
  "category": "03 - Appetizers"
}