{
  "title": "Asian Style Stir Fry with Chicken",
  "requires": "",
  "ingredients": [
    "3 Boneless chicken breasts cut in diagonal ¼-inch strips",
    "1 teaspoon salt",
    "1 teaspoon black pepper",
    "1 tablespoon oil",
    "2 cloves garlic, minced",
    "1 piece fresh ginger, approximately 1-inch, peeled and minced",
    "6 green onions cut diagonally ¼-inch thick",
    "½ red bell pepper, cut into ¼-inch strips",
    "¼ yellow bell pepper, cut into ¼-inch strips",
    "1 carrot, peeled and cut into 2-by-¼-inch sticks",
    "3 ounces snow peas",
    "Cooked white rice",
    "For the Sauce:",
    "3 tablespoons soy sauce",
    "2 tablespoons vinegar",
    "1 teaspoon hot sauce (optional)",
    "2 tablespoons ketchup",
    "¾ cup pineapple juice",
    "2 teaspoons sugar",
    "2 teaspoon cornstarch"
  ],
  "instructions": [
    "Make preparations first by cutting up all the ingredients in the proper size and quantities and set them aside.  Start by first mixing the sauce.",
    "Mix the first six ingredients of the sauce then add the cornstarch and stir until the sauce is smooth.  Set it aside.",
    "Season the chicken with the salt and pepper after you’ve cut it as indicated.  Heat your wok over medium-high heat.  When the wok is hot add the oil and swirl it around to coat the surface of the wok.  Add the chicken, ginger, and the garlic to the wok and stir fry until the chicken strips are seared on all sides.  Remember to stir constantly to prevent the ginger and garlic from burning.  Once the chicken is done remove the mixture of chicken, ginger, and garlic from the wok and set aside.",
    "Return the wok to the heat and add the vegetables.  Stir fry about 5 minutes, then add 2 tablespoons of water and reduce the heat to medium, and cook for 2 minutes.",
    "Turn the heat back up to medium-high and return the chicken mixture to the wok.  When the chicken and vegetables are mixed, stir the sauce and add it to the pan.  Cook until the sauce thickens and begins to bubble, stirring constantly.",
    "Remove for the heat and serve over white rice.",
    "Yield:  Serves 5.",
    "Source:  More or Less Gourmet:  Wok cooking easy as , by J. A. Henckels, Food & Dining Section of the San Antonio Express News, Wednesday, July 17, 2002."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}