{
  "title": "Bacon-Wrapped Meatloaf with Brown Sugar-Ketchup Glaze",
  "requires": "",
  "ingredients": [
    "Meatloaf –",
    "2 teaspoons vegetable oil",
    "1 medium onion, chopped",
    "2 garlic cloves, minced",
    "2 large eggs",
    "1 teaspoon dried thyme leaves",
    "1 teaspoon salt",
    "½ teaspoon ground black pepper",
    "2 teaspoons  mustard",
    "2 teaspoons Worcestershire sauce",
    "¼ teaspoon Cayenne pepper",
    "½ cup milk, buttermilk, or low-fat plain yogurt",
    "1½ pound lean ground beef",
    "½ pound ground veal",
    "½ pound ground pork",
    "1 cup crushed saltine crackers; or, 1½ cups fresh breadcrumbs",
    "½ cup minced fresh parsley leaves",
    "6 ounces of thin-sliced bacon (about 8 to 9 slices)",
    "Glaze –",
    "½ cup ketchup, chili sauce, or meatloaf sauce",
    "2 tablespoons light brown sugar"
  ],
  "instructions": [
    "Mix the glaze ingredients and set aside.",
    "Preheat the oven to 350° F.",
    "In a skillet heat the oil over medium-high heat.  When the oil is lightly smoking add the onion sauté.  When the onion begins to show translucency add the garlic and finish sautéing until the onion is softened (about 5 minutes).  Remove from the heat and set the mixture aside to cool.",
    "Mix the eggs with the thyme, salt, pepper, mustard, Worcestershire sauce, Cayenne pepper, and the milk and set aside.  In a large mixing bowl place all the ground meats, the crushed crackers (or breadcrumbs), parsley, and the cooked onions.  Start mixing by hand before adding the egg mixture.  Continue working the mixture by hand until all the ingredients are well mixed.  If the meatloaf mixture sticks to the sides of the mixing bowl add additional milk, a couple of tablespoons at a time, and continue mixing until the mixture stops sticking to the sides of the mixing bowl.",
    "Turn the meat mixture onto a work surface.  With wet hands, pat the mixture into a loaf, about 9-by-5 inches.",
    "To bake free form –",
    "Cover wire rack with foil; prick the foil in several places with a fork.  Place the rack on a shallow roasting pan lined with foil for easy cleaning.  Set the formed loaf on the rack and brush it with the glaze (apply the entire glaze).  Arrange the bacon slices crosswise, over the meatloaf, overlapping them slightly and tucking the ends under the loaf to prevent curling.",
    "Bake the meatloaf until the bacon is crisp and the meatloaf reaches 160° F. internal temperature, about 1 hour.  Let the meatloaf sit for at least 20 minutes before slicing and serving.",
    "To bake in a loaf pan –",
    "If baking in a loaf pan, omit the bacon and double the amount of Glaze.",
    "Turn the formed meatloaf mixture into a loaf pan.  (Preferably, a meatloaf pan set:  A perforated bottom loaf pan with a drip pan.)  Use a fork, of some other kitchen implement, to separate the meatloaf away from the pan sides.  Brush with at least half of the glaze before placing in the oven.  Bake the meatloaf until the glaze is set, about 45 minutes.  Remove the meatloaf from the oven and brush the meatloaf with the remaining glaze.  Return the meatloaf to the oven and continue baking until the second coat of glaze is set and a meat thermometer registers 160° internally (about 15 minutes).",
    "Let the meatloaf sit for at least 20 minutes before slicing and serving."
  ],
  "remarks": "",
  "yield": "Serves 6 to 8 persons.",
  "source": "Do ya think I’m sexy? by Bonnie Walker, Food Section, San Antonio Express-News, February 16, 2005.",
  "category": "06 - Main Meals"
}