{
  "title": "Basque Pork Ribs in Adobo with Potatoes and Green Peppers",
  "requires": "",
  "ingredients": [
    "3 pounds partially boned “country style” pork ribs, each length cut into thirds",
    "1 head of garlic, the cloves peeled and crushed",
    "4 tablespoons sea salt",
    "1 teaspoons black pepper, freshly ground",
    "1 tablespoon dried oregano, preferably Greek or Sicilian",
    "¼ cup dry white wine",
    "2 tablespoons extra-virgin olive oil",
    "1½ pounds potatoes, peeled and thickly cut into chunks",
    "1 large (or two medium) yellow onions, coarsely chopped",
    "2 large sweet green peppers, stemmed, cored, and coarsely chopped",
    "2 large bay leaves"
  ],
  "instructions": [
    "Clean and dry the pork on paper towels.",
    "Into a mortar add pour in the salt.  In the mortar crush all of the garlic cloves into the salt (or use a bowl of adequate and the backside of a spoon if you don’t have a pestle and mortar) to make a uniform salt and garlic paste.  Add the black pepper and oregano and continue working the ingredients into the paste using the pestle (or the backside of the spoon) until you have a smooth paste.  Pour in the wine and mix well using a whisk.",
    "Rub this marinade all over the surface of the pork pieces and set aside to marinate overnight in the refrigerator.  (Us a plastic bag and cut down the odors in the refrigerator.)",
    "When ready to proceed, remove the pork from the refrigerator and pat the individual pieces dry with paper towels.  In a heavy saucepan heat the olive oil over medium-high heat and brown the pork rib pieces.  When the ribs are all thoroughly brown, add boiling water; enough to just cover the meat.  When the water has returned to a simmer, lower the heat to medium-low, cover the pan, and simmer gently for 15 minutes.  At this point add the potatoes, onions, green peppers, and bay leaves.",
    "Bring the stew back to a simmer.  Lower the heat to low, to just maintain a bare simmer, and cover again.  Allow the stew to simmer “gently” for 30 to 45 minutes, until the potatoes are very tender.",
    "If the stew is too liquid for your taste (it should be somewhat “soupy”), remove the lid and boil rapidly until it has reached the “right” consistency.",
    "Remarks:  The stew can be made ahead and reheated.  (In fact, it will actually improve in taste and flavor.)",
    "Yield:  Serves 8.",
    "Source:  The Essentials Mediterranean by Nancy Harmon Jenkins, Harper Collins Publishers, Inc., , ©2003 by Nancy Harmon Jenkins."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}