{
  "title": "Beef Roulades in Burgundy Sauce",
  "requires": "A sheet of wax paper cut to the size of the casserole dish, in which you will be cooking the rice, buttered on one side.  Also requires kitchen string and toothpicks.",
  "ingredients": [
    "Boneless sirloin steak, cut into at least 12 thin slices, 5 by 3 inches rectangles",
    "¼ cup minced onion",
    "¼ cup minced mushrooms",
    "½ cup rice",
    "1 cup chicken stock, heated to boiling when used",
    "½ stick (¼ cup) plus 2 tablespoons butter",
    "1 egg",
    "3 tablespoons fresh bread crumbs",
    "2½ cups brown sauce",
    "½ cup red wine (preferably Burgundy)",
    "salt and pepper to taste"
  ],
  "instructions": [
    "In a flame proof casserole sauté the onion in 2 tablespoons of butter over medium-high heat until its soft and translucent.  Add the mushrooms and cook the mixture for 5 minutes.  Add the raw rice and stir it until it is well coated with butter then add the cup of boiling chicken broth.  Add salt and pepper to taste then place on top of the rice mixture the buttered sheet of wax paper.  Cover this a lid and bake in a preheated moderate oven, 350° F. for 20 to 25 minutes, or until the rice is tender and the liquid has been absorbed.  Let the mixture cool.",
    "Remove the wax paper and stir in 1 egg, lightly beaten, and 3 tablespoons of bread crumbs.  (You don’t want to add the egg while the rice is hot.)  Adjust the salt and pepper if necessary and set aside.",
    "In a sauce pan combine the brown sauce with the wine and simmer it for 30 minutes.",
    "Cut a boneless sirloin, into as many thin rectangular portions as possible, measuring 5 by 3 inches.  You should try for at least 12, since this recipe will make 12 beef roulades.  Season the cut sirloin slices on both sides with salt and pepper.  Place some of the rice mixture in the center of each sirloin slice and then roll and tie the ends with kitchen string, tuck in the ends,.  (You may wish to have some toothpicks handy in case you need to pin shut any gaps in the meat that might occur through which the rice mixture may spill out.)  In an oven proof skillet, just large enough to hold all the roulades, brown them in batches using the ½ stick of butter.  When all are browned arrange them all together in the same skillet, add the wine sauce and bring to a boil.  Once the sauce begin to boil transfer the skillet to a preheated moderately hot oven, 350° F., and bake the roulades, covered, for 1 hour and 15 minutes, or until they are tender.",
    "Remove the roulades from the oven.  As soon as you can handle them cut off the strings,  remove any toothpicks, and transfer the roulades to a heated serving dish.  Skim off any excess fat from the sauce and pour it over the roulades before serving."
  ],
  "remarks": "",
  "yield": "Serves 4 to 6.",
  "source": "You Asked For It, Gourmet Magazine, February 1974.",
  "category": "06 - Main Meals"
}