{
  "title": "Beef Stroganov La Marmite",
  "requires": "",
  "ingredients": [
    "½ stick (¼ cup) unsalted butter",
    "2 tablespoons flour",
    "1 cup canned beef broth",
    "2 teaspoons dry mustard",
    "¼ cup plus 1 teaspoon dry white wine",
    "1 teaspoon sugar",
    "¼ teaspoon freshly ground pepper",
    "3 tablespoons sour cream, or to taste",
    "2 ounces mushrooms, cut into julienne strips",
    "½ onion, sliced thin",
    "½ pound fillet of beef, cut into ¼-inch-thich strips",
    "buttered egg noodles as an accompaniment"
  ],
  "instructions": [
    "In a heavy saucepan melt 2 tablespoons of the butter over low heat, add the flour, and cook the roux, stirring, for 3 minutes.  Add the broth in a stream, whisking, bring the mixture to a boil, whisking, and simmer it, stirring, for 5 minutes.  In a small bowl dissolve the mustard in 1 teaspoon of the wine, add the mixture to the pan with the sugar, the pepper, and the sour cream, and simmer the mixture for 3 minutes.  Keep the sauce warm, covered.",
    "In a heavy skillet cook the mushrooms and the onion in 1 tablespoon of the remaining butter over moderate heat, stirring, until the vegetables are softened and add them to the sauce.",
    "Add the remaining tablespoon of butter to the skillet, heat it over moderately high heat until the foam subsides, and in it sauté the beef, patted dry and seasoned with salt and pepper, stirring, for 45 seconds to one minute, or until it is browned on the outside but still very pink within.  Transfer the beef with a slotted spoon to the sauce.",
    "Pour off the excess fat from the skillet, and add the remaining ¼ cup wine.  Deglaze the skillet, scraping up the brown bits, reduce the liquid by half, and stir it into the Stroganov mixture.  Heat the mixture over moderately low heat stirring, until it is heated through and serve over the noodles."
  ],
  "remarks": "The key to this dish is sautéing the beef.  The tendency is to over cook the beef strips, making the beef tough.  Of course, one can compensate for this by using a higher quality cut of beef, but the purpose of this recipe is to make and excellent dish using a medium quality cut of beef.",
  "yield": "Serves 2.",
  "source": "Summer in St. Moritz, Richard Condon, Gourmet Magazine, July 1984.",
  "category": "06 - Main Meals"
}