{
  "title": "Beerocks ( German Meat Pie)",
  "requires": "",
  "ingredients": [
    "1 tablespoon olive oil",
    "1 medium onion, chopped",
    "1 clove, garlic, pressed (or, smashed and chopped)",
    "1 pound lean ground beef",
    "1½ teaspoons salt",
    "1½ teaspoon lemon pepper",
    "1 small head cabbage, chopped (or, to personal preference)",
    "2 tablespoons Worcestershire sauce",
    "2 teaspoon caraway seeds",
    "2 loaves frozen bread dough, thawed"
  ],
  "instructions": [
    "In a skillet, heat the oil over medium-high heat until it’s barely smoking.  Add the chopped onion and cook until it just begins to turn translucent then add the garlic.  Continue cooking until the onion is cooked and fully wilted and translucent.  Add the thawed ground beef, the salt and lemon pepper and cook the mixture until the ground beef is browned.  Add the cabbage, the Worcestershire and caraway seeds and cook until the cabbage becomes limp.  Remove the skillet from the heat and drain off all of the accumulated liquid; pressing with a large spoon to force out as much of the liquid as possible.",
    "Preheat the oven to 350° F.",
    "On a lightly floured surface, roll out each loaf of dough into a 12-inch circle and cut it into six wedges, through the center (pie shaped wedges).  Spoon the cabbage-meat mixture evenly into the center of each wedge; the pull the three points of each wedge to the center and pinch them together to seal.  Using a little flour on your fingers, pinch the side edges to seal around the filling, making three seams.",
    "Place the beerocks on a lightly greased cookie sheet and bake them for 30 minutes in the center rack of the heated oven.  The bread should be golden brown when you remove the beerocks from the oven.",
    "Serve hot; or, allow them to cool before wrapping them for storage in the freezer to reheat at a later date."
  ],
  "remarks": "",
  "yield": "Makes 12 beerocks.  (Approximately 310 calories, 10 g fat, 25 mg cholesterol, 700 mg sodium, 42 g carbohydrate, 14 g protein per beerock).",
  "source": "High amounts of vitamin C found in cabbage by John Griffen, recipe from Bridgford Food Corp., Food Section, San Antonio Express-News, March 16, 2005.",
  "category": "06 - Main Meals"
}