{
  "title": "Boneless Breast of Chicken",
  "requires": "",
  "ingredients": [
    "4 whole chicken breasts, boned (8 boneless half breasts)",
    "10 large fresh mushrooms, chopped; or, 1 can (8-ounces) mushroom stems and pieces",
    "drained and chopped",
    "1 tablespoons shallots, finely chopped",
    "½ cup butter, divided",
    "Salt and white pepper to taste",
    "Chicken stock or milk",
    "4 tablespoons all-purpose flour",
    "½ cup half-and-half cream"
  ],
  "instructions": [
    "Line a shallow baking pan with foil and grease it well.",
    "Remove any fatty tissue from the chicken breasts then rinse and pat them dry with paper towels.  Using two pieces of plastic wrap, place a chicken breast between the pieces of plastic; and with a meat-tenderizing hammer pound the breasts to flatten them to between ¼ to ½-inch thickness.  Set the breasts aside after you’ve flatten them.  [You are going to lay some of the mushroom mixture, below, on each breast and then fold the breast to enclose the mixture and pin it closed with toothpicks.  Thus, the flatter you can pound the breast the easier it will be.  If you don’t have a meat-tenderizing hammer use a heavy, small pan or skillet. You won’t go wrong pounding the breasts as thin as possible.  I [Sergio] did it and it works better when you’re stuffing them.  When I made Chicken Kiev I left the breasts in between the pieces of plastic wrap, in which I pounded them; then, just unwrapped one breast at a time as I worked at stuffing and pinning them closed.]",
    "Sauté the mushrooms and shallots in ¼ cup butter over medium heat for 5 minutes, stirring constantly.  After 5 minutes add the salt and pepper to your taste.  Remove from the heat and let the mixture cool.",
    "Preheat the oven to 375° F.",
    "Lay each breast, one at a time, on a flat surface and place some of the mushroom mixture on half of it.  Fold over the breast and secure the edges with toothpicks to ensure that mushroom mixture doesn’t fall out as they are cooking.  Place each breast, when you’ve finished stuffing it, in the greased baking pan.  When all breasts are stuffed bake the breast for 40 minutes in the 375° F oven.",
    "Reduce the heat of the oven to 350° F., and using a brush baste the chicken occasionally, with the drippings, if they seem to be browning too rapidly.  Bake the breasts this way for an additional 10 to 15 minutes or until the chicken is done.  [If you pounded the breast flat and you have mushrooms in the center of each piece there shouldn’t be any pinkness showing even though the breasts are puffed up.  It’s when you cook thick pieces of chicken that it may show pinkness and require further cooking.]  Remove the chicken breasts to a serving platter and place them where they may retain their heat.",
    "Pour the chicken drippings that remain in the baking pan into a measuring cup and add either chicken stock or milk to make a complete cup.  In a small saucepan melt the remaining ¼ cup butter over medium heat.  When melted add the flour, stirring constantly to make a roux [a wire whisk works well here].  When you have the roux well mixed remove the pan from the heat and stir in the cup of chicken drippings/chicken stock and the cream.  Stir until the sauce is smooth then return the pan to the heat and cook for 3 to 4 minutes, stirring constantly.",
    "Serve the chicken with the sauce immediately.",
    "Remarks:  This recipe can easily be cut in half, which better matches what a package of boneless chicken breasts normally has.  You would normally have to buy two packages of boneless chicken breast to use these measurements because what one buys as boneless chicken breasts are really half breasts.",
    "Yield:  Serves 6 to 8 (at ½ breast per person).",
    "Source:  The Williamsburg Cookbook, Updated 1975 Edition, Published by The Colonial Williamsburg Foundation, Williamsburg, Virginia."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}