{
  "title": "Braised Chicken with Vinegar and Tarragon (Poulet au Vinaigre à l’Estragon)",
  "requires": "",
  "ingredients": [
    "a 10-ounce can of pearl onions (about 2½ cups)",
    "(blanched in boiling water for 1 minute, drained and peeled)",
    "2 tablespoons vegetable oil",
    "1 tablespoon unsalted butter",
    "3½ pounds of chicken pieces",
    "1 cup tarragon white-wine vinegar",
    "½ cup dry white wine",
    "1 cup chopped and drained canned whole tomatoes",
    "2 tablespoons finely chopped fresh tarragon or 1 teaspoon dried, crumbled",
    "4 teaspoons arrowroot or 1½ tablespoons cornstarch",
    "(dissolve either the arrowroot or cornstarch in 2 tablespoons of cold water)"
  ],
  "instructions": [
    "In a saucepan of boiling salted water boil the onions for 10 minutes, or until they are just tender, drain them well and set aside.",
    "Trim and wash the chicken, drained it and pat it dry with paper towels.  Season it with salt and pepper.  In a heavy kettle heat the oil and the butter over moderately high heat until the mixture is hot but not smoking and brown well the chicken in batches.  Transfer the pieces of chicken as they are done to a platter.  When all chicken has been browned pour out any fat that remains in the kettle and add the onions and sauté them, stirring, for 1 minute.  Remove and reserve the onions from the kettle.  Add the vinegar and the wine and bring the liquid to a boil, scraping up the brown bits, until it has been reduced by half.  Add the broth, the tomatoes, onions, (the dried tarragon, if using dried) and the chicken and bring the mixture to a boil.  Once the mixture reaches a boil reduce the heat and simmer it, covered, for 25 minutes, or until the chicken is cooked through.  (The chicken may be prepared up to this point 1 day in advance.  Let it cool, uncovered, then chill it, covered.  Reheat the mixture before proceeding the next day.)",
    "Transfer the chicken and the onions with a slotted spoon to a heated platter and keep them warm, covered with foil.  Stir in the arrowroot or cornstarch thickener to the mixture and simmer, cooking the liquid (with half the chopped fresh tarragon, if using) and simmer the sauce, stirring, for 1 minute.  Spoon the sauce over the chicken and sprinkle the remaining fresh tarragon over the chicken.",
    "Yield:  Serves 6.",
    "Source:  Gourmet’s Menus:  Dinner à la Française:  Gourmet Magazine, May 1991.  See photo on opposite page.",
    "Braised Chicken with Vinegar and Tarragon",
    "(Poulet au Vinaigre à l’Estragon)"
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}