{
  "title": "Capitolade of Roast Fowl",
  "requires": "",
  "ingredients": [
    "For the Creamed Chicken or  –",
    "3 tablespoons unsalted butter",
    "2 tablespoons minced scallion; including some of the green parts",
    "Pinch of dried thyme, crumbled",
    "1½ tablespoons all-purpose flour",
    "¾ cup chicken stock",
    "¼ cup dry white wine; or, vermouth",
    "2½ to 3 cups of leftover roast turkey or chicken, cut into bite-sized pieces",
    "½ teaspoon salt",
    "Pinch of freshly grated nutmeg",
    "Fresh ground black pepper",
    "½ cup heavy (whipping) cream",
    "1 egg yolk",
    "2 teaspoons fresh lemon juice",
    "Pinch of crushed red pepper",
    "1 tablespoons fresh chopped parsley",
    "For the Cream Biscuits –",
    "2 cups all-purpose flour",
    "2½ teaspoons baking powder",
    "1 teaspoon salt",
    "3 tablespoons unsalted butter, well chilled and hard",
    "2 tablespoons lard; or, vegetable shortening, well chilled and hard",
    "¾ cup heavy (whipping) cream"
  ],
  "instructions": [
    "Making the Cream Biscuits –",
    "Preheat the oven to 450° F.",
    "Sift together the flour, the baking powder, and the salt into a medium size mixing bowl.  Cut in the butter and shortening (or lard) into the flour, then using a pastry blender blend in the cold butter and shortening until the mixture resembles a roughly blended cornmeal mixture.  (The butter/shortening bits should be about the size of small peas.)  Add the cream gradually, using a fork to mix and blend the mixture until a soft dough ball forms.",
    "Turn the soft dough out onto a lightly floured work surface and with floured hands knead it briefly.  (It’s important that you not over knead the biscuit dough otherwise the biscuits will turn out hard.)  Pat out the dough (or roll it out with a rolling pin) to ½-inch thick then cut out the biscuit rounds.  The biscuits should be 2½-inch rounds for this recipe.  Recombine the remaining dough scraps and repeat the procedure of rolling or patting down the dough to cut out additional biscuits until all the dough is used up.",
    "Place a layer of parchment paper on a baking sheet (or spread some cornmeal on it) and arrange the biscuits at least 1- to 1½-inches apart.)  Place the baking sheet on the center rack of the preheated oven and bake until golden brown; about 12 to 15 minutes.",
    "Remove from the oven and place on a wire rack to cool slightly.  Serve warm.",
    "Making the Creamed Chicken or  –",
    "In a heavy medium size saucepan, set over medium-low heat, melt the butter.  When the foaming from the butter subsides add the scallion and the thyme and sauté until the scallions are softened but not browned.  This should take about 3 minutes depending on the heat setting and the saucepan.  Stir in the flour, stirring constantly, and cook for about 2 minutes.  Whisk in the chicken stock and the wine and do not allow the mixture to come to a boil as you are blending.  When all the liquid has been added reduce the heat setting to low and simmer, uncovered, until the mixture has thickened slightly; about 10 minutes, again depending on the saucepan and heat source.  Add the turkey or chicken pieces and toss or mix to coat the pieces evenly.  At this point add the salt, pepper, and nutmeg to suit your taste.",
    "In a separate small mixing bowl whisk together the cream, egg yolk, and the lemon juice; then add this mixture into the saucepan and stir until everything is thoroughly combined.  Finally, add the crushed red pepper and cook, uncovered, stirring occasionally, still at low heat, until the sauce is lightly thickened and the turkey or chicken is heated through; about 5 minutes.  (You should not allow the mixture to come to a boil.)",
    "Remove from the heat, pour into a serving bowl, sprinkle the chopped parsley over the mixture, and bring to the table immediately.  Serve over the warm Cream Biscuits."
  ],
  "remarks": "This used to be once-a-week standard fare in the Army mess hall breakfasts where the soldiers had an obscene name for it.  However, it was served over toasted white bread instead of biscuits.",
  "yield": "Serves 4.",
  "source": "The Great Gastronome by Bert Greene, Cuisine Magazine, March 1984.",
  "category": "06 - Main Meals"
}