{
  "title": "Catalan Estouffat",
  "requires": "",
  "ingredients": [
    "2 pounds boneless lean pork, cut into “stewing size” pieces",
    "2 tablespoons extra-virgin olive oil",
    "2 medium size onions, coarsely chopped",
    "2 whole heads of garlic, the cloves peeled but left whole",
    "2 medium carrots, peeled and cut into pieces",
    "1 celery stalk, cut into pieces",
    "1 cup dry red wine, preferably a Spanish Rioja",
    "2 tablespoons aged sherry vinegar",
    "Sea salt and freshly ground black pepper",
    "2 bay leaves",
    "1 (3-inch) cinnamon stick",
    "1 teaspoon chopped fresh thyme; or, ½ teaspoon dried",
    "About 1 cup chicken or beef stock",
    "8 dried figs",
    "½ cup finely minced flat-leaf parsley"
  ],
  "instructions": [
    "Trim and clean the pork meat and using paper towels dry it well.  Cut it into small chunk for the stew and set aside.",
    "In a heavy saucepan, or casserole dish, heat the olive oil over medium-high heat.  When the olive oil is barely smoking begin sautéing the pork.  (It’s important that one not add too many pieces of pork at once otherwise the juices the pork release will overwhelm the evaporation process and instead of sautéing you will be cooking the pork and the caramelization we want to occur on the pork will not occur.  Sauté the pork in batches in the hot oil, removing individual pieces of the pork to a plate as they brown, until all the pork has been sautéed.)",
    "When all the pork has been browned return all the pork to the saucepan, or casserole dish, and add and stir in the onions, garlic cloves, carrots, and the celery; continue cooking over the same heat level for another 15 minutes; or, until the vegetables start to soften.  Add the wine and the vinegar and stir; add the salt and pepper, the bay leaves, cinnamon, and the thyme and again stir the mixture.  When the mixture is well stirred, add enough of the chicken or beef stock to just cover the meat and vegetables.  Lower the heat source to its lowest setting, just enough to maintain a bare simmer, cover the saucepan, or casserole dish, and allow the stew to cook gently for 2 to 3 hours; or, until the meat is “fork tender.”",
    "Cut the dried figs into quarters, discarding the tough stems, place them in a heat proof bowl and pour boiling water in the bowl so that they are fully immersed in the hot water.",
    "Once the meat is fork tender remove it from the stew to a plate and set it aside.  Taste the sauce and adjust the seasoning if necessary.  If the sauce needs to be thicker remove about a cup of the vegetables and puree in the blender.  Return the pureed vegetables to the sauce, along with the meat, and stir the mixture to thicken it.  Drain the fig quarters and add them with the parsley, stirring carefully to mix everything well, without breaking up the figs.  Simmer the stew for another 10 minutes.",
    "Remove the bay leaves and serve immediately.",
    "Remarks:  I don’t know why this recipe doesn’t include potatoes but I would recommend adding some.",
    "Yield:  Serves 6.",
    "Source:  The Essentials Mediterranean by Nancy Harmon Jenkins, Harper Collins Publishers, Inc., , ©2003 by Nancy Harmon Jenkins."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}