{
  "title": "Catalan Christmas (Gall Dindi Farcit)",
  "requires": "",
  "ingredients": [
    "For the  –",
    "12 medium-size garlic cloves, peeled and coarsely chopped",
    "1 tablespoon crumbled dried rosemary",
    "1 tablespoon crumbled dried thyme",
    "2 bay leaves, crumbled",
    "4½ teaspoons coarse salt (kosher or sea)",
    "1 tablespoon black peppercorns",
    "1½ teaspoons olive oil",
    "1 fresh turkey (12 to 14 pounds) preferably kosher, rinsed and patted dry, neck and",
    "giblets reserved for making stock or another use",
    "For the Stuffing and Sauce –",
    "2 cups dry sherry",
    "1 pound mixed dried fruit, such as apricots, apples, peaches, and prunes; larger pieces",
    "cut in half or quarters",
    "1½ cups dried cherries or cranberries",
    "1 pound fresh mild pork sausage links (if using Italian sausage, use one without fennel)",
    "2 tablespoons olive oil",
    "2 medium size onions, chopped",
    "1 large Granny Smith apple, peeled, cored and chopped",
    "1 teaspoon crumbled dried rosemary",
    "1 teaspoon dried thyme",
    "1 small cinnamon stick",
    "Coarse salt (kosher or sea) and freshly ground black pepper",
    "About ½ cup chicken stock or broth; if needed (as explained in the instructions)",
    "1 cup lightly toasted pine nuts"
  ],
  "instructions": [
    "Remove the giblets and neck pieces from the turkey cavities then rinse the bird under cold running water.  Using paper towels pat the turkey dry and set it aside to drain while you prepare the garlic rub.",
    "Place the garlic, the rosemary and thyme, the salt, the peppercorns, and the olive oil in a food processor and process the ingredients to make a paste.  Return to the turkey and using paper towels pat it dry again, to dry off any accumulated water that has collected. Rub this garlic paste mixture all over the turkey, including the inside and its cavities.  Place the turkey in its roasting pan and cover it loosely with plastic wrap and let it stand while you make the stuffing.",
    "Place 1 cup of the sherry in a small saucepan and bring it to a boil over medium-high heat.  Place the dried fruit and the cherries (or cranberries) in a heat proof bowl and pour the hot sherry over them; cover and let the dried fruit steep in the sherry for 30 minutes.  While the fruit is soaking cook the sausage in boiling water for 2 minutes.  Remove the sausage and allow it to drain before slicing it into fairly thick slices.",
    "Heat the olive oil in a very large skillet over medium heat.  When the oil is hot add the chopped onions and cook them until they are barely softened; under ideal conditions this should take about 5 minutes.  Add the chopped apple and continue cooking, stirring, until the apple begins to soften; again this should be about another 5 minutes.  Add the sliced sausage and continue cooking, stirring, until the sausage is lightly browned; another 2 to 3 minutes should suffice.  Lastly, add the dried fruit and their soaking liquid, the rosemary, the thyme, and the cinnamon stick.  Stirring the mixture, season it with salt and pepper, to taste.  Cook the stuffing, stirring occasionally, until the sausage is cooked through and the dried fruit is soft; if the other times have been fairly close to the times indicated this final process should be about 8 minutes.  Lower the heat if the browning seems to be going too fast.  (If you like your stuffing a little on the moist side, add a little chicken stock in the last minutes of cooking.)  Transfer the stuffing from the skillet to a bowl and stir in the pine nuts.  Allow the stuffing to cool to room temperature before using it to stuff the turkey.",
    "Adjust the wire racks in the oven to accommodate the turkey and preheat the oven to 450º F.",
    "Right before roasting, loosely stuff the main cavity of the turkey with some of the stuffing.  Tie the legs together with kitchen string; or, secure them with a skewer.  Spoon some stuffing into the neck cavity and tuck the excess skin underneath the turkey.  Place the turkey breast side up in a large roasting pan and bake it for 40 minutes.  Place the remaining stuffing in a 1½- to 2-quart baking dish, cover it with aluminum foil, and set aside.",
    "Reduce the oven temperature to 350º F. and add 1 cup water to the roasting pan.  Roast the turkey until a meat thermometer, inserted into the inner thigh (but not so that it touches a bone) registers about 180º F; about 3 hours or longer.  (If the turkey seems to be browning too fast towards the end, use a piece of aluminum foil, creased into a “V” shape to cover the turkey.)  Additionally, as the turkey roasts, add 1 cup water to the roasting pan every hour.  (Finally, for a turkey of the weight indicated, above in the ingredients, the total roasting time will be about 3 hours and 40 minutes.)",
    "When you remove the turkey from the oven, transfer it to a cutting board and cover it loosely with aluminum foil to keep it warm.  Allow the turkey to rest for 35 to 40 minutes.  Skim off the fat in the roasting pan but reserving the juices to make the gravy.",
    "Pour about ½ cup of the pan juices onto the stuffing you had previously place in the baking dish and bake the dressing, covered with aluminum foil, while the turkey is resting.",
    "To make the sauce, add the remaining cup of sherry to the roasting pan and set it over medium-high heat; using two burners if necessary.  Scrape the sides and bottom of the roasting pan to dislodge the browned bits.  Cook the pan juices until they are reduced by about one fourth; about 5 to 7 minutes, depending on circumstances.  (If on the other hand, you prefer to serve the turkey with gravy, instead of a sauce, add 3 to 4 tablespoons of flour to about 3 to 4 tablespoons of the skimmed turkey fat; whisk this flour and fat mixture until it forms a paste.  Then, whisk this flour and fat paste into the pan juices and cook the mixture until the sauce thickens into a gravy of the thickness and consistency you prefer; from 3 to 5 minutes if the heat level is correct.)",
    "Use a spoon to remove the stuffing from the cavities of the turkey and place it in a serving bowl next to the stuffing in the baking dish.  Finally, carve the turkey and arrange the pieces of turkey on a serving platter.  Serve with the reduced pan juices or the gravy."
  ],
  "remarks": "",
  "yield": "Serves 8 to 10 persons.",
  "source": "The New Spanish Table by Anya von Bremzen, published by Workman Publishing Co. Inc., New York, www.workman.com, © 2005 by Anya von Bremzen.",
  "category": "06 - Main Meals"
}