{
  "title": "Chicken in a Orange and Prune Sauce (Pollo en Ciruela)",
  "category": "06 - Main Meals",
  "requires": "",
  "ingredients": [
    "For the chicken –",
    "1 cup fresh orange juice",
    "½ cup medium-sweet white wine or sherry",
    "½ orange, unpeeled, thinly sliced",
    "2 chiles chipotles en adobo, finely chopped",
    "1 tablespoon olive oil, plus extra as needed",
    "Salt to taste, preferably sea salt",
    "3 pounds chicken breast and thighs",
    "¼ pound bacon, chopped",
    "¼ cup narrow orange zest strips, about ¾-inch long for the garnish",
    "For the sauce –",
    "½ pound dried prunes, pitted (about 30 in all)",
    "¾ cup Seville orange marmalade",
    "½ cup water, or as needed",
    "¼ cup fresh orange juice",
    "3-inch piece of cinnamon bark",
    "¾ cup narrow orange zest strips, about ¾-inch long for the garnish"
  ],
  "instructions": [
    "In a glass bowl, mix together the orange juice, wine or sherry, orange slices, chiles, 1 tablespoon oil, and the salt.  (This dish requires more salt than usual to bring out the distinct flavors, so taste the mixture as you add the salt.)  Cut each chicken breast into 4 pieces and each thigh in half.  Add the chicken to the orange juice mixture, cover, and refrigerate for several hours or, preferably overnight.  Stir the mixture to marinade the chicken well from time to time.",
    "Make the sauce next.  In a saucepan, stir together the prunes, marmalade, water, orange juice, cinnamon, and orange zest.  Bring the mixture to a boil over medium-high heat.  Reduce the heat to low and simmer, once the mixture start to boil, stirring often, until the sauce is thickened, about 10 to 15 minutes.  Remove the sauce from the heat and allow the sauce to cool and the flavors to blend together, covered, for about 2 hours.  Discard the cinnamon bark.",
    "Remove the chicken from the marinade and dry it, using absorbent paper towels.  Reserve the marinade.",
    "In a large, heavy frying pan over medium-low heat, slowly fry the bacon until it’s golden-brown, about 3 to 5 minutes.  Using a slotted spoon, transfer the bacon to absorbent paper to drain.  Raise the heat to high; add the oil to the bacon drippings to a depth of ¼-inch.  When the oil is “crackling hot”, working in batches, add the chicken, reduce the heat to medium, and cook the chicken until it’s golden and crisp on the outside but still moist inside, about 15 to 20 minutes.  Transfer the chicken, when done, to absorbent paper and allow it to drain.",
    "Drain the excess oil from the pan and return the pan to low heat.  Add in the reserved marinade and gradually raise the heat to medium.  Cook the marinade until it has been reduced by half, scraping up any browned bits of chicken remaining in the pan bottom.  Add the previously prepared prune sauce, the bacon bits, and the chicken and stir well.  Cook, uncovered, over low heat until the chicken is tender, approximately 20 minutes.  Turn the chicken occasionally, adding more water or wine as needed to keep the ingredients from scorching.",
    "Transfer the chicken to a warmed serving platter.  Remove the orange zest that was in the marinade, which has cooked with the dish, and spoon the sauce over the chicken.  Lastly, garnish the platter with the fresh ¼-cup of orange zest and serve immediately."
  ],
  "remarks": "Serve with seasoned white rice.",
  "yield": "Serves 6",
  "source": "Savoring Mexico:  Recipes and Reflections on Mexican Cooking, by Marilyn Tausend, published by Time Life Books, a division of Time Warner Inc., © 2001 Weldon Owen Inc."
}