{
  "title": "Chicken Fried Steak with Cream Gravy",
  "category": "06 - Main Meals",
  "requires": "",
  "ingredients": [
    "For the Steak –",
    "3 pounds beef round steak",
    "Shortening or oil for frying",
    "3 to 4 eggs",
    "¼ cup milk",
    "1 cup all-purpose flour",
    "Salt and pepper",
    "For the Gravy –",
    "4 cups milk",
    "⅓ cup all-purpose flour (use the remaining dredging flour here if you have any)",
    "Salt",
    "Freshly cracked black pepper"
  ],
  "instructions": [
    "Trim as much fat off the steak as you can then cut it into portions size steaks, about 3 by 4-inches.  Place the individual steaks between two sheets of plastic wrap and with a meat tenderizing hammer, pound the steaks well on both sides.",
    "In a deep dish, beat the eggs well and add ¼ cup milk.  In another deep dish, add the flour and season it with salt and pepper.",
    "Heat the shortening; or oil, over medium in the largest skillet that you have.",
    "Dip a steak in the egg mixture then dredge it in the seasoned flour.  Place the steak in the hot oil.  Prepare the remaining steaks in the same manner and accommodate as many steaks as possible in the frying pan.  When the accumulating juices on the top of each steak turn dark red turn the steaks over to brown on the other side, approximately 5 minutes on each side.  Make sure that the steaks’ coating is well browned before removing them from the pan.  Allow the steaks to drain on paper towels while you finish cooking all of them.  When all steaks are done hold the steaks in a warm oven while you make the gravy.",
    "Drain all the drippings from the skillet except for 3 tablespoons.  Leave all the browned bits of the steak coating that have fallen from the steaks in the pan, remove only shortening, or oil.  Return the skillet to the heat and add the ⅓-cup of flour.  Cook the roux, scraping the browned bits off the bottom and sides of the skillet, while mixing the flour with the drippings.  Once your roux is well combined add in the 4 cups of milk and simmer the gravy until it starts to thicken, about 10 to 15 minutes.  Add salt and pepper to taste.",
    "Serve the steaks with the gravy immediately."
  ],
  "remarks": "",
  "yield": "Serves 6.",
  "source": "The Texas Provincial Kitchen by Melissa Guerra, © 1997 by Melissa Guerra."
}