{
  "title": "Chicken and Corn Tortilla Casserole",
  "requires": "",
  "ingredients": [
    "For the ingredients of the casserole –",
    "6 long green (Poblano) chilies",
    "3 tablespoons olive oil",
    "3 cups finely chopped onion",
    "3 garlic cloves, peeled and minced",
    "2 teaspoons ground cumin",
    "1½ teaspoons oregano, crumbled",
    "2 cups chicken broth, preferable homemade or canned",
    "2 cups of your favorite tomato-based bottled Salsa",
    "2 teaspoons salt",
    "16 ounces sour cream, whisked until smooth",
    "8 cups boned and shredded chicken",
    "4 cups (about 1 pound) grated Monterey Jack or Mozzarella cheese",
    "For the tortillas –",
    "2 cups corn oil",
    "24 6-inch corn tortillas"
  ],
  "instructions": [
    "On the day before making this dish use the open flame of a gas burner or the oven’s broiler, to roast the chilies, turning them, until they are evenly charred all over.  Remove them from the heat and place them inside a plastic bag; seal it closed to trap the steam and allow the chilies to cool inside the plastic bag.  When cooled, rub and peel away the burned skin and use running water to assist in removing all of the burned skin.  Stem and seed the chilies then chop them coarsely.  There should be about one cup when you’re done.",
    "(If you are preparing this casserole over a 2 day period, allow the chopped chilies to drain well then pat dry with a paper towel and store in a plastic bag in the refrigerator overnight, then continue with making the chicken sauce before you quit for the day.)",
    "Set a 3-quart (large) non-reactive saucepan over low heat.  When the saucepan is hot add the olive oil and sauté the onions.  When the onions begin to turn translucent add the garlic, the cumin, and the oregano; cover, and cook the mixture for 15 minutes, stirring the mixture only once or twice.",
    "Stir in the chicken broth, the salsa, green chilies, and salt.  Raise the heat to medium and bring the mixture to a boil.  Once the mixture reaches a boil lower the heat setting slightly and allow the mixture to cook “briskly,” uncovered, stirring once or twice, for 20 minutes.  Remove the saucepan from the heat and allow this sauce to cool to room temperature.  When the mixture has cooled pour off and reserve 2 cups of the sauce and pour the rest into the boned and shredded chicken.  (This recipe can be prepared up to this point one day ahead.  Cover and refrigerate the reserved sauce and the chicken mixture separately.  Remove the ingredients; the chopped green chilies, sauce, and the shredded chicken mixture from the refrigerator and allow all of these ingredients to come to room temperature before proceeding with the recipe.)",
    "Before proceeding arrange the work area with the items you will be using.  After frying the tortillas you will need paper towels on which to let them drain; and a 10- by 14-inch baking dish about 2 inches deep in which to make the casserole.  Also, position a rack in the oven in the middle position and preheat the oven to 350° F.",
    "In a deep skillet, heat about 1 inch of corn oil over medium heat.  When the oil is hot use tongs to immerse the tortillas, one at a time, in the hot oil; turn them and then transfer them to absorbent paper.  The tortillas should be in the oil no more than a few seconds (just enough to soften them without their edges becoming crisp).",
    "Arrange 8 of the tortillas in an overlapping layer in the bottom of the baking dish.  Spread half of the chicken mixture over the tortillas.  Arrange 8 more of the tortillas in an overlapping layer over the chicken and over them spread half of the shredded cheese.  Spread the remaining chicken mixture over the cheese then arrange the remaining 8 tortillas over this layer of chicken (again overlapping them).  Spread the reserved two cups of sauce over these last tortillas, spread the remaining shredded cheese over the sauce, and finish by spreading the sour cream evenly over the cheese.",
    "Bake the casserole in the center rack of the oven for 45 minutes; or, until the casserole edges are crisp and the topping, which may be bubbling, is “set.”",
    "Let the casserole stand on a metal rack for 5 minutes before serving; or, bring to the table for serving.  If you are doing the serving, serve rectangular pieces of the casserole.",
    "Provide shredded romaine lettuce and salsa as accompaniments.",
    "Yield:  Serves 8 to 10 persons.",
    "Source:  The El Paso Chile Company’s Texas Border Cookbook, by W. Park Kerr and Norma Kerr, published by William Morrow and Co., Inc., New York, © 1992 by W. Park Kerr and Norma Kerr and Michael McLaughlin."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}