{
  "title": "Chicken Breasts with Cream Sauce",
  "category": "06 - Main Meals",
  "requires": "",
  "ingredients": [
    "4 large chicken breasts, skinned",
    "½ stick (¼ cup) butter",
    "¼ cup vegetable shortening",
    "1 tablespoon flour",
    "¼ teaspoon dried tarragon",
    "½ cup scalded heavy cream (whipping cream)",
    "salt and pepper"
  ],
  "instructions": [
    "Wash the chicken breasts and pat them dry with paper towels.  Cut off any excess fat and discard it then sprinkle them with salt and pepper.  (If you don’t want a heavy pepper taste use white pepper.)  In a large ovenproof skillet brown the chicken breast in the butter into which you’ve added the ¼ cup of vegetable shortening.  When you’ve finished browning the chicken breast pour off half of the remaining butter/shortening mixture and reserve it.  If you’ve browned the chicken in batches, remove the skillet from the fire and rearrange all of the breasts back in skillet and bake them in a preheated moderate oven (350° F.) for 35 minutes, or until the chicken is tender.",
    "Remove the chicken from the skillet and keep it warm.  In a small pan heat and scald the heavy cream then keep warm.  In the skillet which you baked the chicken and over moderately low heat add the reserved butter/shortening mixture, 1 tablespoon of flour and cook the roux for 3 to 5 minutes.  Then add ¼ teaspoon each of tarragon, salt, and white pepper.  Remove the skillet from the heat and add the scalded heavy cream, whisking, until it is smooth and thickened.  Transfer the sauce to a sauceboat and serve with the chicken breasts.",
    "Remarks:  Remember that as you cook the roux, the flour in it will begin brown.  The longer you cook it the more color the roux (the sauce) will take on, so use your judgment.  Cooking the roux is more a question of the color you are trying to achieve in the sauce than anything else.  Wild rice is an excellent accompaniment. "
  ],
  "remarks": "",
  "yield": "Serves 4.",
  "source": "Sugar and Spice, Gourmet Magazine, March 1980."
}