{
  "title": "Chicken Hash (Tinga de Pollo)",
  "category": "06 - Main Meals",
  "requires": "",
  "ingredients": [
    "2 large ripe tomatoes",
    "3 canned chili chipotles en adobo",
    "¼ cup chicken stock; or, water",
    "⅓ cup vegetable oil",
    "4 large garlic cloves, finely chopped",
    "1 large; or 2 medium, onions thinly  sliced in “half-moons” (total of about 2 cups)",
    "2 teaspoons ground cumin",
    "1 teaspoon fresh grated nutmeg, or to taste",
    "6 cups shredded cooked chicken; or, any other cooked meat",
    "Salt and freshly ground black pepper, to taste"
  ],
  "instructions": [
    "Heat a griddle or cast-iron skillet over high heat until a drop of water sizzles on contact.  In it roast the tomatoes, turning several times, until blackened on all sides.  Remove them from the heat and let them sit until cool enough to touch, then working over a bowl to catch any juices, peel off the blackened skin.  Seed them and chop the tomato flesh roughly and set aside.",
    "In a blender or food processor fitted with the steel blade, purée the chipotle chiles and the sauce that clings to them with ¼ cup of chicken stock (or water).  Pour the purée into a small container and set it aside.",
    "In a large skillet, heat the oil over high heat until very hot, but not quite smoking.  Add the onion and garlic and cook, stirring, 2 to 3 minutes.  Add the tomatoes, cumin, nutmeg, and the puréed chipotles and cook, stirring, for another 3 minutes.  Reduce the heat to medium and add the shredded meat, and simmer, uncovered, until most of the liquid has evaporated, about 10 minutes.  Season with salt and pepper and serve at once.",
    "Remarks:  You might wish to adjust the spices to your taste after you’ve made this dish once.  Specifically, the recipe calls for three chili chipotles, which might make it too spicy.  The “roasted jalapeño” flavor of the chipotles is an essential component of this dish so don’t eliminate them completely from the recipe."
  ],
  "remarks": "",
  "yield": "Make 4 servings as a main dish; more as a filling for tacos or gorditas.",
  "source": "Food festival cook Martinez celebrates the culinary melting pot of Veracruz by John Griffin, San Antonio Express-News, Wednesday, October 24, 2001, (Recipe from the cookbook “Zarela’s Veracruz”, by Zarela Martinez, Houghton Mifflin)."
}