{
  "title": "Chili Joes",
  "category": "06 - Main Meals",
  "ingredients": [
    "3 tablespoons olive oil",
    "1 cups chopped onion",
    "1 large sweet red pepper, stemmed, cored, seeded, and finely diced",
    "3 large garlic cloves, peeled and minced",
    "4 teaspoons chili powder blend",
    "1 teaspoon oregano, crumbled",
    "1 teaspoon ground cumin",
    "A pinch of cinnamon",
    "2 pounds lean ground beef",
    "1 teaspoon salt",
    "1 cups thick tomato-based bottled salsa; mild or hot as personal choice dictates",
    "1 cup water",
    "1 cup minced cilantro"
  ],
  "instructions": [
    "Set a large skillet over low heat and when it's hot add the olive oil.  When the oil is hot sauce the onion, the sweet red pepper, and the minced garlic.  Once the ingredients are blended and sauteing add the chili powder, oregano, cumin, and the cinnamon; cover, and stirring occasionally cook the mixture for 10 minutes.",
    "Add the ground beef, breaking it up with a fork; add the salt and cook the mixture, stirring, until the ground beef is no longer pink, which should be about 12 minutes, depending on the heat setting.  Stir in the salsa and add the water then cook until the liquids begin boiling.  Partially cover, lower the heat, and allow the mixture to simmer, stirring occasionally, until the mixture becomes very thick, about 50 minutes.  (The Chili Joe can be prepared up to this point three days ahead.  Cool it, cover it, and keep it refrigerated.  Re-warm it slowly over low heat, stirring as it warms up, to keep the mixture from scorching or burning in the bottom of the pot.)",
    "On the day you are going to serve the Chili Joe first warm it up, as indicated above.  After it's heated, stir the minced cilantro into the Chili Joe, spoon it on lightly toasted buns, cover with the bun tops, and serve immediately."
  ],
  "requires": "",
  "remarks": "",
  "yield": "Makes 6 large Kaiser rolls sandwiches.",
  "source": "The El Paso Chile Company's Texas Border Cookbook, by W. Park Kerr and Norma Kerr, published by William Morrow and Co., Inc., New York, 1992 by W. Park Kerr and Norma Kerr and Michael McLaughlin."
}