{
  "title": "Michael’s Chili con Carne Verde",
  "requires": "",
  "ingredients": [
    "12 large poblano chilies",
    "1 (6- to 7-pound) pork shoulder roast, with bone",
    "¼ cup rendered bacon drippings; or, olive oil",
    "6 cups chicken broth, preferably homemade",
    "6 cups chopped onion",
    "8 large garlic cloves, peeled and minced",
    "1 tablespoon dried oregano, crumbled",
    "¼ cup unbleached all-purpose flour",
    "About 1½ teaspoons salt"
  ],
  "instructions": [
    "On the day before starting this dish use the open flame of a gas burner or the oven’s broiler, to roast the chilies, turning them, until they are evenly charred all over.  Remove them from the heat and place them inside a plastic bag; seal it closed to trap the steam and allow the chilies to cool inside the plastic bag.  When cooled, rub and peel away the burned skin using running water to assist in removing all of the burned skin.  Stem and seed the chilies then cut into ¼-inch-wide strips.",
    "(If you are preparing this recipe over a 3 day period, allow the chilies to drain well, pat dry with a paper towel and store in a plastic bag in the refrigerator overnight on the first day.)",
    "On the second day, remove and discard any excess fat from the pork roast; rinse it and pat dry with paper towels.",
    "Preheat the oven 325° F.",
    "In a heavy 5-quart Dutch oven; or flameproof casserole, heat the bacon fat or olive oil over medium-high heat.  Pat the roast dry one final time before you place it in the Dutch oven and begin browning it.  Turn the roast occasionally, and don’t rush the browning; but it should take around 20 minutes, or so, to have the roast well browned.  When you’ve finished browning the roast add the chicken broth, the onions, and the garlic, cover, and place the Dutch oven on the center rack of the preheated oven.  Bake the roast for 2 hours.  Working carefully, you want to open the oven, uncover and turn the roast over inside the Dutch oven, cover again, and continue baking for an additional 2 hours.  (All total you are going to cook the roast for 4 hours at 325° F, turning it once.  At the end of the 4 hours the roast should be “very” tender.)",
    "Remove the Dutch oven from the oven and place it on a metal (heat resistant) grate.  Leave the roast in the Dutch oven and allow it to cool to room temperature.  When cooled, remove the roast to a plate, cover it with plastic wrap and refrigerate it overnight.",
    "Pour all the braising liquids into a bowl through a strainer, pressing hard on the solids with the back of a spoon, to extract and capture all the juices.  Discard all of the solids but cover the bowl of braising liquids with plastic and refrigerate it overnight also.",
    "On the third day remove the roast from the refrigerator and trim, and discard, any fat but shredding, and reserving, the meat (fingers work best).  Similarly, take the braising liquids out of the refrigerator; collect, and save ¼-cup of the chilled fat, discarding the remainder.  Measure the braising liquids and add enough water to bring the amount up to 7 cups.",
    "Set a 5-quart pot over medium heat.  When the pot is heated add the ¼-cup of fat, reserved from the braising liquids; lower the heat and sauté the jalapeños in the fat for 5 minutes, stirring often, adding the oregano as you work.  After 5 minutes add the flour and continue cooking, stirring constantly, for 3 minutes but do not allow the flour to brown.  Whisk in all of the braising liquid.  Raise the heat setting back to medium, add the shredded pork and the rajas then bring everything to a boil.",
    "When the mixture reaches a boil lower the heat setting to keep the mixture simmering and partially cover the pot.  Keep the mixture simmering for 2 hours, stirring occasionally.  After 2 hours taste and adjust the saltiness if needed.  Continue simmering for 20 to 30 minutes longer.",
    "When the Chili is done; the liquids should be “very” thick, the pork should be “very” tender, and the rajas should have virtually been dissolved into the stew.",
    "Yield:  Makes about 3½ quarts and serve 10.",
    "Source:  The El Paso Chile Company’s Texas Border Cookbook, by W. Park Kerr and Norma Kerr, published by William Morrow and Co., Inc., New York, © 1992 by W. Park Kerr and Norma Kerr and Michael McLaughlin."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}