{
  "title": "Chorizo Mexicano",
  "category": "06 - Main Meals",
  "requires": "",
  "ingredients": [
    "1½ pounds lean boneless pork shoulder, coarsely ground",
    "8 ounces pork fat (you might get most by rendering the fat from the pork shoulder)",
    "12 medium (about 6 ounces total) dried ancho chiles, stemmed and seeded",
    "2 bay leaves",
    "1½ teaspoons cinnamon (preferably freshly ground Mexican canela)",
    "⅛ teaspoon cloves (preferably freshly ground)",
    "1 teaspoon dried oregano (preferably Mexican)",
    "1 tablespoon EACH fresh thyme leaves and marjoram leaves;",
    "or, 1 teaspoon EACH dried thyme and marjoram",
    "Salt",
    "¼ cup cider vinegar"
  ],
  "instructions": [
    "Tear the chiles into flat pieces and toast them in a heavy skillet or on a griddle heated over medium heat, pressing them flat with a metal spatula until they are aromatic, about 10 seconds per side.  In a bowl, rehydrate the chiles for 20 minutes in hot water.  Cover the chiles with hot water then place a small plate on top to keep the chiles submerged.  After 20 minutes drain and transfer the chili pieces to a food processor or blender.",
    "Pulverize the bay leaves in a mortar or a spice grinder, then add to the food processor along with the cinnamon, cloves, oregano, thyme and marjoram and 1½ teaspoons salt.  Measure in the vinegar and 2 tablespoons of water process until mixture is smooth, adding a little more water if necessary to keep everything moving through the blades.  Press the mixture through a medium-mesh sieve into a large bowl.",
    "Place the ground pork in a large bowl and add the chili and seasoning mixture.  Mix thoroughly.  It’s best to cover and refrigerate the chorizo overnight for the flavors to meld.  The next day fry a little portion of the chorizo and taste it for salt and adjust the salt content if necessary. "
  ],
  "remarks": "Refrigerated, the chorizo keeps for about a week, however, frozen it will keep much longer.",
  "yield": "Make about 2½ pounds of fresh sausage.",
  "source": "Mexico One Plate at a Time by Rick Bayless, Scribner, 1230 Avenue of the Americas, New York, NY 10020, ©2000 by Rick Bayless."
}