{
  "title": "Cider Chicken (Coq au cidre)",
  "requires": "",
  "ingredients": [
    "1 ounce slab bacon, cut into ½-inch cube dice",
    "1 tablespoon peanut oil",
    "1 (3- to 3½ pound) chicken, cut into 8 pieces, skin and fat removed",
    "4 large onions, thinly sliced",
    "1 clove garlic, finely chopped",
    "2¾ cups hard apple cider; or, sparkling dry apple cider",
    "⅓ cup calvados; or, apple brandy",
    "8 pitted prunes",
    "Salt and pepper to taste",
    "1 bouquet garni:  6 sprigs fresh parsley, 4 sprigs fresh thyme (or, ½ teaspoon dried),",
    "and 2 large bay leaves all tied together with kitchen string or in a",
    "cheesecloth bag"
  ],
  "instructions": [
    "Preheat the oven to 325° F.",
    "In a deep ovenproof skillet with a lid; or, Dutch oven, brown the bacon over medium-high heat, about 3 minutes, then transfer the bacon to paper towels to drain dry.  Pour off any fat remaining in the pan and increase the heat to high.  Add ½ tablespoon of the peanut oil to the pan and brown the chicken over the high heat.  If the heat source is about right it should take about 3 minutes per side.  When all of the chicken pieces are browned, transfer them to a plate and season them with salt and pepper.  Set aside for the moment.",
    "To the skillet or Dutch oven add the remaining ½ tablespoon of oil, reduce the heat to low and add all of the onions.  Cook the onions, stirring occasionally, until they are very tender and “golden” in color; about 25 minutes if the heat source is right.  Stir in the garlic and cook for 1 minute before pouring in the cider and calvados (or brandy).  Bring the mixture to a boil and add the prunes, the bouquet garni, the reserved bacon, and the chicken pieces.  Stir the mixture and cover.",
    "Bake in the center of the preheated oven for 45 minutes to 1 hour; or, until the chicken pieces are very tender and no longer pink inside.",
    "Remove from the oven, remove and discard the bouquet garni.  Taste and adjust the seasoning if necessary.  Allow the chicken to repose in the skillet or Dutch oven until the temperature has come down enough to serve.",
    "Remarks:  Approximately 515 calories per serving; 39 grams protein; 14 grams fat; 59 grams carbohydrates; 165 milligrams sodium; 109 milligrams cholesterol.",
    "Yield:  Serves 4.",
    "Source:  Tour through the Fish Market of , Travel Section, Eating Well, September/October 1994."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}