{
  "title": "Citrus Chicken",
  "requires": "",
  "ingredients": [
    "6 boneless, skinless, chicken breasts",
    "¼ cup melted butter",
    "1 tablespoon orange liqueur",
    "6 thin slices, cooked ham",
    "Flour",
    "2 lightly been eggs",
    "⅔ cup “fine” seasoned breadcrumbs",
    "1 stick butter, cut up into bits",
    "2 cups fresh orange juice",
    "1 tablespoon tarragon",
    "1 teaspoon grated orange peel",
    "½ teaspoon salt",
    "6 ½-inch thick fresh orange slices",
    "Grated orange peel, to taste",
    "Minced fresh parsley"
  ],
  "instructions": [
    "Preheat the oven to 400° F.",
    "To the melted (¼ cup) butter add the orange liqueur and mix.  Set aside until needed.",
    "Mix together the orange juice, tarragon, orange peel, and salt.  Set aside until needed.",
    "Between two sections of moist plastic wrap (sprayed or sprinkled with water) flatten slightly, using a meat tenderizer, all of the chicken breasts.  Set them aside on a plate until all are done.",
    "One at a time; place the chicken breast, smooth side down, on the work surface.  Brush, only the “top” side of the chicken breast with the melted butter flavored with the orange liqueur.  Place a slice of ham on each chicken breast and roll them patty style (see the photo, bellow).  Secure the rolled chicken breast with a toothpick, or two.  (Use none colored toothpicks.)  Place the rolled breasts on a plate until all are done.",
    "Set up a work line for processing the chicken breasts.  Spread the bread crumbs and the flour on separate paper plates; then set up the process in the order to be used:  flour, beaten eggs, bread crumbs.  First, roll the chicken breasts in the flour and shake off any excess.  Secondly, dip them in the beaten eggs to coat them.  Allow the excess egg to drip off.  Lastly, place them in the bread crumbs and roll and press them into the bread crumbs to give each a nice thick coating.",
    "Process the chicken breasts, one at a time, placing them in a shallow, buttered, baking pan.  When all of the chicken breast are done, dot the tops of the chicken rolls with the butter bits, and place the pan in the middle rack of the oven and bake for 15 minutes; turning them once.",
    "Remove the chicken breasts from the oven and over them pour the orange juice/tarragon mixture.  Reduce the temperature of the oven to 350° F.  Place a cover on the baking pan and return it to the oven to continue baking for 35 minutes more.  Open the oven periodically and using a brush baste the chicken rolls.",
    "When done, remove the baking pan from the oven and set aside for a few minutes.  Carefully, remove the toothpicks.",
    "To serve, use a heated serving platter.  Place each chicken roll on an orange slice and spoon the sauce over the chicken rolls.  Garnish with the grated orange peel and the minced parsley.",
    "Remarks:  Accompany with baked corn casserole and a fresh salad.",
    "Yield:  Serves 6.",
    "Source:  The Winning Combination is Meats with Fruit by Jinx Morgan, Bon Appétit, October 1977.",
    "Citrus Chicken"
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}