{
  "title": "Classic Red Mole with Turkey (Mole Rojo Clasico de Guajolote)",
  "category": "06 - Main Meals",
  "requires": "",
  "ingredients": [
    "5 ounces (3 medium size) tomatillos, husked and rinsed",
    "½ cup (about 2½ ounces) sesame seeds",
    "½ cup pork lard or vegetable oil, plus a little more if necessary",
    "6 medium (about 3 ounces) dried mulatto chiles, stemmed and seeded",
    "3 medium (about 1½ ounces) dried ancho chiles, stemmed and seeded",
    "5 medium (about 1½ ounces) dried pasilla chiles, stemmed and seeded",
    "4 garlic cloves, peeled",
    "½ cup (about 2 ounces) unskinned almonds",
    "½ cup (about ounces) raisins",
    "1 whole (about 4 pounds) boneless turkey breast with skin on, the two halves cut apart and",
    "any netting removed (some brands sell individual turkey breasts as 2-pound roasts,",
    "you’ll need two of them)",
    "Salt",
    "½ teaspoon cinnamon, preferably freshly ground Mexican canela",
    "¼ teaspoon black pepper, preferably freshly ground",
    "¼ teaspoon anise, preferably freshly ground (optional)",
    "⅛ teaspoon cloves, preferably freshly ground",
    "1 slice firm white bread, darkly toasted and broken into several pieces",
    "1 ounce (about ⅓ of a 3.3 ounce portion) of Mexican chocolate, roughly chopped",
    "4 to 5 tablespoons sugar"
  ],
  "instructions": [
    "To ensure success and to streamline the rather complex preparation, first set out all the ingredients, completing basic preparations as described:  husk and rinse the tomatillos, stem and seed the dried chiles, peel the garlic, grind the spices (if you are using whole), toast the bread, chop the chocolate.",
    "Spread the tomatillos on a baking sheet and roast them4 inches below a very hot broiler until darkly roasted, even blackened in spots, about 5 minutes.  Flip them over and roast on the other side, 4 to 5 minutes, until splotchy-black, blistered and soft.",
    "Set out two large bowls and scrape the tomatillos, juice and all, into one of them.  Set out a pair of tongs and a slotted spoon.",
    "In an ungreased small skillet set over medium heat, toast the sesame seeds, stirring constantly, until golden, about 5 minutes.  Scrape two-thirds of them into the tomatillos; set the rest aside for garnish.",
    "Sat a large (8 to 9-quart) pot (preferably a Dutch oven or Mexican cazuela) over medium heat.  Measure the lard or oil into the pot.  Turn on an exhaust fan or open a window or door.  Tear the chiles into flat pieces, and, when the lard or oil is hot, fry the chiles, three or four pieces at a time, flipping them nearly continually with the tongs, until their interior side has changed to a lighter color, about 20 to 30 seconds total frying time.  Don’t toast them so darkly that they begin to smoke as that would make the mole bitter.  As they are done, remove them to the empty bowl, being careful to drain as much fat as possible back into the pot.  Cover the toasted chiles with hot tap water and place a small plate on them to keep them submerged.  Let them stand this way for 30 minutes.",
    "Meanwhile, remove any stray chile seeds left in the fat.  With the pot still over medium heat, fry the garlic and almonds, stirring regularly, until browned (the garlic should be soft while the almonds should be browned through), about 5 minutes.  With a slotted spoon, remove the garlic and almonds to the tomatillo bowl, draining as much fat as possible back into the pot.",
    "Now add the raisins to the hot pot.  Stir with your slotted spoon for 20 to 30 seconds, until they’ve puffed and browned slightly.  Scoop them out, draining as much fat as possible back into the pot, and add to the tomatillos.",
    "Raise the temperature under the pot to medium-high.  Sprinkle all sides of the turkey breast halves with salt, then lay one in the pot.  Thoroughly brown it on all sides, about 10 minutes total.  Remove the breast to a clean plate; brown the other half turkey breast the same way.  (Set the pot aside.)",
    "Use tongs to transfer the rehydrated chiles to a blender leaving the soaking liquid behind.  Taste the soaking liquid, and, if it is not bitter, measure 2½ cups into the blender.  If it is bitter throw the liquid away and measure 2½ cups water.  Blend the chiles to a smooth puree, adding a little extra water if necessary to keep the mixture moving through the blades.  Press the chile mixture through a medium-mesh strainer back into the empty chile-soaking bowl.",
    "Without washing the blender jar, scrape the tomatillo mixture into it.  Add 1-cup water along with the cinnamon, pepper, optional anise, cloves, bread, and chocolate.  Blend to a smooth puree, adding a little extra water if necessary to keep the mixture moving.  Press through the strainer back into the tomatillo bowl.",
    "Check the fat in the pot.  If there is more than a light coating over the bottom, pour off the excess.  If the pot is pretty dry, film the bottom with a little more lard or oil.  Set over medium-high heat.  When quite hot, scrape the chile puree and stir nearly constantly until the mixture has darkened considerably and thickened to the consistency of tomato paste, 10 to 15 minutes.  Add the tomatillo puree and continue stirring until once again the mixture has thickened to the consistency of tomato paste, another 5 to 10 minutes.",
    "Add 6 cups of water to the pot and stir to combine thoroughly.  Partially cover, reduce the heat to medium-low and simmer gently, stirring occasionally, for 45 minutes.  Check the consistency of the mole, it should be thick enough to coat a spoon, but not too thickly.  If it’s too thick, stir in a little water.  Now, taste and season with salt (with this quantities and this recipe it usually takes about 1¾ teaspoons) and sugar.  If you are new to seasoning mole, or have no prior experience in having eaten a well balanced mole, keep in mind that it’s a delicate balance of salty and sweet and spicy.  It’s best to start with the minimum quantities I’ve [Rick Bayless] suggested, then refine the seasoning levels just before serving.",
    "Heat the oven to 325° F.  Lay the turkey in the mole, cover (use foil if you’re working in a cazuela) and place it in the oven.  Cook until an instant-read thermometer placed in the center of the turkey breast registers 150° F. (there should bee only the slightest hint of pink if you cut into the breast), about 40 minutes.  (If the turkey breast was refrigerated before you placed it into the pot of mole, allow an additional 10 to 15 minutes cooking time.",
    "Remove the turkey from the mole and place on a cutting board.  Cover with foil and let it stand at room temperature for 10 minutes.",
    "Slice the turkey ½-inch thick, then arrange the slices slightly overlapping on a warm large deep serving platter.  If the mole has thickened beyond the consistency of a medium cream soup, thin it with a little water.  Taste and season with a little more salt and/or sugar if you think necessary.  Ladle a generous amount (3 to 4 cups) of mole over or around the turkey slices and sprinkle the reserved sesame seeds.  Decorate the platter with sprigs of parsley and you’re ready for Thanksgiving or a party."
  ],
  "remarks": "Mole can be successfully made ahead, even getting better with 2 or 3 days residence, well covered, in the refrigerator.  Working ahead complete the mole the making of the sauce and balancing the salt and sugar levels; and, searing and browning (but not cooking in the oven) the turkey breasts.  Cool, cover, and refrigerate the mole and the turkey breasts separately for up to 3 days.  Just before serving, warm the mole in the pot, nestle the turkey breast, and place in the hot oven, remembering to allow the extra 10 to 15 minutes.  In fact, this way the turkey breast will be much juicier. A viable alternative is buying the mole, ready made (Doña Maria and other brands are available), diluting the mole with either water or chicken broth to the appropriate consistency and quantity.  Preparing the turkey breast and braising the mole and turkey in the oven as explained in the recipe above.  The results may not be as good but will be well worth the results. ",
  "yield": "Serves 8, with leftovers of sauce.",
  "source": "Mexico One Plate at a Time by Rick Bayless, Scribner, 1230 Avenue of the Americas, New York, NY 10020, ©2000 by Rick Bayless.",
  "tags": []
}