{
  "title": "Coq au Vin",
  "category": "06 - Main Meals",
  "requires": "",
  "ingredients": [
    "1 pound bacon, cut into ½ inch pieces",
    "½ cup plus 3 tablespoons flour",
    "8 pieces of chicken, skin on",
    "2 cups thinly sliced yellow onion",
    "2 pounds button mushrooms, thinly sliced",
    "¼ cup chopped shallots",
    "2 tablespoons chopped garlic",
    "3 or 4 sprigs fresh thyme",
    "2 bay leaves",
    "3 cups full-bodied red wine",
    "2 cups brown chicken or veal stock",
    "2 tablespoons melted butter",
    "salt and pepper"
  ],
  "instructions": [
    "In a large hot ovenproof skillet with a lid, render the bacon until it is crispy, about 6 to 8 minutes.  Remove the bacon, drain on paper towels and set aside.",
    "Season the flour with salt and pepper.  Dredge the chicken pieces in the seasoned flour, coating each side completely.  Shake off the excess and reserve the remaining flour.  Lay the chicken, skin side down in the hot bacon fat and brown the chicken for 3 to 4 minutes on each side.  Remove the chicken for the pan and set aside.  Add the onions to the pan and sauté for 2 to 3 minutes or until tender and translucent.  Add the mushrooms, shallots, and garlic and season with salt and pepper.  Sauté for 2 minutes then add the thyme and bay leaves and return the chicken pieces back into the pan.  Add the red wine and chicken, or veal, stock and bring the liquid back to a simmer then cover.  Cook the chicken until it is very tender, about 30 to 35 minutes, skimming off the fat as it cooks.  Remove the chicken pieces and set aside.",
    "Blend the remaining flour and butter together into a smooth paste.  Whisk the paste into the hot liquid.  Bring the liquid to a simmer and cook for 3 to 4 minutes.  Return the chicken back into the pan and continue cooking for 5 more minutes.  Stir in the parsley and season with salt and pepper, if needed. "
  ],
  "remarks": "Serve with mashed potatoes.  Spoon the sauce over the potatoes and the chicken.  Garnish with the crispy bacon and parsley.",
  "yield": "Serves 4.",
  "source": "Recipe courtesy of Emeril Lagasse, 2000."
}