{
  "title": "Cranberry Pork Chops",
  "category": "06 - Main Meals",
  "requires": "",
  "ingredients": [
    "1½ cups sugar",
    "1¾ cups water, divided as explained in the instructions",
    "1 package (12 ounces) fresh or frozen cranberries",
    "½ cup barbecue sauce",
    "8 pork chops (bone in), ½ to ¾ inch thick",
    "Salt and Pepper, to taste",
    "2 tablespoons vegetable oil",
    "2 tablespoons cornstarch",
    "¼ cup cold water"
  ],
  "instructions": [
    "In a saucepan, combine the sugar and 1½ cups cold water.  Place the saucepan over medium heat and cook, stirring periodically, until the sugar is dissolved.  Bring the sugar syrup to a boil; and boil it uncovered, for 5 minutes.  Add the cranberries and cook for 5 minutes longer; or, until the majority of the berries have popped open.  If necessary, skim off any foam that forms during the cooking process.  Add in the barbecue sauce and the remaining water and stir the mixture well, remove from the heat and set aside.",
    "Season the pork chops with salt and pepper.  Place a large skillet over medium heat, allow it to warm up then add the vegetable oil.  When the oil is starting to smoke place as many of the pork chops as the size of the skillet allows and brown them on both sides.  If you have to do the browning in two or more batches set the browned chops aside to drain on paper towels while you finish this task.  When all of the chops have been browned drain all the remaining oil from the skillet and discard it.  Return all the pork chops to the skilled and pour the cranberry sauce over the chops.",
    "Cover the skilled and place it over low heat.  Simmer, covered, for 35 to 40 minutes; or, until the meat juices run clear, and you see no pink, when you pierce the pork chops with a sharp knife.  If the skillet is too small to hold all the pork chops in a single layer make it a point of periodically rotate the pork chops within the skillet while they are simmering.  After the pork chops have cooked through, as explained above, remove them to a platter and keep warm.",
    "Combine the cornstarch with the remaining ¼-cup of water and stir to blended and smooth.  Increase the heat to medium and add the cornstarch mixture to the cranberry sauce in the skillet and bring to a boil.  Cook the mixture, stirring frequently for 2 minutes; or, until the sauce is thickened.  Spoon the thickened cranberry sauce over the pork chops and serve."
  ],
  "remarks": "One 16-ounce can of cranberry sauce, whole-berry, may be substituted for the cranberries and 1½-cups of water.  Simply start by combining the cranberry and barbecue sauces together with ¼ cup of water.  Use as directed in the recipe above. [From the author:]  “This meal is a proven winner to fix.  I never have leftovers.” ",
  "yield": "Serves 8.",
  "source": " Taste of the Country, Recipe by Joan Dobbs, , Country Magazine, October/November 2000.",
  "tags": []
}