{
  "title": "Creamy Poblano Chicken",
  "category": "06 - Main Meals",
  "requires": "",
  "ingredients": [
    "3 tablespoons butter or margarine",
    "1 large sweet onion, chopped",
    "2 poblano chile peppers, cooked, peeled, seeded, and diced",
    "3 garlic cloves, minced",
    "8 skinned and boned chicken breast halves, cut into bite-size pieces",
    "1 teaspoons salt",
    "½ teaspoons pepper",
    "1 (10¾ -ounce) can cream of chicken and mushroom soup, undiluted",
    "1 (8-ounce) container sour cream",
    "8-ounces of your favorite shredded cheese (Monterey Jack, Cheddar, etc.)",
    "Cornbread Waffles",
    "1½  cups cornmeal",
    "½ cup all-purpose flour",
    "2½ teaspoons baking powder",
    "2 tablespoons sugar",
    "¾ teaspoon salt",
    "1 large egg",
    "1½ cups milk",
    "¼  cups butter or margarine, melted",
    "1½ cups frozen corn, thawed"
  ],
  "instructions": [
    "Melt the butter and add the onion, chile pepper, and garlic and sauté for 5 minutes.  After the onion is translucent add the chicken pieces, salt, and pepper and cook, stirring often for 8 to 10 minutes or until chicken is done.  (Your selection of cooking pan will make a difference in the cooking time.)   Once the chicken is cooked (no pink in the flesh) stir in the soup and sour cream until the mixture is smooth.  Add the cheese and continue cooking for 7 to 8 minutes more or until the cheese is melted and well incorporated.",
    "Serve warm over Cornbread Waffles.",
    "Yield:  6 to 8 servings.",
    "Source:  New Ways with Cornbread by Andria S. Hurst, Southern Living, February 1998.",
    "Cornbread Waffles",
    "Stir together the first five ingredients (the cornmeal, flour, baking powder, sugar and salt) in a large bowl.  Stir together the next three ingredients (egg, milk and melted butter) and then add the mixture to the cornmeal mixture.  Stir just until the dry ingredients are moistened.",
    "Cook in a preheated, oiled waffle iron until just crisp."
  ],
  "remarks": "",
  "yield": "12 (four inch) waffles.",
  "source": "New Ways with Cornbread by Andria S. Hurst, Southern Living, February 1998.",
  "tags": []
}