{
  "title": "Crispy Pork with Spicy Thai Flavors",
  "requires": "",
  "ingredients": [
    "1½ pound pork butt",
    "1 egg, beaten",
    "1 tablespoon cornstarch",
    "1½ teaspoon salt",
    "1 teaspoon freshly ground black pepper",
    "2 cups vegetable oil",
    "4 garlic cloves, minced",
    "6 cilantro plants, including roots, well washed and coarsely chopped",
    "6 dried chilies, crumbled",
    "3 tablespoons fish sauce",
    "3 tablespoons fresh lime juice",
    "2 tablespoons water",
    "¼ cup roasted peanuts, coarsely chopped"
  ],
  "instructions": [
    "Trim the pork of excess fat and cut it into 1½-inch cubes.",
    "In a bowl, combine the egg, cornstarch, salt, and black pepper.  Add the pork cubes and toss to mix and coat the cubes well.",
    "In a carbon-steel wok, heat the oil over medium-high heat until just smoking.  Add the pork in batches and deep-fry it until its golden brown.  As it’s done remove it to paper towels to drain.  When all the pork is cooked pour off all but 1 tablespoon of the oil.  Reserve or discard the oil you removed, but let it cool first.",
    "Return the wok to the heat and add the garlic, cilantro, and chilies and stir-fry for 10 seconds.  Add the fish sauce, lime juice, and water and bring the mixture to a simmer and cook for one minute.  Add the pork and peanuts and toss the mixture well to coat well with the sauce.  Serve immediately over white rice.",
    "Remarks:  You could toss these crisp pork cubes in any sauce, but here I [Rosa Ross] use spicy fresh Thai flavors.  This dish is quite hot, so if you want to, you can reduce the number of chilies or leave them whole.  I [Rosa Ross] have used pork butt, as a little fat is great for the flavor.  However, you could substitute tenderloin if you don’t mind the extra expense and wish to save on the calories.",
    "Yield:  Serves 4.",
    "Source:  New Wok Cooking by Rosa Ross, Clarkson Potter/Publishers, New York, © 2000 by Rosa Ross."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}