{
  "title": "Cypriote Braised Pork with Coriander (Afelia)",
  "requires": "",
  "ingredients": [
    "2 pounds boneless lean pork, cut into “stewing size” pieces",
    "2 cups dry red wine",
    "2 tablespoons coriander seeds",
    "1 (3-inch) cinnamon stick, snapped in half",
    "¼ cup extra-virgin olive oil",
    "24 small white onions, cleaned and peeled",
    "3 bay leaves",
    "Sea salt and freshly ground black pepper"
  ],
  "instructions": [
    "Pour the wine into a bowl large enough to contain the wine and the pork chunks.",
    "Clean and cut up the pork into small chunks; pat them dry and place them in the wine.  If you have a pestle and mortar us it to crush the coriander seeds (do not use coriander that has been pre-ground).  If you don’t have a mortar, use another method to crush the coriander seeds.  Add the crushed coriander, as well as the cinnamon stick, to the pork and wine mixture.  Mix the meat with the spices well, cover the bowl with plastic wrap, and set the bowl in the refrigerator to allow the meat to marinade for several hours.",
    "When ready to cook, remove the pork pieces from the marinade, allow them to drain well and pat them dry with paper towels.  Reserve the wine marinade.",
    "In a heavy pot or saucepan large enough to hold all of the pork and onions heat the olive oil over medium-high heat.  When the olive oil is barely smoking begin sautéing the pork.  (It’s important that one not add too many pieces of pork at once otherwise the juices the pork release will overwhelm the evaporation process and instead of sautéing you will be cooking the pork and the caramelization we want to occur on the pork will not occur.  Sauté the pork in batches in the hot oil, removing individual pieces of the pork to a plate as they brown, until all the pork has been sautéed.)  When all the pork has been browned add the onion to the pot, or saucepan, and proceed to sauté the onions in similar manner.  It’s important to stir the onions well to make sure that they brown evenly, all around.",
    "When finished with the onions return all the sautéed pork and onions, if you had to sauté in batches as well, to the pot and pour in the marinade over the meat and onions and bring the mixture to a simmer.  Place the bay leaves in the pot and add a “little” salt and a “lot” of black pepper; stir the mixture and cover.  Turn the heat to low and simmer the mixture very gently for 2 hours; or, until the pork is “fork tender” and the liquid is reduced to a thickened and syrupy sauce.  If the pork is done but the sauce remain too thin remove the onions and pork to a platter and over high heat rapidly boil down the sauce until it reaches the desired consistency.",
    "Return the pork and onions to the sauce, stir in and allow the pork and onions to come back to serving temperature and serve."
  ],
  "remarks": "",
  "yield": "Serves 6.",
  "source": "The Essentials Mediterranean by Nancy Harmon Jenkins, Harper Collins Publishers, Inc., , ©2003 by Nancy Harmon Jenkins.",
  "category": "06 - Main Meals"
}