{
  "title": "My Personal Beef Stew Recipe (An Improvement over the Original)",
  "requires": "",
  "ingredients": [
    "2 pounds lean beef sirloin, cut into ½-inch cubes",
    "2 tablespoons vegetable shortening (you can substitute any good quality oil)",
    "2 cups red wine",
    "2 cups beef or chicken broth",
    "1 tablespoon balsamic vinegar (lemon juice or cider vinegar may be substituted)",
    "1 teaspoon Worcestershire sauce",
    "1 large garlic clove, whole (for a more intense garlic taste crush it before adding it)",
    "2 large or 3 medium size bay leaves",
    "1 tablespoon salt",
    "1 tablespoon sugar",
    "½ teaspoon black pepper",
    "½ teaspoon sweet paprika",
    "A dash of cloves",
    "1 medium onion cut into “eighths” (cut in half then each half cut into four equal parts)",
    "1 pound small white “pearl” or “boiling” onions",
    "6 carrots, peeled and cut into rounds, ¼ to ⅛-inch thick",
    "2 cups diced potatoes cut into ½-inch cubes",
    "2 cups frozen corn kernels",
    "2 large celery stalks, washed and cut into half-rounds, ¼ to ⅛-inch thick",
    "½ cup cold water",
    "1 tablespoons corn starch (Use two tablespoons if you prefer a thicker gravy)"
  ],
  "instructions": [
    "The day before you are going to make the stew begin by peeling the “pearl” or “boiling” onions as follows.  In a large pot add enough water so that when you add all the onions they will be floating in the quantity of water you use.  Bring the water to a rolling boil.  When the water is ready carefully dump all the onions into the water and allow them to remain in the hot water for one minute.  At the end of one minute fish out the onions and refresh them under cold running water.  When they are cool enough to handle sit down and cut off the root-end and a small portion of the top; the skins will peel right off easily.  (It’s a harder job if you don’t use this method; but it can be done.)  Rinse the onions, pat them dry with paper towels and store them in a gallon size plastic zip lock bag.  Continue by cutting the carrots and the celery and adding them to the plastic bag with the onions.  Take out of the freezer the bag of frozen corn kernels and measure out the quantity you’re going to use and add the corn to the bag with all the vegetables.  (I prefer not to cut up the potatoes a day ahead because they tend to oxidize and turn brown so I generally leave them to the day I make the stew.)",
    "Similarly, wash the beef sirloin under cold water, pat it dry with paper towels and trim and discard the fat.  Cut the sirloin into a ½-inch dice and place the diced beef in a separate plastic zip lock bag.",
    "Place the plastic bags; the vegetables and diced beef, in the refrigerator until the following morning.",
    "On the day you are making the stew start by rounding up all the ingredients and having them on hand.  Peel and cut up the medium size onion into “eighths” and set it aside. (We’re using this onion to deglaze the Dutch oven or pot after we finish browning the beef).",
    "Place a large Dutch oven or a large heavy pot over medium-high heat and add the shortening (or oil).  When the shortening is hot, and is just starting to smoke, begin browning the cubed beef.  (Pat the beef cubes dry with paper towels before placing them in the hot pan; as the beef will have released water overnight in the plastic bag.)  It’s important not to crowd the beef (adding too great a quantity) in the Dutch oven or heavy pot you’re using, because the beef will “cook” in its juices and not caramelize, “brown.”  It’s best to work in batches.  Working in batches; remove the beef from the Dutch oven or pot when the beef cubes are a dark scorched brown color.  Remove the caramelized beef, as it is done, to a plate; and finish the complete batch before adding more.",
    "When all the beef has been browned and caramelized add the chopped onion to the Dutch oven or pot; keeping the heat setting at medium-high begin deglazing the Dutch oven or pot.  When the onion has turned translucent return all the meat to the Dutch over or pan (don’t forget to pour in any of the beef juices that have accumulated in the plate).  Next add the wine, the broth, the balsamic vinegar, the Worcestershire sauce, the garlic clove, bay leaves, salt, black pepper, paprika, and the dash of cloves; then stir well to mix all the ingredients.  Bring the mixture to a boil then reduce the heat to “low.”  Cover the Dutch oven or pot and keep the stew simmering, stirring occasionally, for 2 hours.  You may have to work at adjusting the heat setting to keep the stew simmering and not boiling.  (Remember to stir occasionally because the ingredients will settle over time.)",
    "Now is the time to peel and dice the potatoes.  In the last half hour of keeping the stew simmering clean, peel, rinse, and dice the potatoes and set them aside with the rest of the vegetables.",
    "When the two hours are up, remove and discard the bay leaves and the garlic clove.  Now, add all the vegetables to the stew, and if necessary, add enough boiling water to the Dutch oven or pot so that all the vegetables are barely covered by the liquid in the stew.  Stir to distribute the vegetables evenly throughout the stew then raise the heat to medium-low and allow the stew to return to a boil.  When the stew begins boiling lower the heat to “low” again; cover, and cook the stew, stirring occasionally, for 1 hour; or, until the carrots and potatoes are thoroughly cooked.",
    "If the stew has released any fat now is the time to skim it off.  (You may remove any additional fat the following day after refrigerating the stew overnight; before enjoying it the next time.)",
    "Lastly, after the vegetables are thoroughly cooked raise the heat setting to medium.  Place a ½-cup of cold water in a glass jar (with a cap) and to it add the cornstarch.  Cover tightly and shake vigorously to mix the cornstarch and water.  Pour the cornstarch/water mixture into the stew and cook the stew until the “gravy” has thickened and is ready to serve.  (If the stew doesn’t thicken to your desired consistency then next time you make the stew adjust the quantity of cornstarch you use to achieve a thicker or thinner consistency.)"
  ],
  "remarks": "The stew can be made using only water instead of wine and broth.  However, in my opinion (after making this recipe numerous times) it’s best when wine and broth are used. When I was on my own, in my “bachelor days,” I used to make this stew on weekends.  During week days I would simply spoon out and heat up enough for my meals in the evenings.  It was a great time saver on workdays.  Incidentally, the stew tastes better after it has been refrigerated overnight; so it only gets better in the refrigerator. The source of the original recipe is noted below.  However, over time I’ve changed the recipe enough so that there only remains a casual similarity between the original recipe and the way I make it today. With cornbread this stew make a meal fit for a king. Yield:  Makes 10 to 12 individual servings. Source:  Better Homes and Gardens Meat Cook Book, By the Editors of Better Homes and Gardens, ©Meredith Publishing Co., 1960.",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}