{
  "title": "Deep-Fried Whole Fish",
  "category": "06 - Main Meals",
  "requires": "",
  "ingredients": [
    "Main Ingredients -",
    "1 firm-fleshed, fresh whole fish (2 to 3 pounds), scaled and cleaned",
    "½ cup all-purpose flour",
    "½ cup cornstarch",
    "1 teaspoon salt",
    "½ teaspoon freshly ground black pepper",
    "2 cups vegetable oil",
    "2 scallions (green and white parts), slivered",
    "2 tablespoons slivered peeled fresh ginger",
    "For the Sauce –",
    "1 cup Chicken Broth",
    "¼ cup dry white wine",
    "1 tablespoon thin soy sauce",
    "2 tablespoons black vinegar",
    "1 teaspoon sugar",
    "1 tablespoon cornstarch mixed with 2 tablespoons cold water",
    "1 tablespoon Asian sesame oil"
  ],
  "instructions": [
    "Rinse the fish in cold water and pat it dry with paper towels, inside and out.  Combine the flour, cornstarch, salt, and pepper.  Dredge the fish in the flour mixture, coating well.",
    "Prepare the sauce in a small stainless-steel or coated-aluminum wok or saucepan; combine the broth, wine, soy sauce, black vinegar, sugar, cornstarch mixture, and sesame oil.  Bring it to a simmer and cook for about 5 minutes, until it thickens then keep it warm.",
    "In a carbon-steel wok, heat the vegetable oil over high heat until just smoking.  Gently slide the fish into the oil and deep-fry for 8 to 10 minutes, until golden.  Using a ladle, spoon some of the hot oil over the parts of the fish that are not submerged.  Turn the fish once, with two spatulas.  When the fish is golden and feels firm when pressed, it is done; the total cooking time should be approximately 20 minutes, depending on the thickness of the fish.  Remove the fish to a serving platter and sprinkle with the scallions and ginger.  Pour off all but 2 tablespoons of the oil and reserve for another use of discard it.  Reheat the 2 tablespoons of oil to smoking and drizzle over the scallions and ginger, which should sizzle when it is hit by the hot oil.  Finally, pour the warm sauce over the fish and serve."
  ],
  "remarks": "",
  "yield": "Serves 4.",
  "source": "New Wok Cooking by Rosa Ross, Clarkson Potter/Publishers, New York, © 2000 by Rosa Ross."
}