{
  "title": "Deep-Fried Battered Shrimp",
  "requires": "",
  "ingredients": [
    "2 pounds fresh, unfrozen shrimp, peeled",
    "1 cup warm water",
    "Sea salt",
    "Unbleached all-purpose flour",
    "1 cup extra-virgin olive oil",
    "Lemon quarters, to garnish (optional)",
    "Shrimp cocktail sauce"
  ],
  "instructions": [
    "Clean, peel (if unpeeled), and rinse the shrimp; then pat them dry using paper towels.  Place paper towels on a plate, put the clean shrimp on the plate, cover with plastic wrap and set the shrimp aside in the refrigerator while you make the batter and get the oil to temperature.",
    "Mix together the warm water and ½ teaspoon sea salt in a bowl and set it aside until the salt is dissolved.",
    "Place about ½ cup of flour in a flour sifter and gradually sift the flour over the salted water while you stir it with a wire whisk (or fork).  Keep sifting and stirring until you have a batter that is about the consistency of “heavy” cream.  If you did it correctly there should be no lumps in the batter.",
    "In a frying pan, heat the olive oil to 360° F.  If you don’t have (a thermometer), a way of measuring the temperature of the oil, use a small cube of bread.  Drop the cube of bread in the hot oil, when you think the oil is ready.  If the oil is at the right temperature the bread should turn golden and crisp – “rapidly.”",
    "One by one, dip the shrimp in the batter, patiently let the excess drip off, and gently (to avoid splattering the oil) drop the coated shrimp into the hot oil.  It’s very important that you don’t overcrowd the pan.  Too many shrimp in the pan will lower the oil temperature below “frying temperature” and result in excessive oil absorption by the batter.  Small shrimp will cook very quickly, in a minute or less.  When the shrimp are light golden and crisp, remove it with a slotted spoon.  Place the fried shrimp on a rack covered with paper towels and allow them to drain before serving.",
    "Serve immediately; as soon as all the shrimp are done, sprinkled with salt.  Serve with lemon quarters to squeeze over them, if you wish.",
    "Remarks:  To make a special garnish take sprigs of flat-leaf parsley, just the upper parts where the three leaf stems come together, dip them in the batter and deep-fry them.  Scatter these over the top of the fried shrimp.",
    "Yield:  Serves 4.",
    "Source:  The Essentials Mediterranean by Nancy Harmon Jenkins, Harper Collins Publishers, Inc., , ©2003 by Nancy Harmon Jenkins."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}