{
  "title": "Emilia Romagna Lasagna with Meat and Tomato Sauce (Lasagne alla ferrarese)",
  "category": "06 - Main Meals",
  "requires": "",
  "ingredients": [
    "For the sauce –",
    "1 small onion",
    "½ carrot",
    "1 stick celery",
    "1 cup raw prosciutto with its fat, chopped",
    "½ cup butter",
    "½ cup butter",
    "½ pound ground beef, lean",
    "6 tablespoons dry white wine",
    "2¼ cups canned tomatoes, peeled",
    "Salt and pepper",
    "For the béchamel sauce –",
    "2 tablespoons butter",
    "2 tablespoons flour, unbleached",
    "2 cups milk",
    "A dash of nutmeg",
    "Additional bits of butter kneaded with flour may be required",
    "For the final dish –",
    "¾ pound “lasagna”",
    "1⅓ cups grated Parmesan cheese"
  ],
  "instructions": [
    "Finely chop the onion, carrot, celery and prosciutto.  Heat the butter in a casserole or terracotta dish and add the chopped vegetables and prosciutto and cook together for several minutes on a low flame, then add the beef and cook it until no pink remains.  Raise the heat, and add the wine and cook the mixture until all the wine is incorporated, and the smell of wine is gone.  Put the tomatoes in a blender and blend them using a “chop” setting.  Add them to the meat mixture and lower the heat and continue cooking.  Season the combination with salt and freshly ground pepper, cover the pan and cook over a low heat for about one hour, adding some water or stock when the mixture becomes too dry.",
    "Make the Béchamel sauce while the meat mixture continues cooking.   Heat two cups of milk but do not let it come to a boil.   In a sauce pan, heat 2 tablespoons (1 ounce) butter and when it starts to foam stir in 2 tablespoons (1 ounce) of flour and stir continuously until the flour is golden brown.  Gradually pour in the hot milk while stirring constantly.  Season with salt and freshly ground pepper and continue to stir constantly; especially, when it is almost boiling, over low heat for about 15 to 20 minutes.  At the end, add a little nutmeg, mix well, and remove the sauce from the heat when the béchamel sauce is smooth and thick.  If the sauce is too thin and runny return it to the heat with a small piece of butter, kneaded with some flour, and stir well until smooth.",
    "Cook the lasagna in plenty of salted boiling water.  Remove it for the heat while its still firm, and then rinse them under cold tap water.",
    "Grease an ovenproof dish and put in alternate layers of lasagna, meat sauce, a few tablespoons of béchamel sauce sprinkled with Parmesan cheese; ending with a covering of the béchamel sauce sprinkled with the remaining grated Parmesan cheese.  Dot the top layer of béchamel sauce with bits of butter and bake it in a preheated oven at 400° F., for 30 minutes."
  ],
  "remarks": "",
  "yield": "Serves 4.",
  "source": "Pasta & Pizza, Recipes compiled by Ann Martini, Translated by Elisabeth Evens, St. Martin’s Press Inc., 175 Fifth Ave., New York, N.Y., 10010, © 1974 by Arnoldo Mondadori – Verona, Italy."
}