{
  "title": "Fiesta Stew (Guisado de Res de San Blas Atempa)",
  "requires": "",
  "ingredients": [
    "The Beef Stock Seasoning Ingredients –",
    "1 tablespoon sunflower or vegetable oil",
    "1½ medium white onions",
    "2 pounds beef bones",
    "3 carrots, cut into large chunks",
    "3 celery ribs, with leaves",
    "1 head of garlic",
    "5 bay leaves",
    "½ teaspoon dried thyme",
    "15 black peppercorns",
    "1 whole allspice",
    "1 chile de árbol",
    "For the Stew –",
    "1 pound beef ribs",
    "2 pounds boneless stewing beef",
    "10 chiles guajillos, stemmed, seeded and deveined",
    "2 sprigs fresh thyme or ½ teaspoon dried",
    "10 black peppercorns",
    "1 piece of Mexican cinnamon, 1 inch long",
    "½ head of garlic, cloves separated",
    "2 tablespoons sunflower or vegetable oil",
    "1 pound tomatoes (2 medium-large round or 8 to 10 plum), halved and sliced",
    "2 cups halved and sliced onions",
    "1 bunch green onions, sliced with the greens",
    "1½ cups chunked pineapple",
    "1 ripe plantain (about ¾ pound) sliced into ½-inch chunks",
    "1 apple, cut into ½-inch chunks (about 1 cup)",
    "2 tablespoons caper, chopped if they are too large",
    "½ cup raisins",
    "4 tablespoons jalapeño chiles in escabeche, sliced",
    "1 teaspoon salt"
  ],
  "instructions": [
    "Making the Beef Stock –",
    "Preheat the oven to 400° F.",
    "In a large 6-quart stockpot or Dutch oven, heat the oil over high heat.  Add the beef bones, onions, carrots, celery, and garlic.  Cover and place the pot in the oven and roast for 45 minutes.",
    "Take the pot out of the oven and put on the stove top.  Add the bay leaves, thyme, peppercorns, allspice, chile de arbol, and 4 quarts of water.  Once boiling add the meat and let it return to a boil.  Skim off the foam that appears on the surface and discard.  Lower the heat and cook for 3 hours over low heat, or until meat is tender.  When done, remove the meat and set aside.  Let cool and skim off the fat, strain, and set the stock aside.",
    "Wash the pot and set it aside to use again.",
    "Making the Stew –",
    "In a small saucepan, bring 2 cups of water to a boil.  Once boiling, remove from the heat and in it soak the chiles guajillos for 10 minutes, or until soft.",
    "Place the chiles, thyme, peppercorns, cinnamon, and garlic in a blender and puree until smooth.  Pass this mixture through a food mill or sieve.",
    "In the 6-quart stockpot, heat the oil until smoking and fry the chile paste until it is very aromatic, about 15 minutes.  Add the tomatoes, onions, and green onions.  Fry these for about 10 minutes, stirring constantly.  Add 6 cups of the reserved stock and the meat; then add the pineapple, plantain, apple, capers, raisins, and the jalapeño chiles.  Simmer everything together for another ½ hour, then add the salt and taste the results to see if your tastes requires more than the single teaspoon of salt.",
    "Serve with soft corn tortillas.",
    "Remarks:  This recipe lends itself to being done over a two day period.  On the first day cook the beef stock and on the second day make the stew.",
    "Yield:  Serves 8.",
    "Source:  Seasons of My Heart, A Culinary Journey Through Oaxaca, Mexico by Susana Trilling, published by The Ballantine Publishing Group, © 1999 by Susana Trilling."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}