{
  "title": "Barbecue Brisket (Mother’s Recipe)",
  "requires": "",
  "ingredients": [
    "For the brisket –",
    "6 pound brisket, trimmed of some but not all of the fat",
    "3 tablespoons Liquid Smoke",
    "Garlic powder",
    "Onion salt",
    "Celery salt",
    "Pepper",
    "Worcestershire sauce",
    "For the Barbecue sauce –",
    "1 cup catsup",
    "1 teaspoon celery seed",
    "1 teaspoon salt",
    "¼ cup brown sugar",
    "¼ cup Worcestershire sauce",
    "2 cups water",
    "1 medium onion, chopped",
    "¼ cup cider vinegar"
  ],
  "instructions": [
    "A day ahead begin by joining together two large pieces of aluminum foil (preferably heavy duty) to get one piece; large enough to seal the entire brisket.  Lay the foil on a large oven pan and carefully work the foil into the pan so that when you set the brisket on the foil its weight doesn’t stretch and tear the foil.",
    "Clean and trim off some, but not all, of excess fat from the brisket.  It’s best if enough fat remains on the brisket to provide plenty of juices while it’s cooking.  (The fat can be trimmed off when serving.)  Pat the brisket dry with paper towels and set it on the prepared foil.",
    "Coat the brisket, top, bottom and sides with the Liquid Smoke; then sprinkle it with the garlic powder, the onion and celery salts being careful to coat both sides.  Fold and crimp the foil closed it to seal the brisket within.  Place the brisket in the refrigerator and allow it to remain in the refrigerator overnight.",
    "Preheat the oven 275° F.",
    "The next day remove the brisket from the refrigerator and carefully undo the crimped edges of the foil to open to access the brisket.  Spread the Worcestershire sauce evenly over the brisket and finish by sprinkling the pepper on both sides of the brisket.  Reseal the foil; again crimp the edges of the foil to get a vapor proof package.",
    "Set the brisket in the center rack of the preheated oven and bake for 5 hours.",
    "While the brisket is baking make the barbecue sauce by mixing all the ingredients listed above in a sauce pan large enough to hold all the ingredients.  Bring the ingredients to a boil, stirring and keep the sauce at a boil for 15 minutes.  Remove from the heat source and allow it to cool to room temperature.",
    "After 5 hours remove the brisket from the oven and unseal the foil carefully to avoid being scalded by the steam.  Drain off and discard all the juices and grease that was released by the brisket; also discard the foil.  Brush the brisket with the barbecue sauce and return the brisket to the oven to bake for one additional hour, uncovered.  Baste the brisket every 15 minutes; or, more frequently if you note that it’s drying out too quickly.  (This is why it’s a good idea to make sure that not all the fat is removed before starting.)",
    "Serve with the remaining barbecue sauce.",
    "Yield:  Serves 8 to 10.",
    "Source:  Unknown; however, this is the recipe that my mother uses and passed on to us."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}