{
  "title": "Grilled Orange-Flavored Chicken Breasts",
  "requires": "Brown Sauce and recommended served with vegetable kebabs.",
  "ingredients": [
    "8 unskinned boneless chicken breasts",
    "1 onion, minced",
    "¼ cup fresh orange juice",
    "the grated rind of one orange",
    "⅓ cup fresh lemon juice",
    "3 tablespoons soy sauce",
    "2 tablespoons white-wine vinegar",
    "2 tablespoons honey",
    "1 tablespoon peeled and minced gingerroot",
    "1 tablespoon plus 1 teaspoon Dijon-style mustard",
    "2 cloves garlic",
    "2 cups brown sauce (see separate recipe)",
    "2 tablespoons dry Sherry",
    "2 tablespoons cornstarch",
    "1 teaspoon brown sugar",
    "¼ cup minced fresh coriander leaves",
    "¼ cup finely minced shallots",
    "16 slices of thick bacon"
  ],
  "instructions": [
    "In a shallow ceramic or glass dish just large enough to hold the chicken breasts in one layer combine the onion, the orange juice, the orange rind, the lemon juice, the soy sauce, the vinegar, the honey, the gingerroot, the mustard, the garlic, and salt to taste.  Rinse and pat dry the chicken breasts and add it to the marinade, spoon the marinade over it, and chill the mixture, covered, for at least 2 hours but preferably overnight.",
    "Transfer the chicken with tongs to a plate, transfer the marinade to a stainless steel or enameled saucepan, and stir in the brown sauce.  Bring the mixture to a boil and simmer it stirring occasionally, for 15 minutes.  Return the mixture to a boil, stir the Sherry mixture, and add it in a stream, whisking.  Whisk in the mustard, the brown sugar, and salt and pepper to taste and simmer the sauce for 1 minute, or until it is thickened slightly.  Strain the sauce through a fine sieve into a small stainless steel or enameled saucepan and keep it warm, covered with a buttered round of wax paper.",
    "Pat the chicken dry, turn it skin side down, and with a sharp knife make a horizontal slit lengthwise along the thick side of each breast, beginning 1 inch from the top and ending 1 inch from the bottom, to form a pocket.  Fill the pocket of each breast with some of the coriander mixture, add salt and pepper to taste, and pat each breast gently back into shape.  Wrap each breast with 2 slices of bacon and secure the bacon with wooden tooth picks.",
    "To grill the chicken:  Arrange the chicken skin side down on a lightly oiled grill over glowing coals and grill it, turning it frequently, for 12 to 15 minutes, or until the bacon is crisp.  Remove the bacon, reserving it, and grill the chicken skin side down until the skin is crisp and golden brown and the meat is springy to the touch.",
    "To broil the chicken:  Arrange the chicken skin side up on a lightly oiled broiler pan and broil it under a preheated broiler about 4 inches from the heat source for 5 to 7 minutes on each side, or until the bacon is crisp.  Remove the bacon, reserving it, and broil the chicken skin side  up for 3 to 5 minutes more, or until the skin is crisp and golden brown and the meat is springy to the touch.",
    "Transfer the bacon and the chicken to a heated platter, nap the chicken with the brown sauce, and serve it with vegetables kebabs."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}