{
  "title": "Grilled Pork Tenderloins Marinated in Merlot and Molasses",
  "requires": "",
  "ingredients": [
    "⅔ cup molasses",
    "2 cups Merlot; or, other similar red wine",
    "½ cup balsamic vinegar",
    "4 large cloves garlic, sliced",
    "3 tablespoons lemon juice",
    "½ teaspoon cinnamon",
    "1 tablespoon grated fresh ginger",
    "1 teaspoon ground nutmeg",
    "1 teaspoon paprika",
    "1 teaspoon salt",
    "2 or 3 pork tenderloins; or, 1 boneless pork loin (from 2 to 2½ pounds), well trimmed"
  ],
  "instructions": [
    "In a small bowl combine all of the ingredients (except the pork) and mix the marinade well.  Place the pork in a large noncreative bowl and pour the marinade in to cover the pork.  Cover with plastic wrap and place in the refrigerator for at least 3 hours; or, as long as overnight.  (An alternative to using a ceramic bowl is to use a large plastic bag.  Place the pork inside and pour in the marinade.  Close the bag and place it on a plate or bowl (or other suitable container) and set it in the refrigerator to marinade for the three to 24 hour period.)",
    "Depending on weather conditions prepare the charcoal fire in the grill from 20 to 30 minutes before grilling.  When all of the charcoal is burning “ash-white” adjust the grill level to its level nearest the charcoal.  (You might wish to spray Pam©, or some other spray oil, on the cold grill before setting it over the charcoals to keep the pork from sticking.)",
    "Remove the pork from the marinade and set it directly onto the grill over the hot charcoal.  (Don’t bother patting the pork dry.)  Cook the pork for 20 to 25 minutes for the loin turning it to cook evenly; or, for 12 to 15 minutes for the tenderloin.  But if you have a meat thermometer cook the pork until the internal temperature registers 140° F.",
    "Remove the pork from the grill and let it rest for about 10 minutes before cutting it into thin slices.   It’s best when served warm but it can also be served at room temperature (summer time)."
  ],
  "remarks": "",
  "yield": "Serves 6.",
  "source": "Food Section, San Antonio Express-News, Wednesday, May 25, 2005 extracted from ‘Sharing the Vineyard Table’ by Carolyn Wente and Kimball Jones.",
  "category": "06 - Main Meals"
}