{
  "title": "King Ranch Beef Casserole",
  "requires": "",
  "ingredients": [
    "2 pounds beef sirloin",
    "2 cups water",
    "1 cup finely chopped sweet onion",
    "½ cup coarsely chopped red bell pepper",
    "½ cup coarsely chopped green bell pepper",
    "2 to 4 tablespoons coarsely chopped jalapeño pepper",
    "1 teaspoon salt",
    "1 teaspoon black pepper",
    "1 teaspoon ground cumin",
    "1 teaspoon granulated garlic",
    "1 tablespoon chili powder",
    "1 (10-ounce) can diced green chile peppers and tomatoes",
    "1 (16-ounce) can beef broth",
    "⅔ cup skim milk",
    "8 ounces Monterey Jack or Mozzarella cheese, grated",
    "12 corn tortillas, chopped into quarter segments"
  ],
  "instructions": [
    "Put the beef and water together in a pot and cook it over low heat for 30 to 45 minutes, until the meat is “fork tender” and cooked well enough to shred.  Remove the meat from the heat source and allow it to cool.  Once it’s cool enough to handle, shred it into small pieces and set it aside.",
    "Prepare a casserole dish by spraying the insides with a nonstick cooking spray, such as Pam©, and set it aside.",
    "Preheat the oven to 350° F.",
    "In a large skillet and without using oil sauté the onions and peppers, to which you’ve added all of the seasonings, for 2 to 3 minutes, until the onions are translucent.  Once the onions are translucent add the canned chiles and tomatoes, the beef broth, and the skim milk, and simmer for 2 to 3 minutes.  When the mixture is well blended stir in the cheese, stir the mixture until the cheese is melted and then add the shredded beef.  Lastly, add the tortillas, mix everything well, and pour the mixture into a casserole dish and bake for 30 minutes."
  ],
  "remarks": "",
  "yield": "Makes 6 to 8 servings.",
  "source": " Matt Martinez’s Culinary Frontier:  A Real Texas Cookbook, by Matt Martinez, Jr., and Steve Pate, published by Doubleday, 1540 Broadway, New York, N.Y. 10036, © 1997 by Matt Martinez, Jr., and Steve Pate.",
  "category": "06 - Main Meals"
}