{
  "title": "Mandarin Teriyaki",
  "requires": "",
  "ingredients": [
    "½ cup soy sauce",
    "¼ cup sherry",
    "2 tablespoons oil",
    "2 thin slices peeled fresh ginger; or, ¼ teaspoon powdered ginger",
    "1 crushed garlic clove",
    "2 pounds flank steak, cut into ½-inch thick strips",
    "2 tablespoons oil",
    "1 sliced small onion",
    "1 green bell pepper, cut into ½-inch wide julienne strips",
    "¾ cup pineapple juice",
    "2 teaspoons cornstarch",
    "2 cups canned mandarin orange slices, drained"
  ],
  "instructions": [
    "Combine the first five ingredients in a mixing bowl to make the marinade.  Place the beef strips in a plastic bag and to it add the marinade and massage to distribute the marinade with the beef.  Place the plastic bag in a container then allow the beef to marinade for several hours in the refrigerator; removing and agitating occasionally.",
    "After marinating for the length of time you intend, remove the beef from the marinade and pat it dry using paper towels; reserve the remaining liquid marinade but discard any fresh ginger you may have used.",
    "Heat a tablespoon of oil in a wok or skillet until it is just smoking and in it brown half of the beef strips.  When done remove them to a headed dish while you continue browning the other half of the beef.  Add the second tablespoon of oil, heat it, and brown the remaining beef.  (It’s important that you not try to brown all the beef at the same time because the liquids released by the beef will overwhelm the browning process.  It will result a tougher, chewier, beef.)  When done, add the browned beef strips to the first half in the heated dish and pour ½ cup of the marinade over the beef.",
    "In the same wok, or skillet, used to brown the beef place the onion, green pepper, and pineapple juice and allow the ingredients to simmer for 5 to 7 minutes.",
    "Meanwhile, in a small saucepan, combine the remaining marinade and the cornstarch.  Place the saucepan over medium heat and cook the mixture, stirring constantly, until the mixture is thick and “glossy looking”.  By no means allow this cornstarch mixture to reach a boil.",
    "When the cornstarch mixture is ready stir it into the vegetables.  Stir to blend; then add in the drained mandarin orange slices and browned beef, with its marinade, and cook everything together until the mandarin orange slices are, “just heated through”.",
    "Remove from the heat and serve at once!"
  ],
  "remarks": "If the meal is to be a “presentation meal” have the cooked white rice, to serve 4 to 6 persons, ready.  Make a bed of the rice in a decorative platter and on top of the rice arrange the meat mixture.  Serve promptly.  Otherwise, serve the individual plates in a similar manner. (Over a portion of the white rice arrange the meat mixture.)",
  "yield": "Serves 4 to 6 persons.",
  "source": "The Winning Combination is Meats with Fruit by Jinx Morgan, Bon Appétit, October 1977.",
  "category": "06 - Main Meals"
}