{
  "title": "Marguerite Hyder's Tamale Pie",
  "requires": "",
  "ingredients": [
    "2 tablespoons of olive oil",
    "1 Large Onion, chopped",
    "1 pound Hamburger, extra lean",
    "1 Large can chopped tomatoes",
    "1 Can Creamed Corn",
    "2 small cans of Tomato Sauce",
    "2 cups of water",
    "1 tablespoon Chili Powder",
    "1 cup yellow cornmeal",
    "Salt and pepper"
  ],
  "instructions": [
    "Grease and set aside a casserole dish.",
    "In a large skillet, set over medium-high heat, add the olive oil when the skillet is hot.  Let the oil begin to barely smoke then add the chopped onion and sauté it until it’s translucent and wilted.  Remove the sautéed onion to a plate and allow the onion to drain on paper towels while you add the ground beef to the skillet and cook it.  Break up the ground beef as it cooks to avoid having large clumps in the tamale pie.  When the ground beef has stopped releasing juices and no more pink remain, remove the skillet from the heat to drain off any accumulated grease.",
    "Return the skillet to the heat and add the chopped tomatoes, creamed corn, tomato sauce, chili powder, then return the sautéed onions to the mixture.  Stir to blend all the ingredients of the mixture while simultaneously adding the salt and pepper.  Adjust the saltiness level to your taste before you add the two cups of water.",
    "After you’ve added the water and stirred the mixture begin sprinkling the cornmeal, slowly, on the mixture and mixing it in quickly.  Do not pour too great a quantity of cornmeal at one time to avoid clumping.  When all the cornmeal has been incorporated and everything is well mixed remove the skillet from the heat and pour the mixture into the prepared casserole dish.",
    "Preheat the oven to 350° F.",
    "Bake in the center of the oven for 30 to 45 minutes; or, until the top of the tamale pie is bubbling.",
    "Remarks:  The tamale pie may be prepared and refrigerated.  After pouring the tamale pie mixture into the casserole dish allow it to cool.  When cool, cover with plastic wrap and place it in the refrigerator, for the following day.",
    "Yield:  Serves 4.",
    "Source:   Favorites off the Internet."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}