{
  "title": "Moorish Chicken and Nut Pie (Pastela Moruna)",
  "requires": "",
  "ingredients": [
    "3 tablespoons olive oil; or, more if needed",
    "1 large onion, quartered and thinly sliced",
    "½ cup chicken stock or broth; plus more for sprinkling on the onion",
    "3 cups skinned chicken, torn into bite-size pieces (a medium-size rotisserie chicken)",
    "1 tablespoon sweet (not smoked) paprika",
    "½ teaspoon ground cumin",
    "¾ teaspoon ground ginger",
    "¼ teaspoon ground cinnamon",
    "⅛ to ¼ teaspoon cayenne",
    "2 plum tomatoes, chopped",
    "⅓ cup dark raisins",
    "Coarse salt (kosher or sea)",
    "All-purpose flour, for dusting the work surface",
    "2 sheets frozen puff pastry, thawed",
    "¼ cup lightly toasted pine nuts",
    "¼ cup lightly toasted slivered almonds",
    "1 large egg yolk",
    "1½ teaspoons milk",
    "Confectioners’ sugar, for dusting the pie"
  ],
  "instructions": [
    "Heat the olive oil in a large skillet over medium-high heat.  Add the onion and cook it until it begins to soften; about 3 to 5 minutes if all things come together correctly.  Reduce the heat to low and continue cooking the onions until they are very soft and just beginning to brown; about 15 minutes, stirring and adding more olive oil and 1 to 2 tablespoons of chicken stock if the ingredients look too dry.  Stir in the shredded chicken and continue cooking for one additional minute before adding the paprika, cumin, ginger, cinnamon, and cayenne.  Stir the mixture a few seconds, just enough to obtain a uniform blending.  Add the ½ cup chicken stock, the tomatoes, and the raisins; stir and cover the skillet, and cook for 12 to 15.  When done, the filling should be soft and moist.  If it seems a little too wet, increase the heat to high for a few seconds to reduce the liquids.  At this stage season the filling with salt to taste and let it cool completely.  (The filling can be prepared up to a day ahead and refrigerated, covered.)",
    "Place an oven rack in the center position of the oven and preheat the oven to 375º F.  Lightly brush a 17- by 11-inch baking sheet with olive oil and set it aside.",
    "Lightly flour a work surface.  Using a floured rolling pin, roll out 1 sheet of puff pastry to a roughly 18- by 12-inch rectangle and transfer it to the center of the oiled baking sheet.  Roll out the remaining sheet of puff pastry to a rectangle that is slightly smaller than the first.  Spread the filling evenly over the pastry on the baking sheet, leaving about 1 inch bare along each of the four edges.  Sprinkle the pine nuts and almonds evenly on top of the chicken filling.  Cover the filling with the second puff pastry rectangle and fold the edges of the bottom crust up and over the top sheet of puff pastry, then crimp them decoratively.",
    "Place the egg yolk and milk in a small bowl and whisk to mix.  Brush the top of the pie with this egg wash.  Using a sharp knife, cut slits all over the top crust to allow steam to escape.",
    "Bake the pie on the center rack until its golden brown and baked through; about 30 to 35 minutes.  Remove the pie from the oven and allow it to cool until slightly warm; or, if you prefer until it comes to room temperature.  Dust very lightly with confectioners’ sugar before cutting it into squares and serving."
  ],
  "remarks": "",
  "yield": "Serves 12 as a snack; serves 6 to 8 as a main course.",
  "source": "The New Spanish Table by Anya von Bremzen, published by Workman Publishing Co. Inc., New York, www.workman.com, © 2005 by Anya von Bremzen.",
  "category": "06 - Main Meals"
}