{
  "title": "Old Time Beef Stew",
  "requires": "",
  "ingredients": [
    "2 pounds beef chuck, cut into 1-inch cubes",
    "2 tablespoons vegetables shortening",
    "4 cups red wine (water is an acceptable alternative)",
    "1 tablespoon balsamic vinegar (lemon juice or cider vinegar are acceptable alternatives)",
    "1 teaspoon Worcestershire sauce",
    "1 large garlic clove, whole",
    "2 bay leaves",
    "1 tablespoon salt",
    "1 tablespoon sugar",
    "½ teaspoon black pepper",
    "½ teaspoon sweet paprika",
    "A dash of cloves",
    "1 medium onion cut in “eighths” (in half, then each half in four equal parts)",
    "1 pound small white “pearl” onions (2 medium onions if “pearl” onions aren’t available)",
    "6 carrots, peeled and cut into rounds, ⅛-inch thick",
    "2 cups diced potatoes",
    "1 cup frozen corn kernels",
    "2 whole celery stalks, cut into half-rounds, ⅛-inch thick",
    "½ cup cold water",
    "2 tablespoons corn starch"
  ],
  "instructions": [
    "Over medium-high heat and in a large Dutch oven, or other heavy pot, melt the vegetable shortening and when hot, but not smoking, thoroughly brown the stew meat on all sides.  Don’t crowd the meat in the and, if necessary, brown the stew meat in batches.  It’s important that the stew meat caramelize when browning so don’t rush this step.  If you are browning in batches then remove the pieces to a plate as they become done before adding more.  When all the meat has been browned add the medium size onion pieces and deglaze the pan with the moisture being released by the onion.  After the onion becomes translucent return the meat to the pan (don’t forget to pour in any juices that has been released by the meat), add the wine, balsamic vinegar, Worcestershire sauce, garlic clove, bay leafs, salt, sugar, black pepper, sweet paprika, and a dash of cloves.  Reduce the heat to low, and cover and simmer, stirring occasionally, for 2 hours.  Keep the heat set where the stew is simmering not boiling (you want to slow cook the mixture).",
    "After simmering for 2 hours, remove the bay leafs and garlic clove.  Add all your vegetables and stir to mix.  If necessary, you may add boiling water, to insure that all the vegetables are covered by liquid.  Again, cover and cook at a medium-low heat until the mixture returns to a boil.  Lower the heat again to low and cook, stirring occasionally, for 1 hour, or until the carrots and potatoes are thoroughly cooked.",
    "Skim off any fat from the stew liquid.  Place ½ cup cold water into a glass jar and add 2 tablespoons corn starch to the water.  Screw the top back on the jar and shake vigorously to mix.  Add the corn starch mixture to the stew slowly, stirring constantly, and cook for 5 more minutes, or until the stew gravy has thickened to your desired consistency.",
    "Remarks:  The source of the basic recipe is cited below.  However, this is one of the three basic dishes that I used to make on weekends when I was living on my own.  I have changed it considerably from the original and thus it reflects basically my own version of stew.  During the week days I simply heated up a portion of the stew in the evenings for myself.  With cornbread, it was an excellent and healthy element of my “bachelor days” diet; and a timesaver when one doesn’t wish to spend too much time cooking during work days.  Incidentally, the stew tastes better after it has been in the refrigerator overnight.",
    "Yield:  Makes 8 to 12 servings.",
    "Source:  Adapted from a recipe in Better Homes & Gardens Meat Cook Book, By the Editors of Better Homes and Gardens, © Meredith Publishing Co., 1960."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}