{
  "title": "Oven Cooked Chicken, Pit-Barbecue Style (Pollo Pibil)",
  "requires": "",
  "ingredients": [
    "2 chickens, 3½ to 4 pounds each, quartered and skin removed",
    "6 heaping tablespoons “achiote” paste",
    "2 teaspoons salt",
    "½ cup Seville orange juice; or, mixed lime and orange juice",
    "1 tablespoon vegetable oil",
    "2 large or 3 medium banana leaves, their nonpliable center ribs removed",
    "2 white onions, slice",
    "3 tomatoes, sliced",
    "3 large “epazote” sprigs",
    "1 habanero chile; or, 6 serrano chiles for the spice (but the result will be different)"
  ],
  "instructions": [
    "Quarter the chicken down the spine; then remove and discard the skin and excess fat.  Clean the chicken quarters under cold running water and pat dry them using paper towels; set them aside for later use.  (Alternatively, buy chicken breasts, thighs, and legs.  Remove the skin and excess fat then clean under cold running water.  Pat dry the pieces and set them aside for later use.)",
    "Combine the achiote paste, salt, the Seville orange juice (or, orange/lime juice), and the oil.  Stir to mix the ingredients then spread the mixture over the chicken.  Set the chicken aside as you continue working but reserve any of the achiote mixture, if any remains.",
    "Line a large baking pan, with a lid, or Dutch oven with banana leaves.  (Try to have two layers of banana leaves on the bottom and allow the leaves to come up the sides of baking pan or Dutch oven, over-hanging the sides of the pan.)  Place the chicken pieces over the banana leaves in one layer.  However, if you have too many chicken pieces that they will have to be double layered, then overlay the bottom layer of chicken pieces with additional banana leaves.",
    "Spread the sliced onion and tomato over the chicken.  Divide the epazote over the chicken and nestle a whole habanero chile in the center of the pot to be removed at the end of cooking.  (Remember, however, that if you are going with two layers of chicken pieces to spread some of the sliced onion, tomato, and epazote on the bottom layer before covering the bottom layer with additional banana leaves.  Additionally, if you had leftover achiote mixture divide it over the chicken pieces as you did the onion, tomato, and epazote.)",
    "Finally, use banana leaves to cover the top layer of chicken pieces; then, fold the banana leaves you left over-hanging the pan sides, over the top layer of banana leaves in the pan.  Tuck the banana leaves as securely as possible to create a “sealed package,” enclosing all of the chicken (and sealing in all the flavors).",
    "Cover the pot tightly and place it in a preheated oven at 350º F.  Bake the chicken for 1½ hours.",
    "Remove the pot from the oven and allow it to rest for 15 minutes.  Open the pot and carefully unwrap the banana leave.  Transfer the chicken to a serving platter; then arrange the onions and tomato around and on the chicken, and bring to the table."
  ],
  "remarks": "The recipe didn’t mention what should be done with the chicken juices.  I suggest adding the chicken juices to the serving platter for anyone to spoon some onto their plate.  Alternatively, you may wish to thicken the chicken juices with a roué; or, with cornstarch dissolved in cold water before serving at table. Serve with rice, a good hot sauce, tortillas, and “cebolla curtida” (marinated red onion). Yield:  Serves 8. Source:  A Cook’s Tour of Mexico by Nancy Zaslavsky, published by St. Martin’s Press, New York, New York, © 1995 by Nancy Zaslavsky.",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}