{
  "title": "Oven Barbecued Spareribs",
  "requires": "The recipe calls for using Chinese-Style barbecue sauce.  The recipe for Chinese-Style barbecue sauce is in the “Sauces, Stocks, and Dressings” folder.",
  "ingredients": [
    "12 pounds country-style spareribs",
    "Chinese-Style Barbecue Sauce"
  ],
  "instructions": [
    "Trim any excess fat from the country-style spareribs, leaving the ribs attached.  Blanch them, in batches, in a large kettle of simmering water for 30 minutes.  Remove them and let them drain.  When all of the ribs are blanched and drained arrange the ribs, meaty side up in 2 baking pans large enough to hold them all in one layer.  Bake them in a preheated moderately hot oven (375° F.) for 20 minutes.",
    "Remove them from the oven and baste the ribs lightly, on both sides, with the Chinese-style barbecue sauce.  Reduce the oven heat to 350° F., leave the ribs with meaty side down and bake them for 20 minutes.  Remove them from the oven once again and baste them generously with the sauce, turn them meaty side down, and bake them for another 20 minutes.  Remove them from the oven.  When you can handle them safely transfer them to a cutting board to cut them by running a knife between the ribs and separating them all into individual ribs.",
    "Return them to the baking pan, baste them again, and arrange them meaty side up in the pan. Return them to the oven to bake for a final 20 minutes.",
    "Arrange the ribs on a large platter and serve."
  ],
  "remarks": "The ribs may be made several days ahead and refrigerated.  Reheat them in a preheated moderate oven (350° F.), turning them once, for 30 minutes, or until they are heated through. The recipe may easily be adapted to lesser quantities of ribs.  The process of making them is the same regardless of how many pounds of ribs you are making. Yield:  Serves 8. Source:  Cuisine Courante:  A Bachelor Dinner, Gourmet Magazine, June 1981. Oven barbecued spareribs",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}