{
  "title": "Bass or Snapper",
  "requires": "",
  "ingredients": [
    "1 (2½- to 3-pound) whole red snapper or sea bass; or, 2 pounds firm-textured fish fillets",
    "The juice of ½ lemon",
    "Sea salt and freshly ground black pepper",
    "About ¼ cup extra-virgin olive oil",
    "2 medium onions, halved and thinly sliced",
    "2 celery stalks, coarsely chopped",
    "2 garlic cloves, finely chopped",
    "½ cup flat-leaf parsley, finely minced",
    "2 teaspoons dried Greek (or Sicilian) oregano",
    "½ cup dry white wine",
    "4 medium, ripe tomatoes, peeled, juiced and coarsely chopped; or, 5 or 6 canned tomatoes",
    "drained and coarsely chopped",
    "½ cup dried bread crumbs"
  ],
  "instructions": [
    "Rinse the fish (or the fillets) and pat them dry with paper towels.  Set the fish on a rack and sprinkle both sides, inside and out (if a whole fish) with the lemon juice; then salt and pepper.  Set aside for an hour of so.",
    "Meanwhile, heat 2 tablespoons of the olive oil in a skillet set over medium-low heat.  When the olive oil is hot add the onion and celery and sauté until both are very soft and “almost melting,” about 20 minutes or more.  At this point stir in half the garlic and half of the parsley; stir to mix well and remove from the heat source.  Stir in the oregano and white wine and set the mixture aside to cool.",
    "Preheat the oven to 350° F.",
    "Pour in as spread a little olive oil into a baking dish large enough to hold the fish, or fish fillets, in one layer.  When the onion and celery mixture has cooled (It’s ok if it’s slightly warm!) spoon it over and around the fish, or fillets; making sure that the top of the fish or the fillets are covered with the mixture.  Distribute the tomatoes over everything then add a little more black pepper.  Combine the remaining garlic and parsley with the bread crumbs and sprinkle this over the tomatoes.  Lastly, dribble the remaining 2 tablespoons of olive oil over the top and place the baking dish on the middle rack of the preheated oven.",
    "Bake for 20 minutes; or, until the fish is tender and cooked through.  You should note that fish fillets will take less time to bake than a whole fish.",
    "Serve immediately.  Or, if you wish to stick with the Mediterranean style let the fish stand in the baking dish until it’s almost at room temperature then serve."
  ],
  "remarks": "According to the author [Nancy Harmon Jenkins] this recipe is best with a whole fish.  If you can’t find Greek or Sicilian oregano, with it lemony aroma, a good substitute is a “good size” pinch of fragrant dried thyme.",
  "yield": "Serves 4 to 6.",
  "source": "The Essentials Mediterranean by Nancy Harmon Jenkins, Harper Collins Publishers, Inc., , ©2003 by Nancy Harmon Jenkins.",
  "category": "06 - Main Meals"
}