{
  "title": "Oven Fried Cornmeal Chicken Wings",
  "requires": "",
  "ingredients": [
    "⅓ cup fresh lime juice",
    "⅓ cup vegetable oil",
    "1½ teaspoon  sauce",
    "¾ teaspoon cayenne",
    "¾ teaspoon dried oregano",
    "¾ teaspoon ground cumin",
    "3 garlic cloves, minced",
    "½ medium size onion, minced",
    "18 chicken wings (about 3 pounds) wing tips cut off and reserved for another use",
    "1 cup yellow cornmeal",
    "½ cup (2½ ounces) finely grated dry Asiago or Parmesan cheese",
    "½ teaspoon paprika",
    "½ teaspoon salt",
    "¼ teaspoon freshly grated black pepper",
    "1 tablespoon minced fresh parsley leaves",
    "An egg wash (beat 2 large eggs with 2 tablespoons cold water and 2 tablespoons fresh lemon",
    "Juice)",
    "2 tablespoons unsalted butter, melted"
  ],
  "instructions": [
    "Clean and trim off excess fat from the chicken wings then cut off the wing tips and pat them dry with paper towels.",
    "In a large bowl mix the marinade by whisking together the lime juice, the oil, the , the cayenne, the oregano, the cumin, the garlic, and the onion.  Add the cleaned chicken wings, stir to coat them with the marinade, and let them marinate, covered and chilled, stirring occasionally, for at least 3 hours but preferably overnight.  (Alternatively, mix the marinade in a 2-gallon plastic bag, add the chicken wings and seal, removing as much of the free air as possible.  Massage the plastic bag contents to spread and coat the chicken wings with the marinade.  Place in the refrigerator and allow the chicken wing to marinade for 3 hours; or, preferably overnight.  While the wing are marinating periodically massage and turn the plastic bag over.)",
    "When read to proceed combine the cornmeal, the Asiago or Parmesan, the paprika, the salt, the black pepper, and the parsley in a large bowl.  Remove the chicken wings from the marinade with a slotted spoon, letting the excess marinade drip off, dip them in the egg wash, and coat them with the cornmeal mixture.  Shake off the excess cornmeal and arrange the chicken wings in one layer on a rack and let them dry for at least 30 minutes.",
    "Preheat the oven to 425º F.",
    "After the chicken wings have dried off at least 30 minutes arrange them, skin side up, in a single layer, on lightly oiled jelly-roll pans.  Don’t crowd them!  Drizzle them with the melted butter and bake them for 35 minutes; or, until they are “crisp and golden”.  Transfer the wings to paper towels to drain.",
    "Serve the wings warm or at room temperature.",
    "Yield:  Serves 6.",
    "Source:  Cuisine Courante:  An Ice-Skating Party, Gourmet Magazine, January 1989.",
    "Oven-Fried cornmeal chicken wings"
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}