{
  "title": "Pan Caramelized Pork Chops with Garlic",
  "requires": "",
  "ingredients": [
    "4 (6-to-8 once) thick pork chops",
    "Coarse salt, to taste",
    "Freshly ground pepper, to taste",
    "2 tablespoons extra-virgin olive oil",
    "8 to 10 large cloves of garlic, thinly sliced",
    "2 cups dry white wine",
    "2 tablespoons unsalted butter"
  ],
  "instructions": [
    "Season the pork chops with the salt and pepper according to your preferences.  Place a large skillet over medium heat and allow it to heat before adding the olive oil.  When the oil heats up and is barely smoking add the thinly sliced garlic and sauté it until its golden brown.  Use slotted spoon to transfer garlic to a small bowl and set it aside.",
    "Increase the heat to medium-high.  Again, when the skillet comes to the point where the remaining oil is barely smoking place the pork chops in the hot skillet.  Cover and cook the pork chops for 10 to 15 minutes per side.  The exterior of the pork chops should be caramelized and golden brown before you turn them.  (If the skillet starts to smoke, add a tablespoon or so of the white wine and continue sautéing.)  When the pork chops are done transfer them to a plate and cover them loosely with aluminum foil.",
    "Add all of the remaining wine to the skillet and deglaze the skillet; dissolving the solids that might be stuck to the skillet bottom and sides.  Increase the heat to high and allow the liquid to boil vigorously, stirring constantly, until it has reduced by half.  Reduce the heat to low and add the butter to the skillet, stirring until the butter has melted and has been incorporated into the sauce.  Turn off the heat.",
    "Serve by placing a pork chop on each plate.  Garnish each pork chop by heaping caramelized garlic on each and spooning the sauce over each."
  ],
  "remarks": "",
  "yield": "Serves 4.",
  "source": "Spirited Cooking, Fruity Reds and Whites Compliment Pork, Dining Section,  Express-News, Wednesday, February 14, 2007.",
  "category": "06 - Main Meals"
}