{
  "title": "Pesto Meat Loaf",
  "requires": "",
  "ingredients": [
    "For the Pesto –",
    "2 garlic cloves",
    "⅓ cup olive or vegetable oil",
    "1 cup fresh basil leaves",
    "¾ cup cooked long grain white rice",
    "¼ cup chopped walnuts; or, pecans",
    "¼ cup shredded cheddar cheese",
    "¼ teaspoon salt",
    "For the Meatloaf –",
    "½ cup quick-cooking oats",
    "½ cup finely chopped green onions",
    "1 egg, beaten",
    "¼ cup chili salsa",
    "2 garlic cloves, minced",
    "½ teaspoon salt",
    "2 pounds lean ground beef"
  ],
  "instructions": [
    "Place the pesto ingredients, in the order listed, in a food processor or blender; cover and process at low speed until a paste forms.  (It might be necessary, if you are using a blender, to scrape down the mixture off the sides of the container several times, to insure that the mixture is well blended.)",
    "In a mixing bowl combine the meatloaf ingredients (less the ground beef) with the pesto and mix everything well before adding the ground beef.  Mix everything well by hand then press the meatloaf mixture into a greased 9-inch by 5-inch by 3-inch meatloaf pan.",
    "Bake at 350º F. for 50 to 60 minutes; or, until there is no pink remaining in the meat.  Remove the meatloaf from the oven and drain off all the remaining fat.  Let the meatloaf stand for 10 minutes before slicing and serving.",
    "Remarks:  I like to make a mixture of a half to ¾-cup of ketchup, a tablespoon of Worchester sauce, and ¼ cup of diced onion while the meat loaf is cooking.  After an hour I pull the meatloaf out of the oven, drain off as much of the grease as I can, then spread the ketchup mixture over the meatloaf.  I then return the meatloaf to the oven for 10 more minutes.  The ketchup adds a delicious coating to meatloaf and makes a better presentation of the meatloaf.",
    "Yield:  Serves 4.",
    "Source:  A Taste of the Country, recipe by Margaret Pache, , Country Magazine, August/September, 1997.",
    "Pesto meat loaf"
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}