{
  "title": "Pork Picadillo Stuffed Chiles in Tomato Broth (Chiles Rellenos de Picadillo en Caldillo de Jitomate)",
  "requires": "",
  "ingredients": [
    "3 tablespoons pork lard or vegetable oil",
    "2 medium white onions, chopped into ¼-inch pieces",
    "Two 28-ounce cans whole tomatoes in juice, undrained; or,",
    "3 pounds (approximately 6 medium-large round or 20 plum) ripe tomatoes, peeled,",
    "and cut into large pieces",
    "1 teaspoon cinnamon, preferably freshly ground Mexican canela",
    "1 teaspoon black pepper, preferably fresh ground",
    "2 cups chicken stock or beef broth",
    "½ cup slivered almonds",
    "1½ pounds coarsely ground pork shoulder (look for “chili grind” or special order it",
    "from the butcher)",
    "½ cup raisins",
    "1 tablespoon cider vinegar",
    "Salt",
    "Vegetable oil to a depth of 1 inch for whatever frying pan you use",
    "8 medium (approximately 1½ pounds total) fresh poblano chiles (look for some that",
    "are not twisted, aren’t deeply indented, and still have long stems attached)",
    "Eight 6-inch wooden skewers or 16 toothpicks",
    "6 large eggs, cold",
    "2 tablespoons all-purpose flour, plus about 1 cup for dredging the chiles",
    "Sprigs of fresh cilantro or parsley for garnish"
  ],
  "instructions": [
    "In a medium-large (4-quarts) saucepan, heat the lard or oil over medium heat.  Add the onions and cook, stirring regularly, until they are very well browned, about 10 minutes.  While the onions are cooking, puree the undrained canned tomatoes.  (If you are using fresh tomatoes blanch and peel them, cut and puree them with ⅔-cup of water.  Work in two batches if necessary and do it before you begin browning the onions.)  When the onions are well browned, raise the heat to medium-high and add the pureed tomatoes, cinnamon and pepper.  Stir regularly as the mixture boils briskly, reducing it until becomes the consistency of thick tomato sauce, about 25 minutes.",
    "Remove 2 cups of the tomato mixture and set aside.  Stir the chicken broth into the mixture that remains.  Partially cover and simmer over low heat for 45 minutes or so, while your preparing the filling and chiles.",
    "Set a large (12-inch) skillet (preferably nonstick) over medium-high heat.  Add the almonds and stir around until they color to a deep golden, about 2 minutes.  Remove them onto a paper towel set in a bowl.  Crumble the pork into the skillet and fry, stirring often, until thoroughly cooked (some of the edges should be browned and crispy), 10 to 15 minutes.  If the pork has rendered a lot of fat, drain it off.  Stir in the reserve 2 cups tomato mixture, the raisins and vinegar.  Cook over medium heat, stirring regularly, until the mixture is very thick and homogeneous, about 20 minutes.  Stir in the almonds, then taste and season with salt, usually about 1 teaspoon.  Allow the mixture to cool.",
    "Select a deep heavy skillet or pot and pour 1-inch of oil into it (the pot should be at least 12-inches wide and 3 to 4-inches deep for easiest maneuvering of the chiles).  Set over medium-high heat and heat the oil to 350° F.  (Using a thermometer is the most accurate way to assure the proper heat, but there are other reliable clues:  The oil releases that “hot oil” aroma and its surface begins to shimmer.  When you think the oil is hot, test the edge of a chile – it should sizzle vigorously.  However, remember – smoking oil is dangerously overheated and will give the chiles a bad taste.)  In two batches, fry the chiles, turning them continually, for about 1 minute, until they are evenly blistered.  (They will look uniformly light green, having lightened as they blister.)  Drain them on paper towel and when finished remove the oil from the heat.",
    "When the chiles are cool enough to handle, rub off the blistered skins, then cut an incision in the side of each one, starting ½-inch below the stem end and continuing to within ½-inch of the tip.  One by one, work you index finger inside each chile and dislodge all the seeds clustered just below the stem.  Quickly rinse the seeds from the insides of the chiles, being careful not to rip or teat the opening any wider; rinse off any stray bits of skin at the same time.  Place the finished chiles on paper towels to drain, cut side down.",
    "When the chiles are well drained, pat them dry and set aside to fill them.  Stuff each chile with about ½-cup of the cooled pork filling, then slightly overlap the two sides of the incision and pin them back together with a long skewer or using two toothpicks.  For the greatest ease in battering and frying them, flatten and shape the chiles slightly with your hands then place each one on a parchment-lined baking sheet and freeze for about 1-hour to firm them up.",
    "Reheat the oil to 350° F.; set up a tray lined with several layers of paper towels.  Separate the eggs:  whites into the bowl of an electric mixer, the yolks into a small bowl.  Add ½ teaspoon salt to the whites and begin beating them on medium speed.  When they are beginning to look dry and hold a stiff peak but are not at all rigid, beat in the yolks two at a time until well incorporated.  Lastly, beat in the 2 tablespoons flour.  On a separate plate spread the 1 cup flour on a plate.",
    "One at a time, batter the first four chiles.  Roll in the flour, shake off the excess, pick up by the stem, dip into the batter and quickly pull straight up out of the batter, then lay into the hot oil.  (If you kitchen is very warm, it’s best to hold the remaining batter for the second round in the refrigerator.)  Once the first four chiles are in the oil, begin gently, very gently, basting them with spoonfuls of hot oil (this will help set the uncooked batter on top).  When they are richly golden on the bottom, about 4 minutes, use one small metal spatula underneath and another one (or a spoon) on top to gently turn the chiles over.  Fry until the other side is richly golden, another 3 to 4 minutes.  Using the metal spatula, remove the chiles to the paper towels to drain.  Repeat this with the remaining chiles.",
    "Heat the oven to 400° F.  Once all the fried chiles have cooled for at least 5 minutes, pick them up carefully rolling each one onto one’s hand, then transfer it to a baking sheet that has been lined with parchment (the parchment will make it easier at serving time).  Pull out each skewer or toothpick carefully by twisting each skewer or toothpick gently until they pull free.  Bake for 15 minutes to heat thoroughly, to render some of the absorbed oil and to crisp them slightly.",
    "Bring the tomato broth to a boil and check the consistency.  It should be similar to a brothy tomato soup.  If it’s too thick, thin with a little water or broth; if too thin, boil rapidly until thickened slightly.  Season it with salt, usually about ½-teaspoon.",
    "To serve, ladle about ½-cup of the broth into each serving bowl (use large soup bowls or pasta bowls).  Nestle into each bowl one of the chiles and garnish with a sprig of cilantro or parsley."
  ],
  "remarks": "Like mole this dish is best done over a period of more than one day in logical steps.  I would suggest that making the tomato broth/sauce and filling be done first and stored in the refrigerator, covered.  Secondly, one day in advance of the day you plan to serve the “chiles rellenos” the chiles can be blistered, peeled, and seeded.  This day I would also make the picadillo, and stuff the chiles and skewer them.  I would then freeze the stuffed chiles to make them easier to handle the next day.  On the day you are going to serve them I would pull the chiles from the freezer a full half hour to an hour in advance of battering them.  While they are thawing prepare the batter.  Battered and fried the chiles will hold for an hour or two at room temperature before reheating them in a 400° F. oven.  However, be sure to complete the frying a full half hour in advance of oven reheating to allow for full defrosting of the picadillo inside the chiles.  While oven reheating the chiles, warm the broth and you’re ready to serve when they come out of the oven. The chiles rellenos actually benefit from being completed ahead and then heated in a hot oven.  This heating renders out some of the oil they absorbed during frying. Yield:  Serves 8.  (Usually, one chile per person is served; serve the larger chiles for the males in the group but if you have hefty eaters 8 chiles may serve fewer than 8.) Source:  Mexico One Plate at a Time by Rick Bayless, Scribner, 1230 Avenue of the Americas, New York, NY 10020, ©2000 by Rick Bayless.",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}