{
  "title": "Pork Ribs in a Spicy Tomato Sauce (Salsa de Costillas de Puerco)",
  "requires": "",
  "ingredients": [
    "Pork Stock Seasoning Ingredients -",
    "1 medium white onion, thickly sliced",
    "1 head of garlic",
    "1 carrot, peeled and thickly sliced",
    "3 celery ribs, with leaves",
    "1 bay leaf",
    "1 whole allspice",
    "1 chile de árbol",
    "5 black peppercorns",
    "salt to taste",
    "Main Ingredients –",
    "3 pounds of baby-back pork ribs, cut into 2-inch sections",
    "2 teaspoons salt, or to taste",
    "4 pounds tomatoes (8 medium-large round or 32 to 40 small plum)",
    "8 to 10 chiles jalapeños",
    "7 garlic cloves",
    "3 tablespoons vegetable oil",
    "1 cup cilantro leaves, chopped"
  ],
  "instructions": [
    "Cooking the meat –",
    "In a heavy 4-quart stockpot, bring 7 cups of water and the seasoning ingredients, listed above, to a boil.  Add the onion, garlic, carrot, celery, bay leaf, allspice, chile de árbol, and peppercorns.  Boil for 15 minutes, then add the pork and let the mixture return to a boil.  Skim off any foam, cover, lower the heat to a simmer, and simmer for 45 minutes.  At the end of the 45 minutes add the salt and remove the pork ribs and set them aside.  Turn the heat to high and continue to reduce the stock for another 30 minutes.  Turn off the heat and set the stock aside.",
    "Making the Salsa –",
    "On a 10-inch dry comal, griddle, or in a cast-iron frying pan, roast the tomatoes over medium, to high, heat until they are soft, approximately 10 to 12 minutes.  Set the tomatoes aside and similarly roast the chiles until they are soft and lightly charred on the outside.  Scrape off the charred skin from the chiles.",
    "Place the tomatoes, chiles, and garlic in a blender with 1 cup of the reserved stock.  Blend until smooth then pass the mixture through a sieve to remove the tomato skin and seeds.",
    "Heat the oil in a heavy 6-quart stockpot or cazuela, and brown the pork ribs for about 10 minutes over medium-high heat.  Remove the ribs and set aside.  Remove the pot from the heat and spoon out the extra oil and grease, leaving about 1 tablespoon in the pot and return to the heat.  Add the tomato mixture to the hot pot and cook the tomato mixture for about 5 to 10 minutes, stirring constantly.  Add 2 to 3 cups of the pork stock and cover, letting the sauce simmer for ½ hour.",
    "Return the ribs to the sauce and let them cook for 10 minutes longer.  Just before you",
    "remove the ribs from the fire add the cilantro and adjust the seasoning before bring them to the table.",
    "Remarks:  You may wish to temper the spiciness by not using as many jalapeños as the recipe calls for.  Any leftover pork stock can be used in making some rice.",
    "Yield:  Serves 6 to 8 persons.",
    "Source:  Seasons of My Heart, A Culinary Journey Through Oaxaca, Mexico by Susana Trilling, published by The Ballantine Publishing Group, © 1999 by Susana Trilling."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}