{
  "title": "Pork Roast with Apricots",
  "requires": "",
  "ingredients": [
    "1 pound dried apricots",
    "Dry White Wine (enough to soak the apricots in)",
    "2 tablespoons butter",
    "1 tablespoon oil",
    "1 pork loin, about 5 pounds",
    "1 garlic clove, sliced",
    "½ cup minced onion",
    "Salt and pepper, to taste",
    "Bouquet garni made of (parsley, bay leaves, thyme, and 3 whole cloves) tied in cheesecloth",
    "2 teaspoons graded fresh ginger; or, ¼ teaspoon powdered ginger",
    "1 cup chicken broth",
    "Hollowed out orange halves"
  ],
  "instructions": [
    "Place the dried apricots in a sauce pan and add wine, enough to cover them.  (You can also use water instead of wine but the acidity of the wine is preferable.)  Bring the mixture to a boil then remove the sauce pan from the heat and allow it to stand until the individual apricots have plumped up.  This will take several hours so you might wish to do this ahead and allow the apricots to plump up, covered, in the refrigerator over night.",
    "Preheat the oven to 375° F.",
    "Rub the roast with the garlic.  In a heatproof casserole pan, melt the butter and add the oil over medium-high heat.  When the butter/oil mixture is just starting to smoke place the roast in the pan and brown it on all sides.  Remove it from the heat and place it on a plate for the moment.",
    "Lower the heat level to low and add the chopped onion to the casserole pan; sauté the onion over low heat until it’s limp and translucent but not browned.",
    "Return the pork roast to the casserole and add salt and pepper, to taste; the bouquet garni, the ginger, broth and the wine, in which the apricots were marinated.  If the residual wine is less than a cup add as much as necessary to bring the measure up to one full cup.  Cover the casserole and bake it for 2 hours; or, until the internal temperature measures 175° F on a meat thermometer.",
    "Place the pork roast on a heated platter and arrange the plumped apricots in orange halves around the pork roast; interspersing them with sprigs of fresh watercress or parsley.",
    "Degrease the sauce remaining in the casserole pan and place it back on the heat source.  Cook the sauce until the degreased sauce can be thickened by using arrowroot mixed with water; or, corn starch dissolved in cold wine or water.  Season the sauce to taste and pour it as a sauce boat to serve with the pork roast.",
    "Yield:  Serves 6.",
    "Source:  The Winning Combination is Meats with Fruit by Jinx Morgan, Bon Appétit, October 1977.",
    "Pork Roast with Apricots"
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}