{
  "title": "Pot Roast by Jacques Pepin",
  "requires": "",
  "ingredients": [
    "One 5-pound beef bottom round roast",
    "1½ teaspoons kosher salt; or, 1 teaspoon regular salt (more if needed for your taste)",
    "1 teaspoon freshly ground black pepper (more if needed for your taste)",
    "2 to 3 tablespoons of canola or other vegetable oil",
    "2 cups chopped onion, 1-inch pieces (about 8 ounces all total)",
    "1 large tomato, cored and chopped into 1-inch pieces (about 1½ cups all total)",
    "2 bay leaves, preferably imported",
    "6 sprigs fresh thyme or 1 teaspoon dried",
    "1½ cups white wine (more if needed for your taste)",
    "½ cup water",
    "1½ to 2 pounds of potatoes, peeled and sliced into large wedges",
    "1 pound small white onions, about 20 all total, blanched and peeled",
    "1 pound baby carrots",
    "1 cup green peas, fresh or frozen",
    "1 tablespoon fresh parsley for a garnish"
  ],
  "instructions": [
    "Preheat the oven to 300° F.",
    "Season the roast on all sides with 1 to 1½ teaspoons salt and 1 teaspoon black pepper.  Set a casserole dish over high heat and add 2 to 3 tablespoons of oil; just enough to film the bottom.  When the oil is hot, but not quite smoking, lay in the roast and sear it for about 3 minutes, until the first side is well browned.  Then turn the roast onto another side and sear it for several minutes, continue turning the roast and searing, over medium to high heat, until the entire piece is browned and meat juices have crusted in the pan, about15 minutes in all (if you have experience).  If there is excess oil in the bottom of the pot, pour it out carefully and discard it.",
    "After you have removed any excess oil, arrange the roast in the center of the pot and around it arrange the onion and tomato pieces, the bay leaves and thyme and then pour in the wine and water.  Bring the liquid to a boil, cover the casserole, and set it in the oven for 3 to 4 hours, until the meat is tender.",
    "Remove the casserole form the oven.  Hold the lid ajar to keep the meat in the pot, and if you want, pout the braising liquid through a strainer to remove the cooked vegetable pieces and herbs.  Press the juices from the vegetables then return the strained liquid to the pot.",
    "Arrange the potato wedges, onions, and baby carrots around the roast and season with ½ teaspoon salt.  Bring the liquid to a boil, and put the casserole, covered, back in the 300° F. oven for 1 to 1½ hours more, until the meat is fork tender and the vegetables are very soft but still holding their shape.",
    "Remove the roast from the oven and set it on the stovetop, over low heat and add the green peas to the pot.  Cover and simmer for 2 to 3 minutes, just until the peas are tender.  Lift out the meat and set it on the serving platter.",
    "Taste the sauce and adjust the seasonings.  It can be served as is, or, for a thicker consistency, stir together a tablespoon of cornstarch with a teaspoon of white wine in a small dish.  Stir to dissolve the cornstarch, and pour a bit at a time into the hot sauce, stirring constantly.  It will thicken quickly so stir in only as much as is needed to reach the proper consistency.",
    "Cut ¼-inch slices from the roast, enough for the first serving, and lay them overlapping on a platter and set the rest of the roast (uncut) on the platter too if you have room.  Spoon the vegetables all around the sliced meat and moisten all with the sauce.  Sprinkle the chopped parsley over and bring the platter to the table."
  ],
  "remarks": "I have substituted potatoes in lieu of turnips in Jacques Pepin’s recipe",
  "yield": "Serves 10.",
  "source": "Julia and Jacques Cooking at Home by Julia Child and Jacques Pepin, published by Alfred A. Knopf, Inc., © 1999 by A La Carte Communications.",
  "category": "06 - Main Meals"
}