{
  "title": "Potato and Chorizo Taco and Empanada Filling",
  "requires": "",
  "ingredients": [
    "1 pound chorizo",
    "1 pound onion, chopped",
    "2 medium sized potatoes",
    "3 tablespoons vegetable oil",
    "3 tablespoons chopped fresh cilantro"
  ],
  "instructions": [
    "Clean and cook the potatoes ahead until they are just done (don’t over cook them).  Drain them; peel them when they can be handled and then allow them to cool completely.",
    "When ready to begin remove the chorizo from its skins and fry it in a skillet.  Cook it, and as you do so, break it up.  When the chorizo is cooked and fully broken up, ground beef style, use the spatula to push all of the chorizo to one side of the frying pan.  Tilt the skillet so that the oils will drain away from the chorizo.  Using the spatula to press the chorizo, forcing it to release as much of its oil as possible.  Spoon out all the accumulated oils and leave the skillet tilted, to continue draining, while you cut up the potatoes.",
    "Cut the potatoes into ½-inch cubes.",
    "Return to the chorizo, and spoon out any additional accumulated oil.  Using paper towels press the chorizo with paper towels to absorb as much of the oils as possible.  Remove the chorizo from the skillet onto clean paper towels folded on a suitable size bowl or plate.  Place the skillet to medium heat and add the vegetable oil.  Bring the oil up to heat and add the cubed potatoes to the skillet.  Fry the potatoes, stirring and mixing vigorously, to keep them from sticking.  (It’s best if you can use a non-stick frying pan.  If you aren’t using one then make sure that you work at keeping the potatoes from sticking; and you may also have to add more oil to the skillet.)",
    "When the potatoes are about halfway browned, add the chopped onion to the skillet and continue frying.  By the time the potatoes are fully browned the onion will also be translucent and cooked.  Lastly, return the chorizo to the skillet and continue stirring and mixing until the chorizo is brought back up to serving temperature.",
    "Bring the potato and chorizo to the table with hot tortillas.  Offer hot sauce and chopped fresh cilantro as side items for adding to the tacos."
  ],
  "remarks": "The potato and chorizo mixture can be used as a taco filling or as a filling for empanadas.",
  "yield": "Serves 6.",
  "source": "Unknown.  A potato and chorizo mixture like this is so common that attribution is just not possible.",
  "category": "06 - Main Meals"
}