{
  "title": "Poularde de Bresse a la Créme Façon Mère Blanc (Chicken in Cream Sauce)",
  "requires": "",
  "ingredients": [
    "6 chicken breasts, boned and skinned",
    "3 tablespoons of clarified butter",
    "1 medium size onion, chopped",
    "3 tablespoons flour",
    "⅛ teaspoon pepper",
    "4 cups chicken stock (or two 14½ ounce cans)",
    "1½ teaspoons of crushed tarragon",
    "½ cup whipping cream",
    "salt, pepper, nutmeg and lemon juice"
  ],
  "instructions": [
    "In a heavy skillet brown the chicken pieces a few at a time in the clarified butter.  As the chicken pieces brown, remove the browned pieces from the skillet and let them drain in a dish while you complete browning all the chicken.  In the same skillet add the chopped onion and sauté it until it is softened and translucent.",
    "Return the chicken to the skillet and sprinkle in the flour and ⅛ teaspoon of pepper.  Turn the pieces of chicken to coat them well with the flour and pepper.  Cook the chicken over low heat for about 2 minutes.",
    "Add the chicken stock, the crushed tarragon and bring the liquid to a simmer, stirring occasionally.  Once the stock is simmering cover the skillet and cook for an additional 25 minutes.  After simmering for the 25 minutes remove the chicken pieces to a platter and keep warm.",
    "If necessary, strain the stock into a bowl and skim off any fat.  Return the stock to the skillet and reduce it by half over high heat.  When the stock is reduced add the heavy cream to the stock, stirring constantly.  When well mixed add salt, pepper, nutmeg, and lemon juice to taste.  Once you have the flavors balanced return the chicken to the sauce and let it warm up again if it has cooled off, stirring so that the sauce evenly coats the chicken pieces.",
    "Serve the chicken with the sauce.  Sprinkle minced fresh tarragon (if available) as a garnish."
  ],
  "remarks": "The actual recipe calls for mixing two eggs with the cream and adding the combination.  However, I made this recipe and left off the eggs and the results were excellent.",
  "yield": "Serves six.",
  "source": " Bresse and Beaujolais, Maria Kozslik Donovan, Gourmet Magazine, November 1973.",
  "category": "06 - Main Meals"
}