{
  "title": "Anne’s Pozole",
  "requires": "",
  "ingredients": [
    "2 cups dried hominy",
    "1 pound pig’s feet, cracked",
    "8 cups cold water",
    "⅓ pound ham hock",
    "3 teaspoons Mexican oregano",
    "4 cloves garlic, mashed",
    "2½ teaspoons salt",
    "4 red mild chili pods, stemmed and seeded",
    "2 pounds pork, boned and trimmed",
    "1 teaspoon ground black pepper",
    "2 tablespoons vegetable oil",
    "2 cups chopped onion",
    "1 tablespoon minced garlic",
    "1 teaspoon ground cumin",
    "1 cup water"
  ],
  "instructions": [
    "Rinse the hominy and pig’s feet in warm water.  Place them in a large stockpot with 8 cups of cold tap water and the ham hock and bring to a slow boil.  Lower the heat to low and cook for 15 minutes and skim of the froth.",
    "Rub 2 teaspoons of the oregano in palms of your hands to crumble it into the stock pot.  Add the mashed garlic, 2 teaspoons salt and the chili pods.  Simmer the mixture, covered, for 2 hours.",
    "Cut the pork into 1-inch pieces.  Salt and pepper the pork pieces and brown it in hot oil over medium-high heat.  If you can, use a heavy iron skillet for this as it holds the heat better.  Brown the pork in small batches trying not to crowd the pork in the skillet, and as the pieces are browned remove them to drain on paper towels.  After all the pork has been browned, add the onion and minced garlic to the skillet and sauté for 3 to 4 minutes over medium-low heat before you add the remaining oregano and water.  Simmer the mixture for 10 minutes.",
    "Add the browned pork and the onion mixture to the hominy.  Cook, uncovered, for 1½ to 2 hours, until the hominy has burst and the stew is beginning to thicken slightly.  Add water or chicken stock, as needed, to get the stew to the thickness that you prefer."
  ],
  "remarks": "If you use canned hominy I would rinse it but not add it until after the pig’s feet and ham hock have simmered for 2 hours.  (Until after you’ve added the oregano, garlic, salt, and chili pods to the stockpot.) This particular recipe is compliments of Anne DeBois, at the Texas Governor’s Mansion. Yield:  Serves 6 to 8. Source:   Cowboy Cooking by Tom Perini with Paschal Fowlkes, published by Time/Life Books, , © 2000 Tom Perini.",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}