{
  "title": "Red Chile Pork Tamales (Tamales de Puerco con Chile Rojo)",
  "requires": "",
  "ingredients": [
    "For the filling –",
    "16 medium (about 4 ounces total) dried guajillo chiles, stemmed, seeded and each",
    "one torn into several pieces",
    "4 garlic cloves, peeled and chopped",
    "½ teaspoon black pepper, preferably freshly ground",
    "¼ teaspoon cumin, preferably freshly ground",
    "1½ pounds lean boneless pork, (preferably from the shoulder, cut into ½-inch cubes",
    "Salt",
    "For the batter –",
    "10 ounces (1¼ cups) rich-tasting pork lard (or vegetable shortening if you wish),",
    "slightly softened but not at all runny",
    "1½ teaspoons baking powder",
    "2-pounds (4 cups) fresh coarse-ground corn masa for tamales; or,",
    "3½ cups dried Maseca Harina for tamales mixed with 2¼ cups hot water",
    "1 to 1½ cups chicken broth",
    "Two 1-pound packages of banana leaves, defrosted if frozen"
  ],
  "instructions": [
    "In a blender or food processor, working in batches if necessary, combine the chiles, garlic, pepper and cumin.  Add 3 cups water, cover and blend to a smooth puree.  Strain the mixture through a medium-mesh strainer into a medium (3-quart) saucepan.  Add the meat, 3 cups water and 1-teaspoon salt.  Simmer, uncovered, over medium heat, stirring regularly, until the pork is fork-tender and the liquid in reduced to the consistency of a thick sauce, about 1 hour.  Use a fork to break the pork into small pieces.  Taste and season with additional salt if necessary, then let it all cool to room temperature.",
    "With an electric mixer on medium-high speed, beat in texture, about 1 minute.  Continue beating as you add the masa (fresh or reconstituted) in three additions.  Reduce the speed to medium-low and add 1 cup of the broth.  Continue beating for another minute or so, until a half-teaspoon dollop of the batter floats in a cup of cold water (if it floats, you can be sure the tamales will be tender and light).",
    "Beat in enough additional broth to give the mixture the consistency of soft (not runny) cake batter; it should hold its shape in a spoon.  Taste the batter and season with additional salt if you think its necessary.",
    "For the lightest-textured tamales, refrigerate the batter for an hour or so, then re-beat, adding enough additional broth or water to bring the mixture to the soft consistency it had before.",
    "Unfold the banana leaves and cut off the long hard sides of the leaves (where they were attached to the central vein).  Check for holes or rips, then cut the leaves into unbroken 12-inch segments (you will need 18).  Either steam the segments for 20 minutes to make them soft and pliable, or, one at a time, pass them briefly over an open flame or hot electric burner until soft and glossy.",
    "Steaming 18 leaf-wrapped tamales can be done in batches in a collapsible vegetable steamer set into a large deep saucepan (if you stack the tamales more then two high, they will steam unevenly).  To steam them all at once, you’ll need something like the kettle-size tamal steamers used in Mexico or Asian stack steamers, or you can improvise by setting a wire rack on four  coffee custard cups in a large kettle.  Pour an inch or so of water into the bottom of the steamer and heat to a boil.",
    "It is best to line the rack or upper part of the steamer with leftover scraps of banana leaves to protect the tamales from direct contact with the steam and to add more flavor.  Make sure to leave tiny spaces between the leaves so condensing steam can drain off.",
    "Cut eighteen 12-inch pieces of string or thin strips of banana leaves.  One at a time, form the tamales:  Lay out a square of banana leaf, shiny side up, and spread ⅓ cup of the batter into a 8 by 4-inch rectangle over it (as shown in the illustration below).  Spoon 2 tablespoons of the filling over the left side of the rectangle of batter, then fold over the right third of the leaf so that the batter encloses the filling.  Fold over the uncovered third of the leaf, then fold over the top and bottom.  Loosely tie the tamales with string, or thin strips of banana leaf, and set them in the steamer.",
    "When all the tamales are in the steamer, cover them with a layer of banana leaf scraps or leftover leaves.  Set the lid in place and steam over a constant medium heat for about 1¼ hours.  Watch carefully to make sure that all the water doesn’t boil away and, to keep the steam steady, pour boiling water into the pot when more is necessary.",
    "Tamales are done when the leaves peel away from the masa easily.  Let the tamales stand in the steamer off the heat for a few minutes to firm up.  For the best-textured tamales, let them cool completely, then steam them again for about 15 minutes to heat them through."
  ],
  "remarks": "Both filling and batter can be made several days ahead; refrigerate, well covered. Tamales can be frozen.  Defrost the tamales in the refrigerator overnight before re-steaming, as suggested above, to serve. Yield:  Makes about 18 tamales. Source:  Mexico One Plate at a Time by Rick Bayless, Scribner, 1230 Avenue of the Americas, New York, NY 10020, ©2000 by Rick Bayless. Tamales de Puerco con Chile Rojo",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}