{
  "title": "Riojan Potatoes with Chorizo and  Stew (Patatas con Chorizo a la Riojana)",
  "requires": "",
  "ingredients": [
    "1 large, dried ancho chile, stemmed, seeded, and torn into pieces",
    "3 pounds, Yukon Gold potatoes",
    "2 tablespoons extra-virgin olive oil; but may need more than 2 tablespoons",
    "1 medium-size onion, quartered and sliced",
    "1 small red bell pepper, cored, seeded and thinly sliced",
    "6 to 8 ounces, Spanish-style chorizo sausage, cut into ½ inch thick slices",
    "2 medium-size garlic cloves, chopped",
    "½ teaspoon smoked Spanish paprika; or, ½ teaspoon unsmoked sweet paprika",
    "½ cup white Rioja or another crisp, dry white wine",
    "1 bay leaf",
    "About 2 cups chicken stock; or chicken broth; or water",
    "Coarse salt (kosher or sea) and freshly ground black pepper",
    "Minced fresh parsley, as a garnish"
  ],
  "instructions": [
    "Soak the dried ancho chile in very hot water until it is reconstituted and can be blended, about 30 minutes.  Place the chile pieces in a blender with a ½ cup of its soaking liquid and puree the mixture until it’s smooth.",
    "Cut the potatoes into irregular chunks by inserting the tip of a small, sharp knife into a potato and twisting it until a 1½-inch chunk comes out.  Repeat until the entire potato is cut up, then continue with the remaining potatoes; set the potato chunks aside.",
    "Heat the olive oil in a 4-quart flameproof casserole over medium-low heat.  Add the onion and red and green bell peppers and cook, stirring, for 5 minutes.  Add the chorizo and cook until the vegetables are soft but not browned, another 5 minutes should do if everything is going right; but you may add a little more olive oil if necessary.  Add the potatoes chunks and the garlic and cook, stirring, for 2 to 3 minutes.  Add the paprika and stir for a few seconds.",
    "Add the wine, the bay leaf, the pureed chile, and enough chicken stock to barely cover the potatoes.  Season with salt and black pepper, to taste.  Increase the heat to medium-high and bring to a boil, skimming off any foam from the surface, if necessary.  Cover the casserole, reduce the heat to low, and cook until the potatoes are very tender and some chunks are just beginning to fall apart, about 20 to 30 minutes.",
    "Transfer 2 or 3 chunks of potatoes to a bowl and mash them; then whisk in 2 to 3 tablespoons of the cooking liquid and stir the mixture back into the casserole.  Let the potato stew rest, covered, for 10 minutes.  Remove and discard the bay leaf.",
    "To serve, spoon the potato stew into bowls and sprinkle chopped parsley on each bowl as a garnish."
  ],
  "remarks": "The New Spanish Table by Anya von Bremzen, published by Workman Publishing Co. Inc., New York, www.workman.com, © 2005 by Anya von Bremzen.",
  "yield": "Serves 6.",
  "source": "",
  "category": "06 - Main Meals"
}