{
  "title": "Roasted Moroccan Spiced Chicken",
  "requires": "",
  "ingredients": [
    "1 3½-pound chicken",
    "4 garlic cloves, flattened",
    "1 lemon cut in half",
    "½ teaspoon ground cumin",
    "½ teaspoon ground coriander",
    "½ teaspoon paprika",
    "½ teaspoon freshly ground pepper",
    "½ teaspoon cinnamon",
    "½ teaspoon cayenne pepper",
    "½ teaspoon salt",
    "3 tablespoons olive oil"
  ],
  "instructions": [
    "Wash the chicken under cold running water then pat dry.  Clean out the cavity and cut off any loose fat or excess chicken skin.  Once again rinse the chicken in cold running water then using paper towels pat it dry, both inside and out.",
    "Preheat the oven to 400° F.",
    "Mix all the spices together in a small bowl and set aside.",
    "Smash the garlic with the flat side of a cutting knife, remove and discard the garlic husks.  Rub the chicken all over with the garlic then place the garlic in the chicken cavity.  Squeeze the lemon juices into a small bowl; place the lemon halves inside the chicken cavity using a brush the outside of the chicken with half of the lemon juice.  Rub the chicken, both inside and out, with the mixed spices and tie the chicken legs together with kitchen twine.",
    "Pour the olive oil into a large skillet and heat it over medium high heat.  Once the oil is barely smoking place the chicken in the skillet, breast side up.  Add the remaining half of the lemon juice to the skillet.  Braise the chicken in the skillet, basting it while it’s cooking, with the pan juices.  Continue braising and basting until the spices are cooked into the skin and no longer washing off easily.",
    "Transfer the chicken to a cooking pan and place it in the center rack of the preheated oven.  Bake the chicken until the chicken juices run clear when the thickest part of the thighs are pierced; about 1 hour.  Baste occasionally.",
    "Untie the chicken legs and place it on the cutting board and carve it.  Placed the chicken on a serving plate (garnish if desired) and bring it to the table while hot."
  ],
  "remarks": "The chicken can be served hot, at room temperature, or cold.",
  "yield": "Serves 2",
  "source": " Time Saving Recipes from The Weekday Cook, Bon Appétit, Fast and Easy Favorites, Bon Appétit Publishing Corp, Los Angeles, ©1989 by Bon Appétit Publishing Corp.",
  "category": "06 - Main Meals"
}