{
  "title": "Shields Tavern Chicken and Dumplings",
  "requires": "",
  "ingredients": [
    "For the Chicken –",
    "1 stewing chicken, 4 to 5 pounds",
    "1 small onion, sliced",
    "1 carrot, sliced",
    "2 celery ribs, finely chopped",
    "1 teaspoon salt",
    "For the Sauce –",
    "¼ cup (½ stick) unsalted butter; or, 4 tablespoons of chicken fat",
    "6 tablespoons flour",
    "⅛ teaspoon paprika",
    "½ cup light cream, half-and-half",
    "Freshly ground white pepper; or, to taste",
    "For the Dumplings –",
    "2 cups all-purpose flour",
    "1 tablespoon salt",
    "1 tablespoon baking powder",
    "1 tablespoon vegetable shortening",
    "¾ cup milk"
  ],
  "instructions": [
    "In a large covered soup pot or kettle, place the chicken and add the onion, carrot, celery, and the salt.  Pour in enough water to cover the ingredients, cover and bring everything to a boil over high heat.  Once the pot reaches a moderate boil reduce the heat to medium-low and allow the stock to simmer, partially covered, until the chicken is “very” tender (“falling off the bones” tender); this should take about 1½ to 2 hours.",
    "Remove the chicken from the broth to a plate and allow it to cool and move the pot or kettle off the heat source.  When the chicken has cooled to the point where you can handle it without discomfort proceed to remove all the skin, bones, and gristle and discard.  Cut up the chicken pieces into a “bite size” dice.",
    "Strain the chicken stock and discard the solids (onion, carrot, celery) and remove any floating fat from the stock.  Measure out 4 cups of the stock and reserve any extra for another use; but, if necessary add water to make the necessary 4 cups measure for this recipe.",
    "In a large saucepan, set over medium-high heat, melt the butter and add the 6 tablespoons of flour and the paprika and cook the roué until it reaches a light brown color.  When the roué is a light brown color, increase the heat to high, and add the 4 cups of chicken stock.  Bring the mixture to a boil, stirring frequently.  When the mixture reaches a “boil” reduce the heat to medium-low and cook, stirring, until the sauce has thickened and is smooth; about 10 minutes.  Add the diced chicken, the cream (half-and-half), and the white pepper.  Stir to mix and season with additional salt and pepper to taste.",
    "Reduce the heat to low and cook slowly while you prepare the dumplings.",
    "Into a large bowl sift the flour, salt, and baking powder.  With a pastry blender cut in the vegetable shortening before adding the milk and mixing everything well.",
    "Dip a teaspoon into cold water and then into the dough.  Spoon the dumplings on top of the gently bubbling chicken mixture.  When all the dumplings have been added cover the pot and cook everything for 15 minutes without lifting the lid.",
    "Serve hot."
  ],
  "remarks": "The best way to make this recipe is to make it over a period of two days.  That way the chicken broth can be refrigerated overnight and the fat can then easily be skimmed off and discarded.",
  "yield": "Serves 6.",
  "source": "The Colonial Williamsburg Tavern Cookbook, by The Colonial Williamsburg Foundation, Recipes Developed by John R. Gonzales, Edited by Charles Pierce, Clarkson Potter/Publishers, New York, © 2001 by The Colonial Williamsburg Foundation.",
  "category": "06 - Main Meals"
}