{
  "title": "Shrimp Scampi",
  "requires": "",
  "ingredients": [
    "2 tablespoons extra-virgin olive oil",
    "3 large cloves garlic, minced",
    "2 tablespoons finely chopped shallots",
    "½ cup dry white wine, divided in use",
    "2 tablespoons fresh lemon juice",
    "8 tablespoons unsalted butter, at room temperature",
    "2 teaspoons minced parsley",
    "2 teaspoons minced fresh tarragon",
    "36 (Under10 shrimp per pound size) jumbo shrimp (approximately 3½ pounds)",
    "6 to 8 sprigs fresh thyme",
    "Salt, to taste",
    "Freshly ground black pepper, to taste"
  ],
  "instructions": [
    "Heat the olive oil in a small skillet over medium heat till just smoking.  Add the minced garlic and cook until the garlic bits are pale golden, about 1 minute.  Stir in the shallots and season generously with salt and pepper and continue cooking, shaking the skillet, until the shallots are wilted, about 2 minutes.",
    "Add half of the wine (¼ cup) and bring it to a boil.  Continue cooking at the same temperature, until half of the wine has evaporated.  When at least half of the wine has evaporated add half of lemon juice (1-tablespoon) and continue to allow the sauce to boil until almost all of the liquid has evaporated.  Transfer the remaining liquid to a small bowl and allow it to cool completely.",
    "When the liquid has cooled completely add the softened butter, the parsley, and the tarragon and beat the mixture with a whisk until everything is well blended.  Spoon the butter mixture onto a 12-inch length of plastic wrap and roll it into a log shape, twisting the ends to enclose and contain the butter within the plastic wrap.  Place the butter in the refrigerator and chill it thoroughly.",
    "Place an oven rack in the lowest position and preheat the oven to 475° F.",
    "Peel the shrimp, leaving the tail and last shell fragment attached.  Devein and rinse the shrimp.  Lay the shrimp flat on a work surface.  Starting at the thick end, make a horizontal cut along the center of the shrimp, extending it about three-quarters of the way down.  Pat the shrimp dry.",
    "Using some of the flavored butter, lightly grease a low baking pan, such as an ovenproof, sauté pan, into which the shrimp all fit comfortably, without touching.  Place each shrimp on the work surface, with underside of the tail facing away from you.  With your fingers, roll each half of the slit part of the shrimp in towards, and underneath the tail, forming a “6” on each side of the shrimp, with the tail being the top of the “6”.",
    "Arrange the shrimp, tails up, on the prepared sauté, or sheet pan, as you work, until all are done.  Cut the remaining flavored butter into ½-inch cubes and disperse them among the shrimp.  Mix the remaining ¼-cup of wine and tablespoon of lemon juice and add it to the pan.  Scatter the thyme sprigs over and around the shrimp.  Finally, season with salt and pepper and place the pan on the oven rack.",
    "Roast until the shrimp are firm and crunchy, about 5 minutes.",
    "Transfer shrimp to a hot serving dish and keep warm while you make the sauce.",
    "Drain the pan juices to a small pan.  Bring the juices to a boil over high heat and boil until the sauce is lightly thickened, approximately 1 to 2 minutes.  Spoon the sauce over the shrimp and serve immediately."
  ],
  "remarks": "The name “Scampi” comes from a dish made in Italy in which spiny, hard-shell crustaceans, powder pink in color, that resemble small lobsters more than shrimp, are used.  However, the scampi crustaceans were not available in the United States.  Chefs in Italian-American restaurants to prepare shrimp for a dish, first called “gamberi”, used the method used in Italy to prepare the “Scampi”.   Over time, the “gamberi” dish became what is now call, “shrimp scampi”",
  "yield": "Makes 6 servings.",
  "source": "More or Less Gourmet by Lidia Matticchio Bastianich, San Antonio Express, Wednesday, February 27, 2002.",
  "category": "06 - Main Meals"
}