{
  "title": "Shrimp Quick Fried with Sweet Toasted Garlic (Camarones al Mojo de Ajo)",
  "requires": "",
  "ingredients": [
    "¾ cup peeled garlic cloves (about 2 large heads)",
    "1 cup good-quality oil, preferably extra-virgin olive oil",
    "Salt",
    "The juice of one lime",
    "2 canned chipotle chiles an adobo, seeded and cut into thin strips",
    "2 limes, cut into wedges",
    "2 pounds (about 48) medium-large shrimp, peeled (leaving the last joint and tail intact if",
    "you wish)",
    "3 tablespoons chopped fresh cilantro or flat-leaf parsley"
  ],
  "instructions": [
    "Either chop the garlic with a sharp knife into ⅛-inch size bits or drop the cloves through the feed tube of a food processor with the motor running and process until the pieces are roughly ⅛-inch size.  You should have about ½ cup of chopped garlic when you’ve finished.  In a small (1-quart) saucepan, measure the oil and into it scoop all the garlic bits (you’ll need all the garlic for even cooking) and add ½ teaspoon salt and set the saucepan over medium-low heat.  Stir occasionally as the mixture comes barely to a simmer (there should be just a hint of movement on the surface of the oil).  Adjust the heat to the very lowest possible setting to keep the mixture at that very gentle simmer (bubbles will rise in the pot like sparkling mineral water) and cook, stirring occasionally, until the garlic itself is a soft, pale golden (the color of light brown sugar), about 30 minutes.  The slower the cooking, the sweeter the garlic bits will taste.",
    "Add the lime juice to the pan and simmer until most of the juice has either evaporated or has been absorbed into the garlic, about 5 minutes.  Stir in the chiles, then taste the “mojo de ajo” and add a little more salt if you think it needs it.  Keep the pan over low heat, so the garlic will be warm when the shrimp are ready.  Scoop the lime wedges into a serving bowl and set on the table.",
    "Devein the shrimp, one by one.  Lay the shrimp on your work surface, make a shallow incision down the back and pull or scrape out the dark (usually) intestinal tract.",
    "Set a large (12-inch) heavy skillet (preferably nonstick) over medium-high heat and spoon in 1½ tablespoons of the oil (but not any of the garlic bits) from the  “mojo de ajo”.  Add half of the shrimp to the skillet, sprinkle generously with salt and stir gently and continuously until the shrimp are just cooked through, 3 to 4 minutes.  Stir in half the cilantro and scoop the shrimp onto a deep serving platter.",
    "Repeat with another 1½ tablespoons of the garlicky oil and the remaining shrimp.",
    "When all the shrimp are cooked, use a slotted spoon to scoop our the warm bits of garlic and chiles from the “mojo de ajo” pan and scatter them over the shrimp.  (You should have about ⅓ cup of the oil left over, for which you’ll be greatful – it’s wonderful for sautéing practically anything.)",
    "If you’re a garlic lover, you’re about to have the treat of your life.  Serve the shrimp with the lime wedges."
  ],
  "remarks": "The “mojo de ajo” keeps for a couple of weeks in the refrigerator (the oil will become solid but will liquefy again at room temperature), so I [Rick Bayless] never recommend making a small amount.  “Mojo de ajo” in the refrigerator represents great potential for a quick wonderful meal.  Warm the cold “mojo de ajo” slowly before using. If you’re making this dish for less than the recipe is designed for (6 persons), don’t make less of the “mojo de ajo”.  Save the excess in the refrigerator and use it as the base for cooking other meals:  rice, picadillo, etc. For the best texture, cook the shrimp immediately before serving. As an alternative, cook them an hour or so ahead, douse them with the “mojo de ajo”, as explained above, and serve it all at room temperature. Yield:  Serves 6 very generously. Source:  Mexico One Plate at a Time by Rick Bayless, Scribner, 1230 Avenue of the Americas, New York, NY 10020, ©2000 by Rick Bayless. Camarones al Mojo de Ajo",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}