{
  "title": "Slow Roasted Achiote Pork in Banana Leaves (Cochinita Pibil)",
  "requires": "",
  "ingredients": [
    "5 tablespoons (about 2 ounces) achiote seeds",
    "1½ tablespoons dried oregano, preferably Mexican",
    "1½ tablespoons black pepper, preferably peppercorns",
    "1¼ teaspoons cumin, preferably seeds",
    "½ teaspoon cloves, preferably whole",
    "6 inches of ½-inch-diameter Mexican cinnamon (canela) sticks; or,",
    "1½ tablespoons ground cinnamon",
    "Salt",
    "14 large garlic cloves, peeled and roughly chopped",
    "1½ cups fresh sour orange juice; or,",
    "1 cup fresh lime juice plus ½ cup fresh orange juice",
    "2 bone-in pork shoulder (Boston butt) roasts (about 12 pounds total), cut into 3-inch-wide",
    "cross sections (unless you have a meat saw, you’ll need to get the butcher to do this",
    "for you)",
    "One 1-pound package banana leaves, defrosted",
    "3 large (about 1½ pounds total) red onions, sliced ⅛ inch thick",
    "2 cups fresh sour orange juice; or,",
    "1⅓ cups fresh lime juice plus ⅔ cup fresh orange juice"
  ],
  "instructions": [
    "Measure the achiote seeds and oregano into a spice grinder, adding the black pepper, cumin, cloves and cinnamon, and run the grinder until everything is as powdery as you can get it (you may need to work in batches).",
    "In a blender, combine the ground mixture with 1 tablespoon salt, the garlic and sour orange juice (or lime juice plus orange juice).  Blend until smooth – there should be very little grittiness when a little is rubbed between your finger tips.",
    "If you’re working ahead, pour the mixture into a non-aluminum container, cover and refrigerate for 6 hours, or longer.  Before using, blend the mixture again to give it an even smoother texture.  (This long steeping and second blending aren’t absolutely essential, though without it, the marinade may be a little gritty.)",
    "In a large bowl or large heavy plastic food bag, combine the meat and the marinade, turning the meat to coat it evenly and thoroughly.  (Though achiote has tenacious coloring properties, I suggest you do this quickly with your hands.)  For the greatest penetration of flavor, let the meat marinate refrigerated (covered, it you are leaving the meat in a bowl), for several hours, or even overnight.",
    "Heat a gas grill to medium-high or light a charcoal fire and let it burn just until the coals are covered with gray ash and very hot.  Using scissors, cut off the hard edge you’ll find on most banana leaves (where the leaf attached to the central rib).  Cut 3 sections of banana leaf, each about 1 foot longer than the length of a large roasting pan.  Line the bottom and sides of the roasting pan with the leaves, overlapping them generously and letting them hang over the edges on the pan.  Lay the meat in the pan and drizzle with all the marinade.  Fold the banana leaf edges over the meat.  Cut 3 more sections of banana leaf slightly longer than the pan.  Lay them over the top of the meat, again generously overlapping; tuck them in around the sides.",
    "When the grill is ready, either turn the burner(s) in the center to medium-low or bank the coals to the sides for indirect cooking.  For the charcoal grill, set the grill grate in place.  Set the pan on the grill grate and close the grill cover.  Grill until the meat is thoroughly tender (work a fork in near a bone – the meat should easily come free), usually about 4 hours.  If your grill has a thermometer, aim to keep the temperature between 300° and 350° F.  To maintain an even temperature with charcoal, add more charcoal regularly (usually a few pieces every hour or so).",
    "While the meat is cooking, prepare the onions.  Scoop the onions into a non-aluminum bowl.  Pour boiling water over them and wait 10 seconds, then pour the onions into a strainer.  Return the drained onions to a bowl, pour on the sour orange juice (or the lime-orange combo) and stir in 1½ teaspoons salt.  Cover and set aside until serving time.",
    "Remove the top banana leaves.  Tip the pan to accumulate the juices in one end and spoon off the fat.  Season the remaining juices with salt if necessary.  You may want to remove the bones and cut the large pieces of meat into manageable serving size, but I suggest you leave everything right in the roasting pan for serving.  Set out your Cochinita Pibil with a large fork and spoon (for spooning up all those juices).  Drain the red onions and set out in a serving bowl to top each portion, along with a fresh salsa."
  ],
  "remarks": "[by Rick Bayless]: If you’re the plan-ahead type, make the marinade on Day 1, re-blend it and marinate the meat on Day 2 and then slow-roast the meat for serving on Day 3.  The marinade will hold for a week or more in the refrigerator.  Once the pork has been marinated, cook it with 24 hours.  The finished dish will keep for a couple of days, covered and refrigerated (meat and juice only – no banana leaves), though the texture of the meat won’t be quite as nice as fresh-from-the-oven.  Warm refrigerated cooked meat slowly (a 300° F. oven) in the juice, covered.  The pickled onions will keep for a week or so in the refrigerator, well covered. The pork can also be baked in a 325° F. oven instead of on the grill; cover the meat rather loosely with foil before baking.",
  "yield": "Serves 12 to 15 persons.",
  "source": "Mexico One Plate at a Time by Rick Bayless, Scribner, 1230 Avenue of the Americas, New York, NY 10020, ©2000 by Rick Bayless.",
  "category": "06 - Main Meals"
}