{
  "title": "Smoked Pork Chops with Sauerkraut",
  "requires": "",
  "ingredients": [
    "1½ pounds sauerkraut",
    "⅓ cup lard",
    "3 large onions, sliced",
    "3 tablespoons, firmly packed light brown sugar",
    "¾ cup beef broth",
    "¾ cup dry white wine",
    "10 juniper berries",
    "6 peppercorns",
    "2 carrots",
    "1 bay leaf",
    "6 smoked, 1-inch thick pork chops",
    "6 German style sausages",
    "2 tablespoons minced parsley",
    "Salt and pepper to taste"
  ],
  "instructions": [
    "Open two 13-ounce jars of sauerkraut and pour them into a colander; rinse it well under cold running water then shake out as much of the water as possible and allow it to drain well before you start.",
    "In a kettle simmer the sauerkraut in just enough water to cover, covered, for 1 hour; then pour it out into a colander and drain it well.  Return the kettle to the heat, turn the heat up to medium-high and add the lard.  When the lard is hot add the onions and cook them, stirring, for 4 minutes.  Add the brown sugar and continue cooking the mixture for 5 to 10 minutes; or, until the onion is uniformly translucent and all the sugar is melted and well incorporated.  Return the sauerkraut to the kettle with the onions and add the beef broth, the wine, the juniper berries, and the peppercorns and stir the mixture.  Lower the heat to keep the mixture at a simmer and arrange on top of the mixture the carrots, the bay leaf, and the pork chops.  Cover the kettle and keep it at a simmer for 45 minutes; or, until the pork chops are tender.",
    "While the pork chops are cooking place the sausages in a saucepan and add just enough water to cover them.  Bring the water to a boil and cook the sausages, covered, for 10 minutes.  Transfer the cooked sausages to a cutting board and slice them, diagonally, into complimentary serving size, to accompany the pork chops.  Place them in a heat proof platter, cover, and keep the sausage warm.",
    "When the pork chops are done transfer them too to heat proof platter with the sausage to keep them two warm also.  Remove the carrots and slice them on a diagonal, thinly, and place them with the pork chops and sausages to keep warm while you finish with the sauerkraut.",
    "Discard the bay leaf and season the sauerkraut with salt and pepper, to taste.  Dump the sauerkraut mixture into a colander and shake out as much of the water as possible and allow it to drain for a few seconds.  Arrange the drained sauerkraut mixture on a heated platter and top arrange the carrots, the pork chops, and the sausages.  Lastly, sprinkle the minced parsley over the platter and bring the platter it to the table.",
    "Remarks:  In  this dish is served with Düsseldorf-style mustard, steamed, and peeled, potatoes, and crusty rolls called “brochin.”",
    "Yield:  Serves 6.",
    "Source:  Gourmet Holidays: , by Lillian Langseth-Christensen, Gourmet Magazine, January 1978."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}