{
  "title": "Smoked Brisket",
  "requires": "Matt Martinez’s “Texas Sprinkle” and “Simple Barbecue Sauce” the recipes for which are both in the “Miscellaneous” < “Odds and Ends” folder.",
  "ingredients": [
    "8 to 12 pound brisket (Short, fat briskets with a covering of fat have the best flavor.  Never",
    "use a trimmed brisket.)",
    "Grilling Ingredients:",
    "Hickory, pecan, or oak “wood chips” soaked in water for at least 1 hour before using.",
    "Charcoal briquettes"
  ],
  "instructions": [
    "Season the untrimmed briskets with the “Texas Sprinkle” and set aside while you get the grill ready.",
    "Mound the charcoal in the grill, soak the charcoal mound with charcoal lighter, light it and allow the charcoal to burn until the flames go out.  Leave the charcoal mounded, undisturbed, until you begin to see that the individual briquettes have all begun burning and “ash white” areas are developing well on each briquette. (On days where there is no breeze you may wish to help the process by fanning the charcoal mound.)   With a long handled tool spread the charcoal briquettes beneath the grill grate to create a uniform layer of briquettes.  Allow the briquettes to burn down until they are all uniformly “ash white”.",
    "Measure out a cup full of the soaked wood chips (preferably hickory) and place them on the hot coals.",
    "Place the brisket on the grill grate and close the lid.",
    "Grill the brisket, turning it occasionally, until it’s dark and crusty on both sides, from 30 to 40 minutes all total,.  Expect some flare-ups to occur when you open the grill to replenish the wood chips or to turn the brisket.  (If you wish to control the flare-ups you might wish to have on hand a spray bottle full of water.)  Don’t be afraid to allow the meat to “char”.",
    "Preheat the oven to 200° F.",
    "When the brisket is “charred” remove it from the grill and place it in a roasting pan, with a lid; or cover it with foil.  Place it in the oven and roast it, covered, for 1 hour per pound.",
    "When the brisket is done, remove it from the oven and trim off the fat.  To serve, slice it thin across the grain.  Serve it with barbecue sauce.",
    "Yield:  Makes 8 to 12 servings, depending on the size of the brisket.",
    "Source:  Matt Martinez’s Culinary Frontier:  A Real Texas Cookbook, by Matt Martinez, Jr., and Steve Pate, published by Doubleday, 1540 Broadway, New York, N.Y. 10036, © 1997 by Matt Martinez, Jr., and Steve Pate."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}