{
  "title": "Spicy Beefsteaks with Tomatoes (Bisteces Entomatados)",
  "requires": "",
  "ingredients": [
    "1½ pounds boneless round steak, slightly pounded for tenderizing",
    "Salt and pepper",
    "5 tablespoons vegetable oil",
    "1½ medium white onions, halved and thinly sliced",
    "1½ pounds tomatoes (3 medium-large round, or 12 to 15 small plum), sliced",
    "3 to 4 chiles jalapeños, seeded and cut into strips",
    "2 tablespoons finely chopped garlic",
    "1 teaspoon dried oregano",
    "1½ pounds red potatoes, peeled and sliced in ¼-inch slices",
    "2 cups chicken stock",
    "Finely chopped parsley leaves for a garnish"
  ],
  "instructions": [
    "Start by lightly pounding the steaks to tenderize them then sprinkle them with salt and pepper.",
    "In a 6-quart braising pot with a lid, fry the meat in 3 tablespoons of oil over high heat for 1½ minutes on each side, or until each side is just browned.  Do not crowd the meat in the pan.  When done remove the steaks from the pot and set them aside.",
    "Add the remaining two tablespoons of oil to the pot and sauté the onions until they are translucent, stirring constantly, about 3 to 5 minutes.  When translucent add the tomatoes and cook them; caramelize them until their juices come out (about 4 minutes), stirring as needed but don’t break them up more then necessary.  Lower the heat to medium, add the chiles and garlic, and continue to cook.  Add the oregano and 1 teaspoon each of salt and black pepper, and stir.  Lay the potato slices on top of the mixture in the pan, then the steaks with any of their juices that have accumulated.  Pour the chicken stock in slowly.  It should just come to the level of the meat, no more.  Sprinkle the parsley leaves on top.  Cover, lower the heat to a simmer, and cook for 1 hour.",
    "Serve with corn tortillas."
  ],
  "remarks": "The tomatoes really need to caramelize or they won’t have the sweetness needed to make this dish its best.",
  "yield": "Serves 6 to 8.",
  "source": "Seasons of My Heart, A Culinary Journey Through Oaxaca, Mexico by Susana Trilling, published by The Ballantine Publishing Group, © 1999 by Susana Trilling.",
  "category": "06 - Main Meals"
}