{
  "title": "Spicy Orange Chicken Slices",
  "requires": "",
  "ingredients": [
    "For the Marinade –",
    "2 teaspoons dark soy sauce",
    "2 teaspoons dry sherry",
    "1 teaspoon vegetable oil",
    "1 teaspoon minced peeled fresh ginger",
    "1 teaspoon grated orange zest",
    "2 teaspoons cornstarch",
    "½ teaspoon salt",
    "½ teaspoon freshly ground black pepper",
    "For the Sauce –",
    "½ cup fresh orange juice",
    "1 tablespoon thin soy sauce",
    "1 tablespoon oyster sauce",
    "1 tablespoon Asian sesame oil",
    "Zest of one orange",
    "2 teaspoons sugar",
    "1 teaspoon cornstarch",
    "¼ cup water",
    "Main Ingredients –",
    "1 pound boneless, skinless chicken breasts cut into ¼-inch thick slices",
    "¼ cup vegetable oil",
    "2 tablespoons slivered ginger",
    "4 dried hot chilies, crumbled"
  ],
  "instructions": [
    "In a bowl, combine the marinade ingredients:  the dark soy sauce, sherry, vegetable oil, ginger, grated orange zest, cornstarch, salt, and pepper.  Add the chicken and toss it to combine and coat it well then let stand for 10 minutes.",
    "In another bowl, combine the sauce ingredients:  the orange juice, thin soy sauce, oyster sauce, sesame oil, orange zest, sugar, cornstarch, and water.  Whisk to blend well and set it aside.",
    "In a carbon-steel wok, heat the vegetable oil over high heat and stir-fry the chicken in batches (for 3 to 5 minutes per batch) until the meat is cooked through.  Remove the chicken to a plate.  Pour off and discard any excess oil, leaving about 1 teaspoon in the wok.  Return the wok to the heat, add the ginger slivers and hot chilies, and stir-fry for 30 seconds.  After 30 seconds add the chicken and sauce mixture.  Bring the mixture to a simmer and cook for 3 to 5 minutes, until the sauce thickens.  Toss to coat the chicken slices well and serve immediately over white rice."
  ],
  "remarks": "",
  "yield": "Serves 4",
  "source": "New Wok Cooking by Rosa Ross, Clarkson Potter/Publishers, New York, © 2000 by Rosa Ross.",
  "category": "06 - Main Meals"
}