{
  "title": "Spiced Chicken Wings",
  "requires": "",
  "ingredients": [
    "8 large chicken wings",
    "Flat leaf parsley sprig, for the garnish",
    "Lime wedges, as accompaniment",
    "For the Marinade",
    "1 garlic clove",
    "2-inch piece of fresh ginger, peeled and chopped",
    "The juice and finely grated zest of 2 limes",
    "¼ cup light soy sauce",
    "2 teaspoons ground cinnamon",
    "1 teaspoon ground turmeric",
    "¼ cup clear honey",
    "Salt",
    "For the Dip",
    "2 yellow bell peppers",
    "¼ cup plain yogurt",
    "2 tablespoons dark soy sauce",
    "2 tablespoons chopped cilantro",
    "Pepper"
  ],
  "instructions": [
    "Place the marinade ingredients in a food processor or blender and blend until it’s smooth.  Place the chicken in a bowl and pour the marinade over it.  Toss, cover and leave it to marinate for 1 to 2 hours,",
    "To make the dip, put the peppers under a preheated broiler for 10 minutes, turning them occasionally until they are charred and blistered.  Remove them from the heat source and place them in a plastic bag until cool.  Then peel off the skin and remove the seeds and white membrane.  Put the flesh in a food processor, or blender, with the yogurt and blend until smooth.  Pour into a bowl, season with the soy sauce and pepper to taste then stir in the cilantro.  Cover and chill until needed.",
    "Remove the chicken from the marinade and cook under a preheated broiler or on a barbecue grill for 4 to 5 minutes on each side, basting with the remaining marinade.",
    "Place the chicken in a serving bowl and garnish with flat leaf parsley.  Serve the chicken immediately with the dip and lime wedges.",
    "Remarks:  Erick has made this dish and recommends that we use chicken tenders (boneless, skinless, chicken breasts cut into 1-inch thick strips) instead.",
    "Yield:  Serves 4.",
    "Source:  Time to Celebrate!  Food & Ideas for Parties by Hamlyn, a division of Octopus Publishing Group Ltd, 2 –4 Heron Quays, London E14 4JP, ©1999, 2001 by Octopus Publishing Group Ltd."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}