{
  "title": "Steak Diane",
  "requires": "",
  "ingredients": [
    "1¾ cups heavy (whipping) cream",
    "¼ cup milk",
    "2 medium cloves garlic, crushed",
    "1 tablespoon freshly ground black pepper (medium grind)",
    "2 sirloin steaks (bone in preferably) each about 2-inches thick and about 1¾ pound,",
    "trimmed of excess fat",
    "1 teaspoon vegetable oil",
    "1 tablespoon clarified butter",
    "¼ cup bourbon",
    "2 tablespoons Dijon-style mustard",
    "¼ teaspoon vanilla extract"
  ],
  "instructions": [
    "In a small but heavy saucepan, set over high heat, combine the cream, milk, crushed garlic, and the pepper.  Bring the mixture to a boil and reduce the heat to very low and simmer gently, uncovered, until the mixture is reduced to about 1⅔ cups.  This should take about an hour.  When done, remove from the heat source, strain, and reserve.",
    "Simultaneously, as you are making the cream sauce, allow the steaks to stand at room temperature, uncovered, for 1 hour.  (Recommend that the steaks be placed on wire grills.)  Turn them periodically to allow the surface area of the steaks to dry.",
    "Heat, over high heat, a heavy cast-iron skillet, or a Dutch oven, that can accommodate the two steaks together without touching, for two minutes.  After the Dutch oven is hot add the oil and the clarified butter.  When the oil and clarified butter mixture are hot quickly place the two steaks in the skillet leaving space between them.  In the hot skillet or Dutch oven sear the steaks, uncovered, for about 5 minutes; then turn them over and do the opposite side for 4 minutes.  Once the outside of the steaks are nicely caramelized reduced the heat to medium-low and sauté the steaks undisturbed, for 8 minutes.  Turn the steaks and sauté the opposite sides another 3 to 4 minutes for medium rare.  (If you prefer a different degree of doneness then use a meat thermometer to judge by.)  Transfer the steaks to a cutting board and let them rest, keeping them warm, while you make the sauce.",
    "Pour off any remaining fat from the skillet, or Dutch oven, and return it to the heat source, reset at high heat.  Carefully add the bourbon, whisking frequently, until the bourbon is reduced to 2, or at most 3, tablespoons.  When ready whisk in the mustard and vanilla until the mixture is smooth.  Lastly, whisk in the reserved cream.  When all these ingredients have been combined, heat and reduce the sauce until its thick and smooth, about 2 minutes or so depending on the heat source and skillet, or Dutch oven, being used.  When done remove the sauce from the heat and cover with a piece of wax paper, or plastic wrap, against the surface of the sauce.",
    "Returning to the steaks carve them, across the grain, into ¼-inch thick slices.  Arrange the slices on a warmed platter and over them pour any accumulated juices.  Pour about ½ cup of the sauce over the meat and grind additional fresh black pepper over the sauce, if desired, and bring the platter to the table.",
    "Pour the remaining sauce into a sauce boat and place it on the table with the arranged platter of sliced steaks.",
    "Yield:  Serves 4 to 6 persons.",
    "Source:  Behind the Lines at Chez Panisse by Bruce Cost, Cuisine Magazine, March 1984."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}