{
  "title": "Tex-Mex Chili",
  "category": "06 - Main Meals",
  "requires": "",
  "ingredients": [
    "4 ancho chilies",
    "2 cups hot water",
    "3 cups water, divided in use",
    "6 cloves garlic, peeled",
    "1 teaspoon oregano",
    "¼ cup cooking oil",
    "12 ounces “chile-grind” beef",
    "2½ teaspoons ground cumin",
    "½ cup tomato purée",
    "½ teaspoon salt",
    "3 tablespoons oil",
    "⅓ cup flour"
  ],
  "instructions": [
    "Remove the stems, cut open and remove the seeds from the chile anchos.  Bring two cups of water to a boil (in the microwave it should be about 4 to 5 minutes) and pour the hot water over the stemmed and seeded chilies; let them soak for 15 minutes.",
    "Place the chile ancho in the blender and add 1 cup of the water in which they were soaking.  Add the garlic and oregano and blend the mixture for at least a full minute.  Measure the remaining water and add enough additional water to make two full cups.  Add the additional two cups of water and blend again.  Strain the mixture into a bowl and set it aside.",
    "Place a heavy skillet over medium-high heat.  When the skillet is hot add half of ¼-cup of oil; tilt and roll the skillet, to coat the bottom evenly then add half of the beef.  Sauté the beef until all the pink is browned and it begins to caramelize.  Place some paper towels on a plate.  Remove the beef to a plate and set it aside to drain until the second half of the beef has been sautéed in a similar manner.  Remove the second batch of beef onto paper towels and let it drain also.  (At this point you want to make sure that before you continue all of the excess oil has been drained and patted off the sautéed beef.)",
    "Turn the heat down to low and place a heavy pot, or Dutch oven, over the grill.  When the pot, or Dutch oven, is hot add all of the sautéed beef, the strained chile ancho mixture, the cumin, tomato purée, and salt.  Stir to mix the ingredients well then cover and allow the mixture to simmer, on the low heat setting, for one hour stirring occasionally to keep the ingredients at the bottom from scorching.  After one hour, uncover and taste for saltiness and spice balance; adjust as necessary, then cover and allow the mixture to continue simmering for an additional 40 minutes.",
    "About 30 minutes before the cooking time is up make a roux with 3 tablespoon of oil and the flour.  In a small skillet heat the oil over medium-high.  Add the flour and cook the oil and flour roux until the color of the roux turns to a light brown.",
    "At the end of the cooking time for the chili, uncover and add half of the roux.  Continue cooking the chili, but stirring often, over low heat for and additional 20 minutes.  (At this point you are trying to thicken the chile to its serving consistency.  If you see that it is not well thickened add a little more of the roux and continue cooking.  Repeat this process, using all of the roux if necessary.",
    "Serve hot in bowls.  Compliment with cornbread or Saltine crackers. "
  ],
  "remarks": "Chili of Tex-Mex origins never use beans.",
  "yield": "Serves 4.",
  "source": "Signatures, Taste Section, recipe adapted from ‘La Cocina de la Frontera’ by Jim Peyton, San Antonio Express-News, Wednesday, February 22, 2006."
}