{
  "title": "Tinga Poblana",
  "requires": "",
  "ingredients": [
    "2 pounds boneless pork shoulder, excess fat removed, cut into 1-inch cubes",
    "2 white onions, 1 thinly sliced (half of it will be used as a garnish) and the other one finely",
    "chopped (all of which will be sautéed)",
    "6 garlic cloves, 3 whole, peeled, and 3 of them peeled and chopped",
    "1 teaspoon salt, preferably sea salt, or to taste",
    "2 tablespoons safflower or canola oil",
    "¼ pound good-quality chorizo, homemade or store bought, crumbled",
    "1 can (14½-ounces) chopped tomatoes",
    "1 teaspoon dried oregano",
    "1 teaspoon dried thyme",
    "3 whole bay leaves",
    "4 chiles chipotles en adobo, chopped; or to preference",
    "1 teaspoon sugar"
  ],
  "instructions": [
    "In a sauce pan, combine the pork, half of the onion slices, and the whole garlic cloves.  Add water to cover and one teaspoon salt.  Bring to a boil; skim off any foam from the surface and reduce the heat to medium-low.  Simmer, uncovered, over medium-low heat until the meat is tender, about 1½ hours.  Transfer the pork to a bowl and set aside.",
    "In a frying pan over medium heat, warm the oil.  When the oil is just starting to smoke add the chorizo and fry, stirring often, until just cooked through, about 5 minutes.  Add the chopped onion and garlic and sauté for about 5 minutes.  Tilt the frying pan and spoon off any excess oil.",
    "Return the frying pan to the fire and add the pork, tomatoes, oregano, thyme, bay leaves, and the chiles.  Cook, stirring occasionally, for about 15 minutes, adding up to 1 cup of the broth to keep the mixture moist.  Add the sugar and stir to mix well.  Taste the mixture and adjust the seasoning by adding additional salt and sugar, if necessary to mellow the dish.",
    "Ladle the stew into bowls and garnish with pitted, peeled, and sliced avocado and the remaining onion slices.",
    "Remarks:  You may wish to soak the sliced onion, that portion that you intend to use as a garnish, in water in which a generous portion of salt has been dissolved to leach off any of the heavy onion flavor.",
    "Yield:  Serves 8 to 10.",
    "Source:  Savoring Mexico:  Recipes and Reflections on Mexican Cooking, by Marilyn Tausend, published by Time Life Books, a division of Time Warner Inc., © 2001 Weldon Owen Inc.",
    "Tinga poblana"
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}