{
  "title": "Torta Azteca",
  "category": "06 - Main Meals",
  "requires": "",
  "ingredients": [
    "1 large chicken breast half",
    "1 thick slice white onion",
    "2 cloves garlic",
    "½ teaspoon salt, plus salt to taste (preferably sea salt)",
    "1 pound tomatoes, roasted and quartered, or 1 can (14½-ounces) diced tomatoes with juices",
    "3 serrano chiles, coarsely chopped",
    "1 teaspoon safflower or canola oil",
    "freshly ground pepper to taste",
    "8 corn tortillas, each cut into 6 wedges; or use 48 to 50 unsalted commercial tortilla chips",
    "1 tablespoon unsalted butter",
    "¼ pound fresh mushrooms, brushed clean and sliced",
    "2 poblano chiles, roasted and sliced",
    "⅔ cup “crema”  (sour cream)",
    "½ cup shredded queso Chihuahua or Monterey Jack cheese",
    "6 radishes, thinly sliced"
  ],
  "instructions": [
    "Place the chicken in a saucepan with the onion slice, one of the garlic cloves, and ½ teaspoon salt.  Add water to cover and bring to a boil.  Reduce the heat to medium, cover, and simmer for 15 to 20 minutes.  Lift out the chicken and shred the meat, discarding the skin and bones.  Reserve the broth, skimming off any fat from the surface.",
    "In a blender or food processor, purée  the tomatoes with the chiles, chopped onion, and remaining garlic clove.  In a small saucepan over medium heat, heat the oil until just smoking.  Add the tomato mixture and fry, stirring occasionally, until the color darkens, approximately 3 to 4 minutes.  Add ½ cup of the reserved broth and season with salt and pepper.  Bring the sauce to a boil, reduce the heat to medium-low, and simmer, uncovered, until thickened, 8 to 10 minutes.  Remove from the heat and keep warm.",
    "Lightly grease an 8-inch square baking dish and preheat the oven to 350° F.",
    "If using tortillas, place the wedges in a single layer on a baking sheet and cover with a wire rack to keep them from curling.  Bake them for about 10 minutes, then remove them from the oven and set them aside.  Leave the oven on.",
    "In a small frying pan, over medium-high heat, melt the butter, add the mushrooms, and sauté them until the liquid they release evaporates, 5 to 8 minutes.",
    "Put one-third of the tortilla wedges or chips in the bottom of the baking dish.  Top with half of the poblano chiles, chicken, mushrooms, and “crema”.  Spoon on one-third of the sauce and cheese.  Top with half of the remaining tortilla wedges or chips and add the remaining chiles, chicken, mushrooms, and “crema”.  Top with half of the remaining sauce and cheese.  Finish with the remaining tortilla wedges or chips and the remaining sauce and cheese.",
    "Bake in the oven until the sauce starts to bubble and all the layers are heated through, approximately 15 to 20 minutes.  Remove from the oven and garnish with the radish slices on top and serve immediately."
    ],
  "remarks": "The original recipe calls for using “huitlacoche”, a fungus that grows on corn instead of mushrooms.  However, since the fungus isn’t generally available any type of mushrooms will add the needed “earthy” taste to this dish.",
  "yield": "Serves 4.",
  "source": "Savoring Mexico:  Recipes and Reflections on Mexican Cooking, by Marilyn Tausend, published by Time Life Books, a division of Time Warner Inc., © 2001 Weldon Owen Inc."
}