{
  "title": "Vegetable Enchiladas",
  "requires": "",
  "ingredients": [
    "For the Filling –",
    "¾ pounds red potatoes, peeled",
    "3 fresh poblano chili peppers, roasted, seeded, then cut into julienne strips",
    "2 red bell peppers, roasted, peeled and seeded, then cut into julienne strips",
    "½ yellow onion, diced",
    "1 cup shredded panela or Monterey Jack cheese",
    "½ cup grate Cotija, Romano or Parmesan cheese",
    "For the Sauce –",
    "1 tomato",
    "4 dried ancho chili peppers, stemmed and seeded",
    "2 cups hot tap water",
    "1 teaspoon salt",
    "½ teaspoon freshly ground pepper",
    "¼ yellow onion, coarsely chopped",
    "2 cloves garlic, chopped",
    "1 teaspoon ground cumin",
    "1 teaspoon distilled white vinegar",
    "2 teaspoons dried oregano, crumbled",
    "2 tablespoons olive oil",
    "For the Assembly –",
    "Vegetable oil for frying",
    "12 corn tortillas"
  ],
  "instructions": [
    "To make the Filling –",
    "In a saucepan, combine the potatoes with cold salted water to cover.  Bring the water to",
    "over medium-high heat.  Boil gently until the potatoes are tender when pierced with a fork,",
    "about 15 minutes or so.  Drain them and let them cool, then cut the potatoes into ½-inch dice.",
    "Place the poblano chilies, bell peppers, onion, and both cheeses and stir to mix well.  Set aside.",
    "To make the Sauce –",
    "Preheat a broiler.  Place the tomato in a shallow baking pan.  Place it in the broiler 4 to \t6 inches from the heat source.  Broil the tomato, turning occasionally, until it’s charred on all",
    "sides, about 10 to 12 minutes.  Remove it from the heat source and let it cool slightly then cut",
    "out the core.  Set it aside.",
    "In a small frying pan, without oil, over medium heat, toast the chilies, turning them",
    "once, until fragrant and the skins begin to blister, 3 to 5 minutes.  Remove them from the heat",
    "and let them cool, then place them in a bowl, add the hot water and let them soak for 15",
    "minutes to soften.",
    "Transfer the chilies, and their soaking liquid to a blender and add the salt, pepper,",
    "onion, garlic, cumin, vinegar, oregano, and roasted tomato.  Purée the mixture until smooth,",
    "then strain through a sieve into a shallow bowl.",
    "In a heavy-bottomed pot over medium heat, warm the olive oil.  Add the purée and",
    "and cook, stirring constantly, until the sauce thickens slightly, about 5 to 10 minutes.",
    "Meanwhile, preheat the oven to 350° F. and spread a piece of plastic wrap on a work surface.",
    "Final Assembly –",
    "In a shallow frying pan over medium heat, pour in the vegetable oil to a depth of ¼",
    "inch.  When the oil is hot, fry the tortillas, one at a time, turning them once.  Fry them until",
    "they are limp, not crisp, about 30 seconds per side.  Using tongs, transfer the tortillas to paper",
    "towels to drain.  One at a time, next dip each fried tortilla in the chili sauce and then lay it on",
    "the plastic wrap that you’ve set up.  Place a portion of the filling on the tortilla in a line, not",
    "quite to the edge of the tortilla and roll it up.  As the tortillas are filled, and rolled, set them",
    "seam side down and side by side in a warmed glass or ceramic baking dish.  When all the",
    "enchiladas are made, top each one with a few spoonfuls of the remaining sauce.",
    "Place the enchiladas in the oven until warmed throughout, about 10 to 15 minutes."
  ],
  "remarks": "An acceptable and quick version is to fix the filling and to use a can of enchilada sauce bought in the store.  Jump from the preparation of the filling, which can be done a day ahead, down to the final assembly (don’t forget the preheating of the oven).",
  "yield": "On a three enchiladas per person basis, 12 enchiladas will serve 4 persons; less if someone insists on larger portions.",
  "source": "Cantina, The Best of Casual Mexican Cooking by Susan Feniger and Mary Sue Milliken, © 1996 by Weldon Owen Inc., published by Sunset Publishing Corp., Menlo Park, CA 94025.",
  "category": "06 - Main Meals"
}