{
  "title": "Virginia Ham",
  "requires": "",
  "ingredients": [
    "1  ( or equivalent), 10 to 12 pounds",
    "4 tablespoons light brown sugar",
    "1 tablespoon of bread crumbs",
    "¼ teaspoon ground cloves",
    "3 tablespoons honey",
    "3 tablespoons dry sherry; or, sweet-pickle vinegar",
    "20 to 30 whole cloves"
  ],
  "instructions": [
    "The ham was cured for at least 12 months –",
    "Scrub the ham to remove the coating of seasonings and place in a container large enough to cover it with water.  Soak the ham for 24 hours, changing the water often.",
    "In a large covered roasting pan, place the ham, skin side down with enough fresh water to cover.  Bring the water to a boil then reduce the heat to keep the ham, covered, at a bare simmer for 20 to 25 minutes per pound.  When cooked, based on the ham’s weight, remove the ham from the water and set it on a cutting board.  When it has cooled enough for you to work with it trim off the skin; then working carefully, trim off any excessive fat.  Make sure that a layer of fat remains for you to score and prepare for baking.",
    "Preheat the oven to 375° F.",
    "In a small bowl combine the brown sugar, the bread crumbs, and the ground cloves.  In a separate small container mix the honey and sherry (or sweet-pickle vinegar) and set aside.",
    "Score the remaining fat on the ham; cutting into the fat with a sharp knife in opposite direction diagonal cuts, creating a diamond pattern.  Place the ham in a shallow baking pan and press the brown sugar mixture into the ham.",
    "Place the ham in the center rack of the preheated oven and bake it, uncovered, for 15 minutes; or, until the brown sugar has melted.",
    "Remove the ham from the oven and drizzle the honey/sherry (or sweet-pickle vinegar) uniformly over the ham.  Return the ham to the oven for an additional 15 minutes.",
    "The ham was cured less then 12 months –",
    "If the ham was cured less then 12 months then simply follow the instructions on the wrapper or hang the ham in a dry cool place and allow it to age further.",
    "Yield:  Serves 10 to 12 persons.",
    "Source:  The Colonial Williamsburg Tavern Cookbook, by The Colonial Williamsburg Foundation, Recipes Developed by John R. Gonzales, Edited by Charles Pierce, Clarkson Potter/Publishers, New York, © 2001 by The Colonial Williamsburg Foundation."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}