{
  "title": "Williamsburg Inn Chicken and Dumplings",
  "requires": "This recipe calls for the “Dumplings” recipe.  That recipe is in the “Miscellaneous” > “Odds and Ends” folder.",
  "ingredients": [
    "1 stewing chicken (4 to 5 pounds)",
    "1 small onion, sliced",
    "1 carrot, sliced",
    "2 ribs of celery with leaves",
    "1 teaspoon salt",
    "4 tablespoons butter",
    "6 tablespoons flour",
    "⅛ teaspoon paprika",
    "½ cup half-and-half cream",
    "Dumplings"
  ],
  "instructions": [
    "Simmer the chicken, with the onion, carrot, celery, and salt, in a deep pan with enough water to cover the chicken until it’s done, approximately 1½ to 2 hours.  (You want the chicken to be “falling from the bones”.)",
    "Remove the chicken for the broth and let it cool.  When it’s cool enough to handle, remove and discard the skin and bones.  Cut the chicken meat into bite size pieces and set aside.",
    "Using a medium-mesh strainer, strain the chicken broth that remains in the pot.  You want to have enough broth to make 1 quart (4 cups).",
    "Melt the butter in a large saucepan and stir in the flour mixed with the paprika and stir the mixture until the roux is well mixed, but don’t brown.  Add all of the chicken and then gradually, stirring constantly, add the chicken broth and cook the mixture for 2 minutes over medium heat.  Add the half-and-half and the pepper and stir the mixture well then taste it and adjust the seasoning to your taste preference.  Once the chicken mixture is gently bubbling spoon in the Dumplings as explained on the “Dumplings” recipe.  When all the Dumplings have been dropped into the chicken mixture cover the pot and cook for 15 minutes, without lifting the lid of the pot.",
    "Turn off the heat and serve at once."
  ],
  "remarks": "This is an excellent wintertime dish.  This is an excellent alternative to chicken soup.",
  "yield": "Serves 6 to 8.",
  "source": "The Williamsburg Cookbook, Updated 1975 Edition, Published by The Colonial Williamsburg Foundation, Williamsburg, Virginia.",
  "category": "06 - Main Meals"
}