{
  "title": "Berry Galette Requires:  Galette Dough, ½ of what the recipe, in the “Breads, Cakes, and Cookies” folder calls for.",
  "requires": "",
  "ingredients": [
    "1½ cups of mixed fresh berries (or cut-up and peeled mixed fruit)",
    "1 tablespoon plus 1 teaspoon sugar",
    "1 tablespoon honey (optional)",
    "1 tablespoon cold unsalted butter"
  ],
  "instructions": [
    "Position a rack in the lower third of the oven and preheat the oven to 400° F.",
    "Line a baking sheet with a parchment paper.",
    "Put the dough on a lightly floured work surface and roll it into an 11-inch circle that is about ⅛ inch thick.  Since the dough is soft, you’ll need to lift it now and then and toss some more flour under it and over the top.  Roll up the dough around your rolling pin and transfer it to the prepared baking sheet.",
    "Spread the berries (or fruit) over the dough, leaving a 2- to 3-inch border.  Sprinkle 1 tablespoon of the sugar over the fruit and drizzle on the honey, if you’re using it.  Cut the butter into slivers and scatter it on top of the fruit.  Fold the uncovered border of dough up over the filling, allowing the dough to pleat as you lift it up and work your way around the galette.  (Because you’re folding a wide edge of dough onto a smaller part of the circle, it will pleat naturally – just go with it.)  Dip the pastry brush in water, give the edge of the crust a light coating, and then sprinkle the crust with the remaining teaspoon of sugar.",
    "Bake the galette for 35 to 40 minutes, or until the pastry is golden and crisp.  Transfer the baking sheet to a cooling rack and let the galette rest on the sheet for 10 minutes.  Slip a wide spatula or a small baking sheet under the galette and slide it onto the cooling rack.  Serve warm or at room temperature, cutting the tart with a pizza wheel or a sharp knife.",
    "The galette is best eaten the day it’s made.",
    "Remarks:  This is a “keeper”.  It simple and inviting and so enjoyable to construct that you’ll find yourself make it frequently.  It’s called a galette because it’s flat, open-faced and “free-form” – the crust is rolled into a circle, the filling piled on, and the edges of the crust turned in and ruffled.  This recipe calls for mixed “berries” but if you include strawberries, don’t include to many, they are too watery.  Peeled soft fruits, like peaches or apricots; or, in the fall and winter, tart apples or sweet pears are excellent ingredients.",
    "Yield:  One galette makes 4 to 6 servings.",
    "Source:  Baking with Julia, Everyday Delights by Dorie Greenspan, William Morrow and Co., Inc., New York, © 1996 by A La Carte Communications, Inc.",
    "Berry Galette"
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "01 - Breakfast"
}