{
  "title": "Blueberry Muffins",
  "requires": "",
  "ingredients": [
    "1¾ cups cake flour",
    "2 teaspoons baking soda",
    "1 teaspoon cream of tartar",
    "1 teaspoon salt",
    "1 pint of fresh blueberries",
    "¾ cup milk",
    "¼ cup sour cream",
    "1 stick (4 ounces) unsalted butter, at room temperature",
    "⅔ cup sugar",
    "1 large egg, at room temperature",
    "1 large egg yolk, at room temperature"
  ],
  "instructions": [
    "Butter or spray the insides of 18 muffin cups or line them with paper baking cups.  If you only have two sets of 12 muffin cup tin pans, fill the 6 that will be empty in one of the tins with water (don’t leave them empty) – this will help the muffins bake evenly.",
    "Position a rack in the center of the oven and preheat the oven to 400° F.",
    "Sift the cake flour, baking soda, cream of tarter, and salt together twice, and leave the sifted dry ingredients in the sifter or strainer; set it on a piece of waxed paper.  Remove a tablespoon of two of the dry ingredients and use amount to toss with the blueberries to coat them with the flour.  In a separate bowl, stir the milk and sour cream together and set aside until needed.",
    "In a mixer fitted with the paddle attachment (or work with a hand held mixer), beat the butter on medium speed until white and pale, about 3 minutes.  Add the sugar and beat until the mixture no longer feels grainy, about 3 minutes, scraping down the paddle and the sides of the bowl as needed.  Add the eggs and yolk and beat until the mixture is fluffy, about 2 minutes.",
    "Remove the bowl form the mixer and sift half of the dry ingredients into the bowl.  Add half of the milk and sour cream mixture and, using a large rubber spatula, delicately fold the ingredients together, stopping when barely combined.  Add the remaining dry and liquid ingredients and fold in only until just mixed – don’t be concerned about getting everything evenly incorporated.",
    "Lastly, add the blueberries, sprinkle them in and fold them in only to the “just-mixed” stage.  Don’t over do folding together at this stage.",
    "Spoon the batter into the prepared muffin tins, filling each cup at least “two-thirds” full.  Bake the muffins for 18 to 20 minutes, or until the tops, which will be flat, are golden and spring back when lightly pressed.  Turn the muffins out onto a cooling rack and allow them to cool for 10 to 15 minutes before serving."
  ],
  "remarks": "These muffins are best made in standard tins in which the cups are 2½ inches in diameter. The muffins will stay light and lovely for a day.  If you are not going to serve them within a few hours of baking, pack them into a plastic bag; they’ll keep for 1 more day and will then be best sliced and toasted.  For longer storage, wrap airtight and freeze them for up to 1 month.  Thaw, still wrapped, at room temperature. Yield:  Makes 18 muffins. Source:  Baking with Julia, Everyday Delights by Dorie Greenspan, William Morrow and Co., Inc., New York, © 1996 by A La Carte Communications, Inc. Blueberry & Buttermilk Crumb muffins",
  "yield": "",
  "source": "",
  "category": "01 - Breakfast"
}