{
  "title": "Buckwheat Crêpes with Apple Compote",
  "requires": "",
  "ingredients": [
    "For the Crêpes –",
    "1 cup buckwheat flour",
    "1 large egg",
    "1 large egg white",
    "⅔ cup 1% milk",
    "¼ cup beer",
    "¼ cup sugar",
    "1 tablespoon peanut oil, plus extra for preparing the pan",
    "1 teaspoon pure vanilla extract",
    "¼ teaspoon salt",
    "For the Compote –",
    "1 tablespoon butter",
    "3 pounds Golden Delicious apples (approximately 8 apples), peeled, cored and sliced",
    "⅓ cup sugar",
    "½ teaspoon pure vanilla extract",
    "A pinch of ground cinnamon",
    "½ cup calvados or applejack"
  ],
  "instructions": [
    "To make the crêpes:",
    "In a food processor, combine the buckwheat flour, egg, egg white, milk, beer, sugar, oil, vanilla, salt and the ⅔ cup water and process all of the ingredients until the mixture is smooth.  Transfer this batter to a bowl, cover with a sheet of plastic wrap and refrigerate for at least 1 hour; or, overnight.  When you remove the batter from the refrigerator to use, test it with a spoon.  It should be the consistency of heavy cream.  If it is too thick, stir in ¼ to ⅓ cup of water.)",
    "To make the apple compote:",
    "Melt the butter in a large skillet over medium-high heat.  Swirl the butter in the skillet, cooking it, until the melted butter is a light brown; about 30 seconds if the heat source is correct.  Add the apple slices and sprinkle the sugar over the apples.  Cook the apples, tossing the skillet occasionally, until the apples are tender and lightly caramelized; approximately 15 to 20 minutes.  Remove, from the heat and stir in the vanilla extract and cinnamon and set the apples aside.",
    "To cook and fill the crêpes:",
    "Preheat the oven to 375° F. and lightly oil an 11-by-7 inch, or similar baking dish; or, use spray oil such as Pam© to lubricate the baking dish and set aside.",
    "Heat an 8-inch nonstick skillet, or crêpe pan, over medium-high heat until a drop of water dances on the surface.  Using a paper towel, rub the pan with a little of the oil then ladle in about 3 tablespoons of the batter.  Immediately, tilt and roll the pan to spread the batter evenly over the bottom of the skillet or crêpe pan.  Return the skillet or crêpe pan to the heat source and allow the crêpe to cook until the edges are dry and turning lightly brown.  Loosen the crêpe with a spatula, and quickly turn it over in the skillet or crêpe pan.  Continue cooking the crêpe another 20 to 30 seconds until the bottom too is lightly browned.  When the crêpe is done transfer it to a plate.  Repeat with the remaining batter, applying more oil to the skillet or crêpe pan when necessary and stacking the crêpes on the plate as they are done.",
    "Spread about two tablespoons of the apple compote along the center of each crêpe and fold it into quarters.  Arrange the crêpe in the prepared baking dish.  (The crêpe can be prepared ahead and stored, covered, in the refrigerator for up to 2 days.)",
    "Bake the crêpe, uncovered, for 10 to 15 minutes; or, until all are heated through.",
    "In a small sauce pan warm the calvados or applejack over medium-low heat; until it is just barely steaming.  Do NOT allow it to reach a boil.  Remove from the heat and carefully ignite with a match.  Pour the flaming calvados or applejack over the crêpe and bring to the table and serve.",
    "Yield:  Serves 6.",
    "Source:  Tour through the Fish Market of , Travel Section, Eating Well, September/October 1994."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "01 - Breakfast"
}