{
  "title": "Buttermilk Crumb Muffins",
  "requires": "",
  "ingredients": [
    "2½ cups unbleached all-purpose flour",
    "2 cups (packed) light brown sugar",
    "⅔ cup solid vegetable shortening",
    "2 teaspoons baking powder",
    "½ teaspoon baking soda",
    "½ teaspoon cinnamon",
    "¼ teaspoon grated nutmeg",
    "½ teaspoon salt",
    "1 cup buttermilk",
    "2 large eggs, well beaten"
  ],
  "instructions": [
    "Spray or grease two 12-cup muffin tins, or if you have them, use a 12-cup and a 6-cup tin.",
    "Position a rack in the center of the oven and preheat the oven to 350° F.",
    "Put the flour and brown sugar into a large bowl and stir with your fingers or a fork to mix well before starting.  Break the shortening into a few pieces, drop them into the flour mixture, and, using your fingertips, lightly rub the shortening and flour together.  When the mixture looks like coarse bread crumbs, you’ve mixed enough – don’t worry about little lumps.  Measure out ½ cup of the mixture and set it aside to use later as the crumb topping.",
    "Add the baking powder, baking soda, cinnamon, nutmeg, and salt to the flour mixture and stir with a fork to mix well.  Add the buttermilk and beaten eggs and, using a large spoon, mix until the ingredients are well blended and the batter is thick and shiny.",
    "Spoon the batter into the muffin tins, filling each cup at least two-thirds full.  Sprinkle the top of each muffing with a rounded teaspoon of the reserved crumbs mixture and pat it gently onto the batter.  Half-fill any empty muffin molds with water – this will help the muffins bake evenly.",
    "Bake the muffins for 25 to 30 minutes, or until a toothpick inserted into the center of a muffin comes out clean.",
    "Serve warm."
  ],
  "remarks": "The muffins are best the day they are made, but will keep in a plastic bag or closed container for a day; reheat for 5 to 8 minutes in a 350° F. oven. I would marinade a half cup of raisins in some rum, or other liquor, for an hour or so before starting and add the raisins to the batter after you’ve add the buttermilk and eggs.  (Adding chopped pecan would also be a delicious variation.) Yield:  Make 14 to 16 muffins. Source:  Baking with Julia, Everyday Delights by Dorie Greenspan, William Morrow and Co., Inc., New York, © 1996 by A La Carte Communications, Inc. Blueberry & Buttermilk crumb muffins",
  "yield": "",
  "source": "",
  "category": "01 - Breakfast"
}