{
  "title": "Danish Braid Requires:  :  Half of the Danish Pastry Dough, the recipe for which is in the “Breads, Cakes, and Cookies” folder.  The Apricot, Prune, or Fresh Berry Jam Fillings, the recipes for which are in the “Miscellaneous” folder.  And, the Confectioner’s Cream or Almond Fillings, the recipes for which are also in the “Miscellaneous” folder.",
  "requires": "",
  "ingredients": [
    "1 recipe Apricot, Prune, or Fresh Berry Jam Filling",
    "1 recipe Confectioner’s Cream or Almond Filling",
    "1 large egg white, beaten",
    "Pearl sugar or crushed sugar cubes, for sprinkling",
    "Sliced unblanched or chopped blanched almonds, for the garnish (optional)",
    "2 to 3 teaspoons cold strong coffee, for the glaze",
    "½ cup confectioner’s sugar, sifted, for the glaze"
  ],
  "instructions": [
    "Working on a lightly floured surface, roll the chilled dough into a rectangle 10 inches wide and 16 inches long.  Lift onto a sheet of parchment, and position lengthwise on the work surface.  Spread some of the fruit filling down the length of the center third of the dough, then top with some of the cream or almond filling (you might not need the entire amount of either filling), spreading it so that a little of the fruit filling peeks out on either side.  Using a pizza cutter or the point of a sharp knife, cut 12 to 14 slanting lines down each side, angling the cuts from the center of the pastry to the edge and cutting strips about ¾ inch wide.  Fold the strips of pastry into the center, criss-crossing the filling by alternating one strip for the left side of the pastry with one from the right.  Lightly press the ends together to seal and run your hands along the sides of the pastry to straighten them.",
    "Brush the pastry with the beaten egg white and sprinkle with pearl sugar and almonds.  Cover with a kitchen towel and allow it to rise at room temperature for 30 minutes, until it looks and feels puffy; it will not double.",
    "Center a rack in the oven and preheat the oven to 400° F. Slide the braid, paper and all, onto a baking sheet; bake for 15 to 20 minutes, or just until golden.  Transfer the pastry onto a cooling rack and make the glaze.",
    "Stir the coffee into  the confectioner’s sugar, adding just enough coffee to produce a smooth, shiny glaze.  Spoon the glaze into a small zipper-lock plastic bag, seal the top, and snip a bottom corner to create a little decorating tube.  Squeeze squiggles of the glaze over the pastry, allow it to set for a few minutes, and serve while the pastry is still warm.",
    "Remarks:  What likes like a braid is actually just a crisscross of pastry strips, made in minutes but giving the impression of being complex to construct.  The braid is packed with two fillings (your choice) and decorated with a coffee-sugar glaze.",
    "Yield:  Makes 1 long braid; 6 to 8 servings.",
    "Source:  Baking with Julia, Everyday Delights by Dorie Greenspan, William Morrow and Co., Inc., New York, © 1996 by A La Carte Communications, Inc.",
    "Danish braid"
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "01 - Breakfast"
}