{
  "title": "Danish Pastry Dough",
  "requires": "",
  "ingredients": [
    "¼ cup warm water (between 105° F. and 115° F.)",
    "2½ teaspoons active dry yeast",
    "½ cup milk, at room temperature",
    "1 large egg, at room temperature",
    "¼ cup sugar",
    "1 teaspoon salt",
    "2½ cups unbleached all-purpose flour",
    "2 sticks (8 ounces) cold unsalted butter"
  ],
  "instructions": [
    "Pour the water into a large bowl, sprinkle the yeast over the water, and let it soften for a minute.  Add the milk, egg, sugar, and the salt and whisk to mix; then set aside.",
    "Put the flour in the work bowl of a food processor fitted with the metal blade.  Cut the butter into ¼-inch-thick slices and drop them into the flour.  Pulse 8 to 10 times, until the butter is cut into pieces that are about ½ inch in diameter.  Don’t overdo this – the pieces must not be smaller than ½ inch.",
    "Empty the contents of the food processor into the bowl with the yeast and, working with a rubber spatula, very gently turn the mixture over, scraping the bowl as needed, just until the dry ingredients are moistened.  Again don’t be too energetic – the butter must remain in discrete pieces so that you will produce a flaky pastry, not a bread or cookie dough.",
    "Cover the bowl with plastic wrap and refrigerate the dough overnight (or for up to 4 days, if that better suits your schedule).",
    "Lightly flour a work surface (a cool surface, such as marble, is ideal), turn the dough out onto it, and dust the dough lightly with flour.  Using the palms of your hands, pat the dough into a rough square.  Then roll it into a square about 16 inches on a side.  (A French rolling pin, one without handles, is best here.)  Fold the dough into thirds, like a business letter, and turn it so that the closed fold is to your left, like the spine of a book.  (If at any time the dough gets too soft to roll, just cover it with plastic wrap and pop it into the refrigerator for a quick chill.)",
    "Roll the dough out again, this time into a long narrow rectangle, about 10 inches wide and 24 inches long.  Fold the rectangle in thirds again, turn it so the closed fold is to you left, and roll it into a 20-inch square.  Fold the square into thirds, like a business letter, so that you have a rectangle, turning it so that the closed fold is to your left, and once more, roll the dough into a long narrow rectangle, 10 inches wide by 24 inches long.  Fold again in thirds, wrap the dough well in plastic, and chill it for at least 30 minutes, or for as long as 2 days.  (Depending on what you plan to do with the dough, you might want to divide it into half now.)",
    "After chilling, the dough is ready to be shaped, filled, and baked following the recipes of your choice."
  ],
  "remarks": "The dough can be kept covered in the refrigerator for 4 days or wrapped airtight and frozen for one month; thaw overnight, still wrapped, in the refrigerator. Traditionally, Danish pastry dough is made the way croissant dough is made; or its unyeasted cousin, puff pastry, is made.  That is, you make a dough that acts as a wrapper for a block or butter, and then you roll and fold the dough several times to created layers.  This recipe is a quick method to cut the butter into the dough using a food processor, making it easier and faster.  The yeast and liquid are mixed into the dough and then the chilled dough is given the traditional rolls and folds. Yield:  Makes 2 pounds of Danish dough. Source:  Baking with Julia, Everyday Delights by Dorie Greenspan, William Morrow and Co., Inc., New York, © 1996 by A La Carte Communications, Inc.",
  "yield": "",
  "source": "",
  "category": "01 - Breakfast"
}