{
  "title": "Pecan Sticky Buns Requires:  Brioche dough, the recipe for which is in the “Breads, Cakes, and Cookies” folder.",
  "requires": "",
  "ingredients": [
    "For the Dough -",
    "Brioche dough, chilled",
    "1½ sticks (6 ounces) unsalted butter, at room temperature",
    "For the Filling –",
    "¼ cup sugar",
    "¼ teaspoon cinnamon",
    "1 large egg, lightly beaten",
    "1cup chopped pecans",
    "For the Topping –",
    "2 sticks (8 ounces) unsalted butter, at room temperature",
    "1 cup (packed) light brown sugar",
    "42 pecan halves"
  ],
  "instructions": [
    "Divide the Brioche dough in half and keep one half covered in the refrigerator while you work with the other.",
    "On a lightly floured work surface (cool marble is ideal), roll the dough into a rectangle that is 11 inches wide, 13 inches long, and ¼ inch thick.  Try to work quickly, because the dough is so active that even the warmth of your hands may be enough to get it rising again.  Dot the surface of the dough evenly with the softened butter and fold the dough in thirds, as though you were folding a business letter.  Turn the dough so that the closed fold is to your left and then roll it out again, taking care not to roll over the edges – you don’t want to crush the layers you’re creating by folding and rolling.",
    "Fold the dough in thirds again, wrap well in plastic, and refrigerate for 30 minutes so that it can relax.",
    "Repeat the rolling, folding, and chilling with the second piece of dough and the remaining butter.",
    "Mix the sugar and cinnamon together in a small bowl and keep it close at hand.",
    "Remove the first piece of dough from the refrigerator and, on a lightly floured work surface, roll it into a rectangle 11 inches wide, 13 inches long, and ¼ inch thick, just as you did at the start.  Using a pastry brush, paint the surface of the dough with the beaten egg.  Leaving the top quarter of the dough bare, sprinkle over half of the cinnamon sugar and half of the chopped pecans; spread everything around with your fingers so that the filling is evenly distributed.  Very lightly roll the rolling pin over the dough to press in the filling.  Starting from the base of the rectangle, roll the dough up into a log.",
    "Wrap the log in plastic and freeze until firm, 45 minutes to an hour, so it will be easy to cut.  Meanwhile, repeat the process with the second piece of dough.  The sticky bun logs can now be double-wrapped and kept in the freezer for up to a month.  If left to freeze solid, the rolls should be allowed to rest at room temperature for 15 minutes before you continue with the recipe below.",
    "While the logs are chilling to be cut, prepare the pans.  You’ll need two 9-inch round cake pans with high sides.  Using your fingers, press a stick of butter evenly over the bottom of each pan; sprinkle the brown sugar evenly over the butter.",
    "Remove the log of dough from the freezer and, if the ends are ragged, trim them.  Using a long sharp serrated knife and a gentle sawing motion, slice the log into seven 1½ -inch-wide slices.  Lay each slice on one of its flat sides, press the slice down with the palm of your hand to flatten it slightly, and then, with cupped hands, turn the slice around on the work surface two or three times to reestablish its round shape.  Press 3 pecans, flat side up, into the top of each slice so that the nuts form a triangle.  Holding on to the nuts as best as you can, turn the slices over into a prepared pan, placing the buns in a circle and putting the last slice in the center; the seams of the buns should face the outside of the pan.  Repeat with the second log of dough.",
    "Allow the pans of sticky buns to rest, uncovered, at room temperature for 1½ to 2 hours, or until the slices rise and grow to touch one another.",
    "Arrange the oven racks so that one rack is in the middle of the oven and the other is just below it and preheat the oven to 350° F.",
    "Put the pans of sticky buns on the middle rack and slip a foil- or parchment-lined jelly-roll pan onto the lower rack, at the ready to catch any drips.  Bake the buns for 35 to 40 minutes, or until golden brown.  As soon as you remove the sticky buns from the oven, invert them onto a serving dish.  (If you leave the buns in the pan for a few minutes, the sugar may harden and they’ll be difficult to unmold.  If this happens, soften the sugar by putting the pan over a flame or in a pan of hot water.)",
    "Serve the sticky buns at room temperature or just slightly warm – never serve them hot, straight from the oven, because the caramelized topping is dangerously hot."
  ],
  "remarks": "Sticky buns should be served the day they are made and should not be stored. The technique of folding butter into the dough and giving the dough two turns, as you would with puff pastry, enriches already-rich dough and produces beautiful, buttery layers.  These bear no resemblance to anything store-bought. Yield:  Makes 14 buns. Source:  Baking with Julia, Everyday Delights by Dorie Greenspan, William Morrow and Co., Inc., New York, © 1996 by A La Carte Communications, Inc. Pecan Sticky buns",
  "yield": "",
  "source": "",
  "category": "01 - Breakfast"
}