{
  "title": "Steamed Yeast Biscuits",
  "requires": "",
  "ingredients": [
    "1 envelope of active dry yeast",
    "¾ cup milk, lukewarm and scalded; plus ½ cup cold milk",
    "2¼ cups plus 2 tablespoons all-purpose, unbleached flour",
    "3 tablespoons plus 1½ teaspoons sugar",
    "2 egg yolks",
    "1 stick (½ cup) butter, softened plus additional butter for the baking dish",
    "1 teaspoon vanilla"
  ],
  "instructions": [
    "In a small bowl proof the yeast in ¼ cup lukewarm, scalded milk mixed with 2 teaspoons of flour and 1½ teaspoon sugar for 10 minutes.",
    "In a separate bowl beat 2 egg yolks, with ½ cup of the lukewarm, scalded milk, ½ stick (¼ cup) softened butter, and 3 tablespoons of sugar until the mixture is well combined.",
    "In a large bowl, preferably the bowl of a mixer, add half of the flour and the egg yolk mixture and using the beater paddles beat the ingredients to mix obtain a thin dough mixture.  Add the yeast mixture and the remaining flour and beat the dough for 10 minutes; or, until the mixture is smooth and glossy.  (You may have to replace the paddles with the dough hooks to finish the dough.)  Remove the mixing bowl from the beater and sprinkle the surface of the mixture with flour and let it rise, covered with plastic wrap, in a warm place for 40 minutes; or, until it rises and is one third larger.",
    "Return the mixing bowl and dough to the beater and beat the dough for 5 more minutes.  Prepare a floured work surface and dump the dough out; with a rolling pin roll the dough out to a ⅞-inch thickness.  With a 1-inch round biscuit cutter cut out as many round as possible and set them aside.  Gather the excess dough, roll it out again in the same manner, and cut out more rounds.  Repeat the process until all the dough has been used.  There should be about 80 rounds.",
    "In a small saucepan melt ½ stick (¼ cup) of butter and drop the rounds into the pan, several at a time; rolling them to coat them with the butter.  Form the rounds into “small cork” shapes, put them all upright and close together in a well buttered 8- by 6-inch lidded baking dish, at least 3 inches deep.  Cover the baking dish with a moist tea towel and let the dough rise in a warm place for 40 minutes.",
    "Preheat the oven to 375° F.",
    "Remove the tea towel, cover the dish with its lid, and bake the biscuits in a preheated, moderately hot, oven for 40 minutes; or, until they are golden.",
    "While the biscuits are baking mix together 1 teaspoon of vanilla and ½ cup of milk.",
    "Pour the vanilla-milk mixture over the biscuits and return them to the oven again.  Bake them, covered, for 3 minutes; or, until the liquid is absorbed.",
    "Loosen the biscuits from the sides of the dish with a knife and turn them out onto a heated platter.  Separate the biscuits slightly and serve them while still hot with vanilla custard sauce.",
    "Remarks:  Look for the “Custard Sauce” in the “Sauces” files.",
    "Yield:  Serves 6.",
    "Source:  Gourmet Holidays: , by Lillian Langseth-Christensen, Gourmet Magazine, January 1978."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "01 - Breakfast"
}