{
  "title": "Galette Dough",
  "requires": "",
  "ingredients": [
    "3 tablespoons sour cream (or yogurt or buttermilk)",
    "⅓ cup (approximately) ice water",
    "1 cup unbleached all-purpose flour",
    "¼ cup yellow cornmeal",
    "1 teaspoon sugar",
    "½ teaspoon salt",
    "7 tablespoons cold unsalted butter, cut into 6 to 8 pieces"
  ],
  "instructions": [
    "Stir the sour cream and ⅓ cup ice water together in a small bowl and set aside.  Put the flour, cornmeal, sugar, and salt in a large bowl and stir with a fork to mix.  Drop the butter pieces into the bowl, tossing them once or twice just to coat them with flour.  With a pastry blender, work the butter into the flour, aiming for pieces of butter that range in size from “bread crumbs” to “small peas”.  The smaller pieces of butter in the mix (“bread crumb” size) will make the dough tender, the larger ones (“small peas” size) will make the dough flaky.",
    "Sprinkle the cold sour cream mixture over the dough, 1 tablespoon at a time, tossing with a fork to evenly distribute it.  After you’ve added all of the sour cream, the dough should be moist enough to stick together when pressed; if it’s not, add additional cold water, one teaspoon at a time.  With your hands, gather the curds of dough together.  (You’ll have a soft, malleable dough, the kind you might want to overwork.)",
    "Turn the dough out of the bowl and divide it in half.  Press each piece of dough into a disk, wrap it in plastic, and refrigerate for at least two hours."
  ],
  "remarks": "The dough can be kept in the refrigerator for a day or two, or it can be wrapped airtight and frozen for a month.  Thaw the dough, still wrapped, in the refrigerator.  It is convenient to roll the dough into rounds, place parchment between each round, and freeze them wrapped in plastic.  This way, you’ll need about 20 minutes to defrost a round of dough at room temperature before it can be filled, folded into a galette, and baked. The cornmeal in this buttery dough not only gives it a bit of crunch, it makes it crisp enough to stand up to soft and syrupy fillings and sturdy enough to be rolled to extreme thinness.  You can use this dough to line a tart pan, but it is particularly well suited to rustic tarts called, “galettes” – flat, open-face, free-form tarts whose edges are folded over the filling like the ruffled top of a drawstring purse. Yield:  Make enough for two 8-inch galettes. Source:  Baking with Julia, Everyday Delights by Dorie Greenspan, William Morrow and Co., Inc., New York, © 1996 by A La Carte Communications, Inc. Cheese and tomato galette",
  "yield": "",
  "source": "",
  "category": "02 - Baking"
}