{
  "title": "Hot Cross Buns",
  "requires": "Pastry dough, the recipe for which is in the, “Desserts and Pastries” > “Pies” folder.",
  "ingredients": [
    "1 cup warm milk (between 105° F. and 115° F.)",
    "2 packages (¼-ounce) active dry yeast",
    "½ cups plus 1 teaspoon sugar",
    "4 cups all-purpose flour",
    "1½ teaspoons ground allspice",
    "½ teaspoon cinnamon",
    "1 teaspoon salt",
    "1¼ sticks cold unsalted butter",
    "2 large eggs",
    "1 large egg yolk",
    "½ cup dried currants",
    "⅓ cup golden raisins",
    "2 teaspoons finely grated fresh orange zest",
    "2 teaspoons finely grated fresh lemon zest",
    "3 teaspoons powdered sugar"
  ],
  "instructions": [
    "In a small bowl stir together the milk, yeast, and 1 teaspoon sugar.  Let the mixture stand 5 minutes, or until it’s foamy.",
    "Into a large bowl sift together the flour, allspice, cinnamon, salt, and the remaining ½ cup of sugar.  Cut the butter into bits and with your fingertips or a pastry blender blend the butter into the flour mixture until it resembles coarse meal.  Lightly beat 1 whole egg.  Make a well in the center of the flour mixture and in it pour the yeast, the egg mixture, currants, raisins, and the lemon and orange zests.  Stir the mixture until a dough is formed.  Transfer the dough to a floured surface and with floured hands knead it until it’s smooth and elastic, about 10 minutes.  Transfer the dough to an oiled large bowl, turn the dough to coat it with the oil, and cover the bowl with a piece of plastic wrap.  Let the dough rise, in a warm place until double in bulk, about 1½ hours.",
    "Butter two large baking sheets.",
    "On a floured surface with floured hands turn out the dough and knead it briefly then form it into two 12-inch-long logs.  Cut each log crosswise into 12 equal pieces.  Form each piece into a ball and arrange them on the baking sheets about 1½ inches apart.  Let the buns rise in a warm place, covered with a sheet of wax paper that has been spray with Pam© or some other spray oil so they won’t stick, until they are double in bulk, about 45 minutes.",
    "Preheat the oven to 400° F.",
    "While the buns are rising, lightly beat the remaining egg with the powdered sugar to make an egg glaze.  On a lightly floured surface with a floured rolling pin roll out the pastry dough into a 20- by 6-inch rectangle (about ⅛-inch thick).  With a sharp knife cut the rectangle crosswise into ⅛-inch-wide strips.",
    "Brush the buns with the egg glaze and arrange two pastry strips over the center of each bun to form the cross.  Trim the ends of the pastry strips flush with the bottoms of the buns.  Bake the buns in the upper and lower thirds of the oven, switching their position of the baking sheets (top to bottom, bottom to top) halfway through the baking.  Bake until the buns are golden, about 12 minutes total.",
    "Transfer the buns to a rack to cool slightly.  The buns are best when served warm, however, they may also be served at room temperature.",
    "Remarks:    The buns may be made one week ahead and frozen, wrapped in foil then placed within a sealable plastic bag.  Thaw the buns before reheating and serving.  These buns are a fixture on many Easter tables because of their symbolic cross.",
    "Yield:  Makes 24 buns.",
    "Source:  The Best of Gourmet 2000, from the Editors of Gourmet, ©1999 by The Condé Nast Publications, Published by Random House Inc., New York.",
    "Hot cross buns"
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "02 - Baking"
}