{
  "title": "Pizza Dough",
  "requires": "",
  "ingredients": [
    "3 cups flour, sifted",
    "2 packages of dried yeast",
    "6 tablespoons milk",
    "Salt"
  ],
  "instructions": [
    "Dissolve the yeast in a little warm water (not more than a ¼ cup) and break up any lumps with a spoon.  Put the flour in a mound on a pastry board or working surface and in the center of the mound make a well in which to pour the liquids.  Add the dissolved yeast, the milk, and a pinch of salt to the flour and knead well to obtain a smooth soft dough, adding more flour or water, as may be necessary.",
    "The dough must then be left to rise.  This can be a delicate operation as the time needed will depend on the temperature of the place where you leave the dough to rise in.  The ideal temperature of the warming place is about 86° F., with a high level of humidity.  One way to create this environment is to put the dough in a large bowl, sprinkle the dough with flour, and cover the bowl with a damp kitchen towel.  [My own preferred way is to put the dough in a large bowl and cover it loosely with a sheet of plastic wrap.  (Spray the side of the plastic wrap that will be against the dough with Pam©.)  In a microwave proof bowl heat one to two cups of water to boiling.  Then place the bowl of dough and the hot water in the microwave oven together, close the door, and allow the dough to rise.]  The dough will rise in two to four hours, depending on the conditions.  The dough must be left until the dough has doubled in bulk.",
    "For four individual pizzas, after the dough has risen, divide the dough into four equal parts and knead each part into a ball.  Press each ball of dough down and with your fingers flatten and spread the dough out to form the flat pancake-shape of the pizza.  Try to keep the thickness of the pizza to less than ¼-inch, with edges a little higher and thicker.",
    "Place the garnish/toppings and bake in a very hot oven on a greased baking sheet or in Teflon, or other non-stick, pan.  [For two medium size pizzas divide the dough into two equal parts.  For one large size pizza simply use all the dough.]",
    "Yield:  Makes 4 individual size pizzas; two medium size pizzas; or, one large size pizza.",
    "Source:  Pasta & Pizza, Recipes compiled by Ann Martini, Translated by Elisabeth Evens, St. Martin’s Press Inc., 175 Fifth Ave., New York, N.Y., 10010, © 1974 by Arnoldo Mondadori – Verona, Italy.",
    "Making a Individual pizza"
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "02 - Baking"
}