{
  "title": "Pizzas Hotel San Pietro",
  "requires": "",
  "ingredients": [
    "For the dough –",
    "1½ tablespoons active dry yeast",
    "1¼ cups plus 1-tablespoon warm milk",
    "4⅓ cups all-purpose flour",
    "⅛ teaspoon salt",
    "1 tablespoon olive oil",
    "Cornmeal for sprinkling on the baking sheets",
    "6 ounces mozzarella, cut into ¼-inch thin pieces",
    "For the Sauce –",
    "2 garlic cloves, crushed",
    "⅓ cup olive oil",
    "Two 35-ounce cans of Italian plum tomatoes, drained and chopped",
    "1 tablespoon minced fresh basil leaves",
    "1½ teaspoons fresh oregano, chopped; or, ½ teaspoon dried oregano, crumbled"
  ],
  "instructions": [
    "Making the dough:  In a small bowl proof the yeast in ¼ cup of the milk with a pinch sugar for 10 minutes, or until it is foamy.  In a large bowl combine the flour and the salt, make a well in the center, and add the yeast mixture, the oil, and enough of the remaining milk to form a dough.  Knead the dough on a floured surface for 15 to 20 minutes, or until blisters begin to appear in the dough.  Form the dough into a ball and put it in a lightly oiled bowl.  Turn the dough to coat it with the oil and let it rise, covered, in a warm place for 1 hour, or until it is double in bulk.",
    "Making the Sauce:  In a stainless steel or enameled skillet cook the garlic in the oil over moderate heat, stirring, for 3 minutes.  Discard the garlic; add the tomatoes, the basil, the oregano, and salt and pepper to taste.  Simmer the sauce, stirring occasionally, for 10 minutes.",
    "Making the Pizzas:  Punch down the dough, divide it into 12 pieces, and shape each piece into a ball.  Let the balls rise, covered, in a warm place for 1 hour, or until they are double in bulk.  Flatten each ball into a 6-inch round.  Arrange the rounds on baking sheets on which you have lightly sprinkled the cornmeal.  Spread each round with 2 tablespoons of the sauce, leaving a ½-inch border.  Sprinkle the rounds with the mozzarella and bake the pizzas in a preheated very hot oven (450° F.) for 15 to 20 minutes, or until the cheese is melted and bubbling.",
    "Remarks:  An excellent way to all the yeast dough to rise is by using a microwave oven to heat 2 cups of water to boiling in a heat proof Pyrex container.  Push the hot water off to a corner of the microwave oven and place the yeast dough, covered, in the microwave oven.  The hot water will provide warmth and humidity throughout the full time that the dough is allowed to rise.",
    "Yield:  Makes 12 individual pizzas.",
    "Source:  Gourmet Holidays:  The Amalfi Coast by Terry Weeks, Gourmet Magazine, September 1982."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "02 - Baking"
}