{
  "title": "Popovers",
  "requires": "",
  "ingredients": [
    "1 cup all-purpose flour",
    "1 cup whole or 2% milk, at room temperature",
    "½ teaspoon salt",
    "3 large eggs, at room temperature",
    "2 tablespoons unsalted butter, melted"
  ],
  "instructions": [
    "Butter or spray nine ¾-cup glass custard cups or ten ½-cup muffin cups.  If you are using custard cups, place them on jellyroll pan, leaving space between each cup.  If you are using muffin pans, you’ll need to use two 12-hole muffin tins, because to give the popovers ample air circulation, you won’t be filling all of the holes.",
    "Position a rack on the lowest rung of the oven and preheat the oven to 425° F.",
    "Pour all the ingredients into the container of a blender and whirl until smooth.  (This can also be done in a food processor or in a bowl, using a rotary or hand-held beater.)",
    "Strain the batter if it is at all lumpy.",
    "For the custard cups, pour ⅓ cup of batter into each cup, dividing any extra batter among the cups.  For the muffin cups, use ¼ cup of batter for each cup, filling alternate cups in each tin so that every popover has space for puffing.  Bake, without opening the oven door after you place them in the oven, for 25 minutes, until the popovers are puffed, nicely browned, and crisp on their exterior.  Turn the temperature down to 350° F. and bake for another 15 to 20 minutes to help dry out their interior, which, no matter what you do, will always be a little doughy in the center.",
    "Serve immediately."
  ],
  "remarks": "Popovers are at their puffiest right out of the oven.  You can hold them at room temperature for a few minutes, or wrap them airtight, freeze them for up to a month, and reheat them in a 350° F. oven for 10 to 15 minutes, and they’ll taste good – but never as good as “just baked”. Yield:  Makes 9 large or 10 medium popovers. Source:  Baking with Julia, Everyday Delights by Dorie Greenspan, William Morrow and Co., Inc., New York, © 1996 by A La Carte Communications, Inc. popover",
  "yield": "",
  "source": "",
  "category": "02 - Baking"
}