{
  "title": "White Bread Loaves",
  "requires": "",
  "ingredients": [
    "2½ cups warm water (between 105° F. to 115° F.)",
    "1 tablespoon active dry yeast",
    "1 tablespoon sugar",
    "7 cups (approximately) bread flour or unbleached all-purpose flour",
    "1 tablespoon salt",
    "½ stick (2 ounces) unsalted butter, at room temperature"
  ],
  "instructions": [
    "Pour ½ cup of the water into the bowl of a heavy-duty mixer, sprinkle the yeast and sugar, and run the whisk slowly to blend.  Allow the mixture to rest until the yeast is creamy, about 5 minutes.",
    "Working in the mixer with the dough hook in place, add the remaining 2 cups water and about 3½ cups flour to the yeast.  Turn the mixer on and off a few times just to get the dough going without having the flour fly all over the counter and then, mixing on low speed, add 3½ cups more flour.  Increase the mixer speed to medium and beat, stopping to scrape down the bowl and hook as needed, until the dough comes together.  (If the dough does not come together, add a bit more flour, a tablespoon at a time.)  Add the salt and continue to beat and knead at medium speed for about 10 minutes, until the dough is smooth and elastic.  If you prefer, you can mix the dough in the machine for half that time and knead it by hand on a lightly floured surface for 8 to 10 minutes.  When the dough is thoroughly mixed (return it to the mixer if necessary), add the butter, a tablespoon at a time, and beat until incorporated.  Don’t be disconcerted if your beautiful dough comes apart with the addition of butter – beating will bring it back together.",
    "Turn the dough out onto a lightly floured work surface and shape it into a ball.  Place it in a large buttered or oiled bowl (one that can hold double the amount of dough).  Turn the dough around to cover its entire surface with butter or oil, cover the bowl tightly with plastic wrap, and let the dough rest at room temperature until it doubles in bulk, about 45 minutes to 1 hour.",
    "Butter two 8½- by 4½-inch loaf pans and set them aside.",
    "Deflate the dough and turn it out onto a lightly floured work surface.  Divide the dough in half and work with one piece at a time.  Using the palms of your hands and finger tips, or a rolling pin, pat the dough into a large rectangle about 9 inches wide and 12 inches long, with the short side facing you.  Starting at the top, fold the dough about two thirds of the way down the rectangle and then fold it again, so that the top edge meets the bottom edge.  Seal the seam by pinching it.  Turn the roll so that the seam is in the center of the roll, facing up, and turn the ends of the roll in just enough so that it will fit in one of the buttered loaf pans.  Pinch the seams to seal, turn the loaf over so that the seams are on the bottom, and plump the loaf with your palms to get and even shape.  Drop the loaf into the pan, seam side down, and repeat with the other piece of dough.",
    "Cover the loaves with oiled plastic wrap (you can spray one side of the plastic wrap with Pam©), and allow them to rise in a warm place (about 80° F.) until they double in size again, growing over the tops of the pans, about 45 minutes.",
    "After the loaves have risen about 30 minutes, place a rack in the center slot of the oven and remove the second rack if it’s above the one in the center.  Then, turn the oven on and preheat it to 375° F.",
    "When the loaves are fully risen (poke your finger into the dough; the impression should remain), bake them for 35 to 45 minutes, or until they are honey-brown and an instant-read thermometer plunged into the center of the bread (turn the loaf out and plunge the thermometer through the bottom of the bread) measures 200° F.  (If you like, 10 minutes or so before you think the loaves should come out, you can turn the loaves out of their pans and let them bake on the oven rack out of the pan so they brown on the sides.)  Otherwise, remove the loaves form the pans as soon as they come from the oven and cool the bread loaves on wire racks.",
    "Don’t cut them until they are almost completely cool; “just warm” is just right."
  ],
  "remarks": "These loaves bake to a generous four to five inches high. This is a basic white bread recipe with a difference – it’s got full, rounded flavor and a substantial texture; not your average sandwich loaf.  The little bit of butter in the dough browns nicely under heat. Note that the original recipe, above, calls for only a tablespoon of sugar, whose main function is to give the yeast something to use as it begins to “do its thing” in rising.  If you like your bread to have a sweet after taste you’ll want to use more than a tablespoon.  Use your judgment on how much sugar to use and add it at the time when the tablespoon of sugar is called for. Once the bread is completely cool, the bread loaves can be kept in a brown paper bag for a day or two.  Once a loaf is sliced, turn it cut side down on the counter or a cutting board and cover it with a kitchen towel.  For longer storage, wrap the loaf, or loaves, airtight in plastic wrap or aluminum foil and freeze it.  It will keep this way for up to a month.  Thaw it, still wrapped, at room temperature. Yield:  Makes two 1¾-pound loaves. Source:  Baking with Julia, Everyday Delights by Dorie Greenspan, William Morrow and Co., Inc., New York, © 1996 by A La Carte Communications, Inc.",
  "yield": "",
  "source": "",
  "category": "02 - Baking"
}