{
  "title": "Danish Pastry Pockets ",
  "requires": "The Danish Pastry Dough, the recipe for which is in the “Breads, Cakes, and Cookies” folder.  The Apricot, Prune, or Fresh Berry Jam Fillings, the recipes for which are in the “Miscellaneous” folder.  And, the Confectioner’s Cream or Almond Fillings, the recipes for which are also in the “Miscellaneous” folder.",
  "ingredients": [
    "Danish Pastry dough, chilled",
    "1 recipe Apricot, Prune, or Fresh Berry Jam Filling",
    "1 recipe Confectioner’s Cream or Almond Filling",
    "1 large egg white, beaten",
    "Pearl sugar or crushed sugar cubes, for sprinkling",
    "½ cup confectioner’s sugar, sifted, for the glaze",
    "2 to 3 teaspoons milk, for the glaze"
  ],
  "instructions": [
    "Line a baking sheet with parchment paper and set aside.",
    "Flour the top of the dough and place it on a lightly floured work surface.  Roll the dough into a square that is 20 inches on a side.  Using a ruler and a long wet knife or a pizza cutter, trim the edges to even them, if needed.  Score each side at 5-inch intervals, then cut through the dough, using the ruler as your guide, to make sixteen 5-inch squares.",
    "To make the Spandauer",
    "Place a pastry square on the work surface with one of the points aimed at you.  Place a tablespoon of fruit filling and a tablespoon of cream or almond filling in the center of the pastry, one filling over the other, and brush the left- and right-hand points with a little of the beaten egg white.  Fold the sides of the diamond into the center, with the points overlapping, and press down gently so that you create a pointed rectangular pastry with a little peeking out form the top and bottom of the overlap.",
    "To make the Three-corner",
    "Put a pastry square on the work surface with a point facing you.  Spoon a tablespoon of fruit filling onto the center of the pastry and spoon a tablespoon of either almond or cream filling on top of it.  Brush the edges of the pastry with some of the beaten egg white.  Fold the bottom half of the pastry over the top to form a triangular turnover and press the edges to seal.  You can crimp the edges with the tines of a fork if you want, or, decorate the top of the turnover with a scrap of pastry.  Glue the decoration to the three-corner with egg white.",
    "To make the Packet",
    "Place a pastry square on the work surface, spoon on a tablespoon of fruit filling, and top with a tablespoon of either cream or almond filling.  Brush the edges of the pastry with some of the beaten egg white and, with both hands, lift the four corners of the pastry off the counter and toward the center of the square.  Squeeze the corners together in the center and give them a little pinch and a twist to create a small topknot.",
    "To make the Pinwheel",
    "Place a pastry square on the work surface and spoon a tablespoon of fruit filling onto the center of the square.  Spoon a tablespoon of either cream or almond filling on top of it.  Using a pizza cutter or a thin sharp knife, cut a slash from the enter to each corner.  Brush every other pastry point with a little beaten egg white and lift those points off the counter and in towards the center, pressing the dough lightly against the filling and overlapping the points to create a pinwheel.",
    "Lift the pastries onto the parchment-lined baking sheet, cover with a kitchen towel, and allow the pastries to rise at room temperature for 30 minutes.  (Reserve the remaining beaten egg white.)  Although the pastries won’t double, they will look and feel puffy.",
    "Position a rack in the center of the oven and preheat the oven to 400° F.",
    "Brush the risen pastries with the reserved beaten egg white, sprinkle with pearl sugar, and bake for 8 to 10 minutes, or until lightly golden.  Transfer the pastries from the baking sheet to a wire rack to cool slightly while you prepare the glaze.",
    "Milk the confectioner’s sugar and milk together in a small bowl, adding enough milk to produce a glaze that is smooth and can be piped.  Scrape the glaze into a small plastic bag with a zipper lock, and seal.  Snip a corner of the bag to create a small opening (your own piping tip) and squeeze the glaze through the bag onto the pastries in attractive squiggles.  Serve the pastries warm or at room temperature."
  ],
  "remarks": "Danish pastries are best served the day they are made – the closer to just baked, the better.  If necessary, the pastries can be kept tightly covered at room temperature for several hours. These are four different pastry shapes that you can use. Yield:  Makes 16 pastries. Source:  Baking with Julia, Everyday Delights by Dorie Greenspan, William Morrow and Co., Inc., New York, © 1996 by A La Carte Communications, Inc. Pinwheel Danish",
  "yield": "",
  "source": "",
  "category": "01 - Breakfast"
}