{
  "title": "Mrs. Booth’s Biscuit Mix",
  "requires": "",
  "ingredients": [
    "3 cups self-rising flour, plus more for kneading",
    "1½ teaspoons baking powder",
    "1 tablespoon sugar",
    "1½ teaspoons salt",
    "1 cup chilled vegetable shortening",
    "Milk as needed; 3 to 4 tablespoons per cup of mix used",
    "Melted butter; or milk for brushing the tops of the biscuits before baking"
  ],
  "instructions": [
    "In a large bowl, combine the flour, the baking powder, the sugar, and the salt.  With a whisk or fork stir the flour to mix all the ingredients well.  Add the cold shortening and with your fingertips, two knives, or with a pastry blender, cut in the shortening until the flour mixture resembles the texture of coarse meal.",
    "Preheat the oven to 425° F. and grease or use spray oil, such as Pam®, two large baking sheets.",
    "If you are going to use melted butter to brush the top of the biscuits then before starting melt 4 to 6 tablespoons of butter in a small heat-proof container and set it aside.",
    "In a large mixing bowl, place the biscuit mix.  Using a fork, stir in enough milk to make soft, but not sticky, dough, approximately 3 to 4 tablespoons of milk per cup of mix used.  Knead with floured hands on a lightly floured work surface, 5 or 6 times; or, until the dough is smooth and elastic.  However, keep in mind that biscuit dough is best the less it’s kneaded.",
    "With a rolling pin, roll the dough out to ½-inch thick for high biscuits; or, ¼-inch high for thin, crusty biscuits.  With a biscuit cutter, cut out biscuit rounds and arrange them on the baking sheets.  Space the biscuits close together for soft biscuits or 1 inch apart for crusty biscuits.",
    "Brush the tops of the biscuits with the melted butter; or, with milk and bake them for 7 to 10 minutes; or, until they are golden brown.",
    "Serve warm."
  ],
  "remarks": "This biscuit mix can be made ahead and stored in the refrigerator in an air-tight container for several days.",
  "yield": "Makes 4½ cups of biscuit mix.",
  "source": "The Colonial Williamsburg Tavern Cookbook, by The Colonial Williamsburg Foundation, Recipes Developed by John R. Gonzales, Edited by Charles Pierce, Clarkson Potter/Publishers, New York, © 2001 by The Colonial Williamsburg Foundation.",
  "category": "01 - Breakfast"
}