{
  "title": "New Year’s Eve Jam Doughnuts (Silvesterkrapfen)",
  "requires": "",
  "ingredients": [
    "Two ¼-ounce packages (5 teaspoons) active dry yeast",
    "6 tablespoons sugar",
    "1¾ cup milk",
    "8 cups all-purpose flour",
    "4 large eggs",
    "1 teaspoon freshly grated lemon rind",
    "¼ teaspoon salt",
    "9 tablespoons unsalted butter, melted and cooled",
    "1 cup apricot jam",
    "Lard for deep-frying (may substitute vegetable oil)",
    "Confectioners’ sugar for dusting the doughnuts"
  ],
  "instructions": [
    "In the bowl of an electric mixer proof the yeast with 1 tablespoon of the sugar and 1 cup of warm milk (heated to lukewarm) for 5 minutes; or, until the yeast mixture is foamy.  Into the foamy yeast mixture sift in 1 cup of the flour, and using a wooden spoon combine the mixture well.  Cover the bowl with plastic wrap and allow the mixture to stand in a warm place for 10 minutes; or, until it is bubbly.",
    "In another bowl whisk together the eggs, the remaining 5 tablespoons of sugar, and the lemon rind until the sugar is dissolved.  When ready, stir the egg mixture into the yeast mixture along with the remaining ¾ cup of milk, the salt, and the butter.  When these ingredients are well mixed, stir in 6 cups of the remaining flour and with the electric mixer fitted with a dough hook; knead the dough for 5 minutes, adding enough of the remaining cup of flour as necessary to form smooth elastic dough.  Transfer the dough to a buttered bowl, turn it to coat it with the butter, cover the bowl with plastic wrap and let it rise in a warm place for 45 minutes; or, until it is double in bulk.",
    "On a floured surface roll out the dough ¼-inch thick and cut it into rounds with a 3½-inch round cutter.  Put 1 teaspoon of the jam in the center of half of the rounds and top the jam with the remaining rounds.  Press the edges together firmly and, using a smaller round cutter (3¼-inch), trim off the outer portion of each round.  Dust the doughnuts with flour and let them rise, covered with a piece of plastic wrap, in a warm place for 45 minutes; or, until they are nearly double in bulk.",
    "In a deep fryer fry the doughnuts in batches in 2 inches of hot (360º F.) lard or oil, turning them once, for 6 minutes; or, until they are golden brown on both sides.  Transfer them with a slotted spoon to paper towels to drain.",
    "Dust them with confectioners’ sugar and serve while still warm.",
    "Yield:  Makes about 15 doughnuts.",
    "Source:  New Year’s in  by Lillian Langseth-Christensen, Gourmet Magazine, January 1989."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "01 - Breakfast"
}