{
  "title": "North African Breakfast Buns",
  "requires": "",
  "ingredients": [
    "1 packet active dry yeast",
    "1 cup warm water",
    "2 cups unbleached all-purpose flour",
    "1¾ cups semolina",
    "1 tablespoon extra-virgin olive oil; plus a little more to work the dough",
    "1 large egg",
    "Sea salt",
    "½ cup unsalted butter, at room temperature",
    "Honey and butter for serving"
  ],
  "instructions": [
    "Mix the yeast in ½ cup of warm water and set it aside to dissolve.",
    "Combine the all-purpose flour and semolina in a bowl and stir in the dissolved yeast.  Add the olive oil and the egg and combine to mix well.  The mixture should be about the consistency of mashed potatoes at first.  If it seems too dry, add a little more warm water, in increments of ¼ cup in order to avoid adding too much water all at once.  (If you do make a mistake and have added too much water, stir in a little extra semolina.)",
    "Add the salt and knead the dough on a lightly greased board for about 5 minutes, or until you feel the yeast and gluten starts to come together as a “springy” dough.  Transfer the dough to a lightly greased bowl, cover with plastic wrap, and set it aside for a couple of hours; or, overnight.",
    "When you are ready to make the buns, punch the dough down and divide it in half.  Oil your hands with olive oil.  Take one of the dough halves in your left hand (assuming you’re right handed) and squeeze out between your thumb and index finger a lump of dough about the size of a Ping-Pong ball, and pull it off with your right hand.  Roll it on your oiled palms and set it aside.  Continue until you’ve formed all the dough into balls.",
    "Take a ball of dough and roll it into a snake between your palms.  Using a rolling pin, roll the snake on a lightly greased board into a long, thin strip of dough, about 1 inch wide and 4 to 5 inches long.  Using your fingers, spread a small dab of butter in a thin smear over the dough, then roll the dough up in a tight cylinder.  Continue until all the dough balls have been rolled.",
    "Midway through this process, set a cast-iron griddle on the stove over medium heat and let it heat up while you continue to shape the buns.  When all the buns are all formed, take the first cylinder and pat it between your oiled palms into a disk.  You can use the rolling pin to help with this, but it should not be rolled too flat (thin); they should come out about ⅛ to ¼ inch thick is about right.  Set the “disk” of dough on the hot griddle and let it bake for about 2 minutes to a side; or, until the sides are toasted brown and the inside is cooked through.  They should come out rather flaky because of the layers of butter.  Check the first bun to be sure the temperature of the griddle is correct; adjust accordingly, if necessary.  Continue cooking until they’re all done, keeping the finished warm in the oven until you are ready to serve.",
    "Serve warm with plenty of honey and additional butter for the greedy.",
    "Yield:  Make about 24 small buns.",
    "Source:  The Essentials Mediterranean by Nancy Harmon Jenkins, Harper Collins Publishers, Inc., , ©2003 by Nancy Harmon Jenkins."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "01 - Breakfast"
}