{
  "title": "Old Fashioned Buttermilk Biscuits",
  "requires": "",
  "ingredients": [
    "1 cup buttermilk",
    "4 cups sifted all-purpose flour (sift before measuring)",
    "2 teaspoons baking powder",
    "1 teaspoon salt",
    "1 package active dry yeast",
    "½ cup warm water (use a thermometer to insure its between 105° to 115° F.)",
    "¼ cup, plus a ½-teaspoon of sugar",
    "¼ cup shortening",
    "2 tablespoons butter or margarine, melted"
  ],
  "instructions": [
    "In a small pan, slowly heat the buttermilk until bubbles begin to form around the edge.  Buttermilk will curdle.  Cool it to lukewarm (a drop on the wrist will not feel warm).",
    "Prepare two large cookie sheet, spray with Pam© it they are not “nonstick”, and set aside.",
    "Sift the flour with the baking powder, sugar, and the salt into a large bowl.  Using a pastry blender cut the shortening into the flour mixture.  When it’s well done the mixture will resemble coarse cornmeal, but it doesn’t have to be uniform in appearance.",
    "Sprinkle yeast over warm water (first, check the temperature of the water with a thermometer) in a small bowl and add ½ teaspoon sugar.  Stir until the yeast is dissolved completely and then stir in the lukewarm buttermilk.",
    "Make a well in the center of the flour mixture and pour in the yeast mixture.  Stir around the bowl with a wooden spoon or fork until dough forms.  Turn out the dough onto a floured surface to knead it.  The dough should be fairly stiff at the start of kneading.  To knead, pick up the dough from the far side of the dough and fold it over towards you, then press out lightly with the palm of your hand.  Give the dough a quarter turn and repeat the process.  Continue kneading until the dough is smooth – about 5 minutes if you are working rapidly.  Use a rolling pin to gently roll out the dough from the center all around, to approximately ½-inch thickness.  Use a floured 2-inch biscuit cutter to cup straight into the dough.  Do not twist.  Separate the cut biscuits from the unused trimmings and place the biscuits on one of the prepared cookie sheets, approximately 1-inch apart.  Recombine and roll the trimmings to approximately ½-inch thickness and repeat the process of cutting out the biscuits.  Repeat the process until all the dough is used up (you may have to form the last biscuit by hand).",
    "Cut a piece of wax paper of sufficient length to cover the biscuits and use Pam© to spray the side of the wax paper that will be in contact with the top of the biscuits.  Use a fork and prick the top of the biscuits two or three times.  Lay the wax paper on top of the biscuits and top the wax paper loosely with a kitchen towel.  Place the trays of biscuits, covered as explained above, in a draft free place that is also warm (a temperature of approximately 85° F. is ideal), and if the humidity is up so much the better.  Let the biscuits rise for half hour.",
    "Check the biscuits after half hour, they should have risen to about 1-inch high and doubled in bulk (which is why you shouldn’t crowd them on the cookie sheets).  If they are rising slower, then allow up to an hour for them to rise.",
    "Preheat the oven to 400° F. and melt the butter, or margarine.",
    "Remove the kitchen towel and carefully remove the wax paper so as not to cause the biscuits to fall.  Before placing them in the oven brush the tops lightly with the melted butter, or margarine.  Bake them for 10 to 12 minutes, or until the tops are golden-brown.",
    "Serve them while still warm with butter and honey."
  ],
  "remarks": "If the dough is too soft the biscuits will spread horizontally excessively while rising.  The dough, when you begin to knead it should be “stiff” and not sticking to your hands as you knead it and as it “comes together”.  If it is too “wet” and “sticky” you need to incorporate flour during the kneading process.  For, this reason the kneading process may take a little longer than the time indicated; but, don’t knead excessively or the biscuits will come out very stiff and hard.",
  "yield": "Makes about 30 biscuits.",
  "source": "McCall’s Cooking School, Number 7, Viennese Breakfast Cake, © 1979, 1980 by the McCall Publishing Company, 230 Park Avenue, New York, N.Y. 10169.",
  "category": "01 - Breakfast"
}