{
  "title": "Prune Roll (Great-Grandma’s)",
  "requires": "",
  "ingredients": [
    "For the dough –",
    "1 package (¼ ounce) active dry yeast",
    "1 cup warm milk (110° to 115° F.)",
    "½ cup butter, softened",
    "½ cup shortening",
    "3 tablespoons sugar",
    "1 teaspoon salt",
    "3 egg yolks",
    "4 cups all-purpose flour",
    "For the filling –",
    "2 cups pitted dried prunes",
    "½ cup water",
    "½ cup sugar",
    "2 tablespoons lemon juice",
    "¼ cup butter",
    "½ teaspoon cinnamon",
    "For the glaze –",
    "1 cup confectioners’ sugar",
    "¼ teaspoon vanilla extract",
    "2 to 3 tablespoons water"
  ],
  "instructions": [
    "The day ahead –",
    "In a large mixing bowl, dissolve the yeast in the warm milk.  Then add the softened butter, the shortening, the sugar and salt and mix all the ingredients well.  When well mixed add the three egg yolks and a cup of the flour.  Using an electric mixer with pastry paddles work the flour into the liquid mixture until you obtain a smooth mixture; then add the remaining flour one cup at a time.  Work the flour into the mixture before adding any subsequent cups of flour.  The final product should be a soft dough.",
    "Cover the bowl with plastic wrap and refrigerate overnight.",
    "In a saucepan, cook the prunes in the water for 12 to 15 minutes; or, until all the liquid has been absorbed.  Using a potato masher, or so other tool, mash the prunes as you add the sugar and lemon juice.  Return to the heat and continue cooking for 8 to 10 minutes more over low heat; or, until the mixture thickens and reaches a consistency of your choosing.  Remove from the heat and refrigerate.",
    "To make-",
    "Turn the dough onto a lightly floured surface.  Coat the dough ball with flour to handle without sticking and cut the dough ball in half.  Roll each portion into a 13- by 9-inch a roughly rectangular form; don’t worry about the thickness.  Dot the dough with half of the butter cut into small bits and sprinkle with cinnamon.  Spread about ⅓ cup of the filling down the center of the dough.  Fold a third of the dough, lengthwise over the filling.  Spread another ⅓ cup of the filling, again over the center of the dough, lengthwise.  Fold the opposite side of the dough over the top, enclosing the filling, and extend it to overlap marginally.  Using your fingers, pinch the dough to form a seam underneath the overlapping edge.",
    "Place the prune rolls on a greased 15- by 10- by 1-inch baking pans with the seam tucked under; or, use parchment paper in the pan and greasing won’t be necessary.  Cover the completed prune rolls with plastic wrap and allow them to rise in a warm place for 2 hours; or, until they double in size.",
    "Preheat the oven at 350° F.",
    "Bake for 20 to 30 minutes; or, until they turn golden brown.  Remove the oven and using spatulas remove the prune rolls from the baking pan and place on wire rack to cool.",
    "Combine the glaze ingredients and drizzle over the cooling roles.",
    "Yield:  Makes 2 loaves.",
    "Source:  A Taste of the Country, Submitted by Marci Kulla, Brush Prairie, , Country Magazine, February/March 2005.",
    "Great Grandma’ Prune Rolls"
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "01 - Breakfast"
}