{
  "title": "Raised Belgian Waffles",
  "requires": "",
  "ingredients": [
    "1 envelope active dry yeast",
    "2 eggs; yolk and egg white separated (place the egg white in a bowl for beating with a blender)",
    "½ cup warm water (from 105° to 115° F., if you can use a thermometer for best results)",
    "3 cups unbleached all-purpose flour (it’s best to sift before using)",
    "5½ tablespoons sugar",
    "¼ teaspoon salt",
    "2 cups warm milk (same temperature as indicated for the water, above)",
    "1 stick (½-cup) butter, melted",
    "1 tablespoon vanilla"
  ],
  "instructions": [
    "Into a mixing bowl sift together the flour, 5 tablespoons of sugar, and the salt.",
    "Pour the warm water into a cup or small bowl and dissolve in it ½ teaspoon of sugar; then cut open and pour the dry yeast and dissolve it in the water.  When the yeast begins to work (actively begins to expand and bubble) pour it into the dry ingredients.  Add the warm milk, egg yolks, the melted butter, and the vanilla.  Using a blender beat the ingredients into a smooth batter.  When done cover the bowl with a piece of plastic wrap and allow the batter to rise for 30 minutes; preferably in a warm humid place.",
    "Start heating a Norwegian Waffle Iron (four 7½-inch squares waffle pattern) on both sides on the stove over moderately high heat.  If the waffle iron has a temperature gage, it should indicate that both sides are “hot,” before you use it.",
    "Just before you continue with the recipe beat the two egg whites with a blender until they hold stiff peaks.  After the batter has had a chance to rise for 30 minutes fold the beaten egg whites into the batter carefully. (Use a whisk and slowly and deliberately work the egg whites into the batter.  Work slowly otherwise the incorporation of the beaten egg whites won’t achieve the desired result – adding body (air) to the batter.)",
    "Working quickly, open the heated waffle iron and with a brush spread some oil on both sides of the waffle iron; then pour at least a ½ cup of the batter into the center of the waffle iron.  Close the lid and cook the waffles over the moderately high heat for about 2 minutes on each side; or, until you can open the waffle iron easily and check to ensure that the waffle is crisp and golden.  (Use a fork as you open the waffle iron to assist you in keeping the waffle iron from pulling the waffle apart – use the fork’s tines to pull the waffle free of the waffle iron.)  When the waffle is done transfer it with your fork to a rack and keep it warm inside your oven set at very low (200° F.).",
    "Make waffles with the remaining batter in the same manner.",
    "Serve the waffles with raspberry puree and whipped cream; or, with your favorite syrup."
  ],
  "remarks": "An electric waffle iron may also be used but ensure that you use the electric waffle iron according to the manufacture’s instructions.",
  "yield": "",
  "source": "Waffles, Gourmet Magazine, May 1976.",
  "category": "01 - Breakfast"
}