{
  "title": "Sweet Cinnamon Rolls",
  "requires": "",
  "ingredients": [
    "For the Monkey Bread Dough",
    "1 cup milk",
    "1 tablespoon plus 1 teaspoon active dry yeast (1-½ packages",
    "¼ cup sugar",
    "1 teaspoon kosher salt",
    "½ cup (1 stick) unsalted butter, melted, plus additional for the cake pan",
    "3 ¼ cups all-purpose flour, sifted",
    "For the Sweet Cinnamon Filling",
    "½ cup (1 stick) slightly softened unsalted butter",
    "1 ¼ cups light brown sugar",
    "2 tablespoons granulated sugar",
    "2 ½ tablespoons ground cinnamon",
    "For the Frosting",
    "2 ounces cream cheese",
    "1 cup confectioners' sugar",
    "2 tablespoons milk"
  ],
  "instructions": [
    "To prepare the dough, pour the milk into a saucepan and set over medium heat for 2 to 3 minutes, or until lukewarm (but not hot), about 110 ° F.  Transfer the milk to the bowl of an electric mixer fitted with a paddle attachment.   Add the yeast and a pinch of the sugar and let stand for about 5 minutes, until the yeast is dissolved.  add the remaining sugar, the salt and the melted butter and gradually stir in the flour, until the dough forms.  Transfer dough to a lightly oiled bowl, cover with plastic wrap and let rise in a warm place for about an hour.",
    "While the dough is rising, prepare the cinnamon filling.  Place the butter, brown and granulated sugars, and cinnamon in a small bowl and stir until smooth set aside.",
    "To prepare the frosting, place the cream cheese in the bowl of an electric mixer fitted with a paddle attachment and beat on low speed for 3 or 4 minutes until soft.  Add the sugar and milk and mix until incorporated.  Set aside.",
    "Preheat the oven to 350° F.  Lightly butter a 9 by 11-inch cake pan and set aside.",
    "Turn out the dough onto a lightly floured work surface and roll out to a thickness of ¼ inch.  Spread the cinnamon filling evenly over the dough and then roll up the shorter side of the dough to form a long log.  Cut the dough into 12 strips about 1½ inches wide.  Lay each slice on the prepared cake pan with the cut side up; it is fine if the rolls are touching one another.  Use a second pan if necessary.  Let the cinnamon rolls rise in a warm place for 20 minutes.",
    "Bake the rolls for 14 minutes or until golden brown.  Remove the pan from the oven, spread the frosting evenly over all the cinnamon rolls, server immediately."
  ],
  "remarks": "",
  "yield": "",
  "source": "Neiman Marcus Taste by Kevin Garvin.",
  "category": "01 - Breakfast"
}