{
  "title": "Shrimp Ceviche Cocktail (Ceviche de Camarón)",
  "requires": "",
  "ingredients": [
    "½ cup plus 2 tablespoons of fresh lime juice",
    "1 pound unpeeled “smallish” shrimp (the ones that run 41 to 50 per pound)",
    "½ medium white onion, chopped into small ¼-inch pieces",
    "⅓ cup chopped fresh cilantro, plus several extra sprigs for the garnish",
    "½ cup ketchup",
    "1 to 2 tablespoons of vinegary Mexican bottled hot sauce (Tamazula, Cholula, Valentina,",
    "Búfalo, the last one listed being on the sweet side)",
    "2 tablespoons olive oil, preferably extra-virgin",
    "1 cup diced peeled cucumber or jícama (or ½ cup of each)",
    "1 small ripe avocado, peeled, pitted, and cubed",
    "Salt",
    "Several lime slices for the garnish",
    "Tostadas or tortilla chips, store-bought or homemade; or, saltine crackers for serving"
  ],
  "instructions": [
    "Bring a quart of salted water to a boil and add 2 tablespoons of lime juice.  Scoop in the shrimp, cover and let the water return to boil.  Immediately remove from the heat and pour off all the liquid.  Replace the cover on the pot and set aside to let the shrimp continue to steam in their own heat for 10 minutes.  (Be sure not to place the pot back on the hot grill).",
    "When the shrimp can be handled peel and devein them, one by one, by laying the shrimp on your work surface, making a shallow incision down the back and scraping out the (usually) dark intestinal tract.  When all have been deveined place the shrimp in a bowl and toss them with the remaining ½ cup lime juice, cover and refrigerate for about one hour.",
    "In a small strainer, rinse the onion under cold water, then shake off the excess liquid.  Add the onion to the shrimp in the bowl along with the cilantro, ketchup, hot sauce, olive oil, cucumber and/or jícama and avocado.  Taste and season the mixture with salt (usually, it requires about ½ teaspoon).  If you are not serving immediately cover the bowl and refrigerate.",
    "Spoon the ceviche into sundae or martini glasses or small bowls.  Garnish with sprigs of cilantro and a slice of lime and serve with tostadas or tortilla chips (saltine crackers are also used in some places).",
    "Remarks:  For my tastes leave off the avocado.  Also, from my preferences use key limes instead of the large regular limes.",
    "Yield:  Makes 3 cups.  As an appetizer it will serve 6.",
    "Source:  Mexico One Plate at a Time by Rick Bayless, Scribner, 1230 Avenue of the Americas, New York, NY 10020, ©2000 by Rick Bayless.",
    "Ceviche de Camaron"
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "03 - Appetizers"
}