{
  "title": "Alsatian Inn’s Rosemary Chicken",
  "requires": "",
  "ingredients": [
    "For the Chicken –",
    "3 pounds Chicken pieces (your choice of cuts)",
    "Lemon pepper",
    "Garlic, mashed into a paste (enough to rub into all the chicken pieces)",
    "Dried chicken bullion base",
    "For the Sauce –",
    "5 tablespoons of olive oil, divided use",
    "2 yellow onions, chopped",
    "4 large garlic cloves, chopped",
    "48 ounces of canned whole, peeled tomatoes, with their juice puréed",
    "1 (6-ounce) can of tomato paste",
    "2 teaspoons sugar, or more, to taste (but it’s optional)",
    "2 large sprigs (about ⅓ cup) fresh rosemary, leaves only, finely chopped",
    "2 teaspoons dried Italian seasoning or spaghetti sauce seasoning (from packet)",
    "2 teaspoons dried chicken bouillon base"
  ],
  "instructions": [
    "In a large saucepan, set over medium heat, heat 1 tablespoon oil and sauté all the onion until it’s translucent before adding the chopped garlic.  Continue sautéing for an additional minute.  Add the puréed tomatoes, the tomato paste, the sugar, the rosemary sprigs, the dried Italian seasoning (or dried spaghetti sauce seasoning), and the dried chicken bouillon base.  Stir to combine all the ingredients, and dissolve the tomato paste, reduce the heat setting to low and cook the sauce, stirring frequently, for 1½ to 2 hours; until the sauce is sufficiently thickened.  (If the sauce comes to a boil reduce the heat further; attempt to cook the sauce at a gentle simmer for the entire time.)",
    "When the sauce is thickened to your satisfaction add the remaining 4 tablespoons of olive oil; stir well, to combine the olive oil into the sauce and taste.  If needed, adjust the sweetness by adding more sugar.  Set the sauce aside until the chicken is done.",
    "Clean, remove excess fat, rinse and pat dry all the chicken pieces.  Rub the garlic paste over all the chicken pieces then season with the lemon pepper and a light sprinkling of the chicken bouillon base.  (The author of the recipe tested the Alsatian Inn of Castroville’s recipe using “Better Than Bouillon” brand.)",
    "Set the chicken pieces aside until you have the charcoal fire burning hot.  Grill the chicken pieces over the hot coals until the pieces are done being careful not to over cook the chicken.  (It’s best if you use a meat thermometer to insure that the chicken pieces have been cooked to the degree specified for poultry.)  Alternatively, the chicken may be baked in your oven.",
    "Place the grilled chicken pieces in a serving bowl and spoon the sauce over the chicken.  (Alternatively, place the chicken on individual plates and spoon the sauce over the chicken.)"
  ],
  "remarks": "At the Alsatian Inn this rosemary chicken is served over a plate of fettuccine.  However, the Alsatian Inn also uses this sauce with meatballs and simply ladled over a plate of pasta. Nutritional value per serving in the recipe as written:  74 g. protein, 21 g. carbohydrate, 4 g. dietary fiber, 28 g. fat, 295 mg. cholesterol, and 1560 mg. sodium. Yield:  Serves 6. Source:  Chefs’ Secrets by Pat Mozersky, Taste Section,  Express-News, Wednesday, April 11, 2007.",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}