{
  "title": "Andalucian Spiced Pork Skewers (Pinchitos Morunos)",
  "requires": "",
  "ingredients": [
    "2 garlic cloves, minced",
    "1 teaspoon sea salt",
    "1 teaspoon coriander seeds",
    "1 teaspoon cumin seeds",
    "¼ teaspoon turmeric",
    "2 teaspoons mildly hot Spanish paprika (pimentón de la Vera if available)",
    "Black pepper, preferably freshly ground",
    "3 tablespoons extra-virgin olive oil",
    "1 tablespoon fresh lemon juice",
    "1¼ pounds fresh pork country boneless ribs; fat removed and cut into small 1-inch size chunks"
  ],
  "instructions": [
    "If you are using bamboo skewers, which are best for this, soak them in water for at least 30 minutes.",
    "Crush the garlic with the salt in a mortar until you have a paste.  If you don’t have a mortar use instead a small bowl and the back of a spoon.  Combine the coriander seeds and cumin seeds in a small dry skillet.  Set it over medium-low heat and toast the seeds for several minutes, until the aromas start to rise.  Transfer the spices to the mortar with the garlic paste and pound (break and grind the seeds) gently into the paste.  Mix in the turmeric, paprika, lots of black pepper, the olive oil, and the lemon juice.  Transfer this mixture to a shallow plate.",
    "Thread the pieces of pork onto the skewers; turn the skewers in the marinating mixture to coat the meat pieces well, on all sides, and then set the skewers aside for an hour or so.",
    "When you are ready to cook, prepare a charcoal fire and let the coals burn down until they are uniformly “ash white.”  When the fire is ready grill the skewers (set the skewers as low over the bed of coals as the grill allows).  Cooking time will depend on the intensity of the heat from the charcoal.  If the temperature is right, the skewers will require turning them only once, for a total cooking time of 5 to 6 minutes.  However, I’ve found that most times I have to keep some on the grill longer.  (Regardless, I have never had a disappointment.)",
    "Serve immediately."
  ],
  "remarks": "Don’t try this recipe with very lean pork as the meat will simply dry out while cooking.  For best results buy a cut of pork that has fat mixed in with the lean; for example, “country style” boneless ribs. You can also cook the skewers under an oven broiler.  Preheat the oven broiler for at least 20 minutes before starting to broil the skewers. Yield:  Make 8 to 10 “appetizer size” servings. Source:  The Essentials Mediterranean by Nancy Harmon Jenkins, Harper Collins Publishers, Inc., , ©2003 by Nancy Harmon Jenkins.",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}