{
  "title": "Baked Ham",
  "requires": "",
  "ingredients": [
    "1 “ready to eat” ham, bone in, about 7 to 8 pounds",
    "¼ cup apricot jam",
    "½ cup brown sugar",
    "2 tablespoons dark rum",
    "Whole cloves",
    "Pineapple rings",
    "Marichino cherries",
    "2 to 3 cups of chicken stock",
    "¼ cup white wine"
  ],
  "instructions": [
    "Preheat the oven to 300° F.",
    "If, after you remove the ham from its wrapping you find the need to trim away fat or tough skin, do so.  Place the ham in a baking pan, fatter side up, and with a sharp knife score the ham, using a diagonal cut in opposite directions to create a diamond pattern.",
    "Mix the apricot jam, brown sugar, and rum.  When well mixed, apply the mixture to the ham then insert the whole cloves.  It’s a good idea to place the cloves into the ham using the scoring cuts as the guide for where to insert the cloves.  When the cloves are inserted place the pineapple rings on the ham and secure them if necessary with toothpicks.  Finally, place a cherry in the center of each pineapple ring.  To the pan add 2 cups of chicken stock.",
    "A good roasting guideline is “about 15 minutes per pound,” but if you can use a thermometer and roast the ham until the internal temperature reaches 140° F.",
    "Place the ham in the middle rack of the oven and roast.  About “half way” through the roasting time, increase the oven to 350° F. and begin basting the ham every 15 minutes.  If the sugar starts to burn the bottom of the pan, keep adding more chicken stock, or water.",
    "When the ham is finished roasting, remove it to a cutting board and let it rest for 15 minutes before carving.  Meanwhile, deglaze the pan with the wine and add in any remaining stock.  Reduce to make a sauce to serve with the ham.  (Alternatively, serve the ham with a selection of mustards and chutneys.)",
    "Yield:  Will depend on the size of the ham; a 7 to 8 pound ham will serve 8 to 10.",
    "Source:  The recipe above is based on one by Amy Stevenson, posted on The Food Network in 2001, which I made on Christmas 2001."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}