{
  "title": "Baked Beefsteak with Hot Pepper Sauce Ingredients. For the sauce: 1 small onion, minced 1 tablespoon minced garlic 3 tablespoons oil (original recipe calls for peanut oil but corn oil will do) 2 corn tortillas, torn into small pieces 3 cups drained and chopped canned tomatoes 2 pickled jalapeño peppers For the steak: 3 pounds boneless beef chuck, ¾ inch thick, cut into 6 portions ¼ cup oil (original recipe calls for peanut oil but corn oil will do) 3 onions, sliced into rings 1 pound boiling potatoes, peeled, sliced thin, and reserved in a bowl of cold water 2 corn tortillas cut into strips 1 cup shredded sharp Cheddar cheese ½ cup minced green onions",
  "requires": "",
  "ingredients": [],
  "instructions": [
    "In a saucepan cook the onion in the oil over medium-high heat until they are tender and translucent; however, halfway through cooking the onion add the garlic.  Transfer the mixture to a blender or food processor.  Add the tortillas, the tomatoes, and the jalapeño peppers and purée the mixture until it is smooth.  Transfer the purée mixture to a saucepan and bring it to a boil, stirring occasionally, and season it with salt and pepper.  Remove the saucepan for the heat and cover it loosely.",
    "In a large skillet brown the beef chuck in batches in 2 tablespoons of the oil over moderately high heat, transfer them to a shallow 3- to 4-quart baking dish and sprinkle with salt and pepper.  In the oil remaining in the skillet cook the onion rings, stirring, until they are golden and spread them over the chuck.  Pour the purée mixture over the beef chuck and onions.  Cover the dish loosely.  The dish may be prepared up to this point several hours in advance.",
    "Add the potatoes, drained, to the dish and bake it, covered, in a preheated oven, 350° F., for 1 hour, to 1½ hours, or until the chuck is very tender.  In a small skillet heat the remaining 2 tablespoons of oil over moderately high heat until it is very hot and in it cook the tortilla strips, stirring, until they are crisp and golden.  Drain the tortilla strips on paper towels and sprinkle them, the Cheddar and green onions over the dish and serve.",
    "Yield:  Serves 6.",
    "Source:  Oven to Table Entrées by Sally Tager, Gourmet Magazine, March 1984."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}