{
  "title": "Beef Stew (Semur)",
  "requires": "",
  "ingredients": [
    "1 pound 5 ounces beef, cut into small 1-inch cubes",
    "2 slices ginger root",
    "4 garlic cloves, peeled and quartered",
    "2 tablespoons oil",
    "4 fresh red chili peppers, seeded and ground into a paste",
    "1 piece cinnamon stick, 1¼-inches long",
    "2 cardamon seeds",
    "3 whole cloves",
    "2 segments of star anise",
    "1 stem lemongrass, lightly crushed",
    "1 piece of galangal root the size of a walnut, lightly crushed",
    "1½ cups water",
    "½ cup dark soy sauce",
    "1 piece tamarind pulp, sliced",
    "1 tablespoons sugar",
    "Salt to taste"
  ],
  "instructions": [
    "Grind the ginger and garlic into a paste in a mortar.  Heat the oil in a pan and fry the ginger and garlic paste until the flavors have developed.  Gently fry the chili paste, then add all the other herbs and spices including the lemongrass and galangal and continue cooking.  Deglaze the pan with the water and soy sauce, tamarind slices, and sugar.  When the mixture comes to a boil add the beef and bring back to a boil.  When it returns to a boil reduce the heat and simmer until the meat is tender.  Season with salt to your taste shortly before the end of the cooking time.",
    "Remarks:  This dish known as semur in Malaysia and Indonesia is called “adobo” in the Philippines and is called “soy sauce stew” in China.  Basically it consists of beef, chicken, or fish braised in soy sauce base, combined with other ingredients which vary from country to country.  Malaysians and Indonesians add the tamarind pulp and chili peppers, Filipinos add rice vinegar and peppercorns, and the Chinese spice it with star anise and five-spice powder.  All use garlic, either ground to a paste or in whole cloves.  The dish tastes even better when re-heated (the addition of vinegar or tamarind pulp improves its keeping qualities.",
    "Yield:  Serves 4 to 6.",
    "Source:  Southeast Asian Specialties:  A Culinary Journey, Culinaria Könemann, © 1998 Könemann Verlagsgesellschaft mbH, Bonner Strasse 126 · D-50968 Cologne."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}