{
  "title": "Beef Short Ribs a la Mexicana (Costillas de Res a la Mexicana)",
  "requires": "",
  "ingredients": [
    "5 medium (about 1 pound total) fresh poblano chiles",
    "2 tablespoons pork lard or vegetable oil",
    "2 pounds beef short-ribs, trimmed of excess fat",
    "1 large white onion, sliced",
    "6 garlic cloves, peeled and finely chopped",
    "1½ pounds (either 3 medium-large round or 9 to 12 plum) ripe tomatoes, peeled, seeded, and",
    "chopped (approximately ½-inch pieces; or, a 28-ounce can of whole tomatoes, drained,",
    "and chopped into ½-inch pieces)",
    "Salt",
    "1 large sprig fresh epazote, plus and additional sprig (optional) for garnish; or, 1½ teaspoons",
    "chopped fresh thyme and/or marjoram, plus a sprig or to for garnish"
  ],
  "instructions": [
    "Roast the poblanos directly over a gas flame or on a baking sheet 4 inches below a very hot broiler, turning regularly until the skin has blistered and blackened on all sides, about 5 minutes for and open flame, about 10 minutes for the broiler.  Be careful not to char the flesh, only the skin.  Cover with a kitchen towel and let stand for 5 minutes.  (I prefer to place inside a plastic bag and tie it closed.)  Rub off the blackened skin, then pull out the stems and seeds.  Tear the chiles open and rinse briefly in cold water to remove any stray seeds and bits of skin.  Slice them into ¼-inch strips.",
    "Preheat the oven to 325° F.",
    "In a medium-large (4 to 6-quart) pot (preferably a Dutch oven or Mexican “cazuela”, heat the lard or oil over medium-high heat.  Lay in the short-ribs in a single, uncrowded  layer, working in batches if necessary.  When richly browned on one side, about 5 minutes if hot enough, turn them over and brown the other side, 3 to 5 minutes more.  Remove them to a plate when browned remove all but a generous coating of oil on the bottom of the pot.",
    "Set the pot back on the stove and reduce the heat to medium.  Add the onion and cook, stirring frequently, until golden, about 7 minutes.  Add the garlic and stir for another minute, then add the tomatoes.  Stir occasionally until the tomatoes have softened and lost their “juicy look” (about 3 minutes of fresh tomatoes, 3 to 5 minutes for canned.  Stir in the poblano strips, 1 teaspoon salt and the herb, or herbs, that you intend to use.",
    "Nestle the browned meat into the tomato mixture, spooning some of it over the tops of the short-ribs.  Cover the pot (a piece of foil will work perfectly for a cazuela and set in the oven.  After 1½ hours, check the meat:  it should be fork-tender.  If not, re-cover and braise for an extra 15 minutes or so.",
    "Using a spatula, remove the meat to a warm serving platter.  Tip the pot to collect the chunky sauce at one side and spoon off the fat that rises to the top.  Taste the sauce and season with additional salt if you think it needs it.  Spoon the sauce around the meat."
  ],
  "remarks": "This dish doesn’t actually need a garnish, but if you have company use a sprig of epazote, or thyme and marjoram, it will look beautiful. There is a warm hominess to this dish if it’s made a day or two ahead and stored in the refrigerator until you are ready to reheat it (this may be done in a covered pot on the stove or in an oven set at 325° F.  First discard any solidified fat from the surface.  For a “just-braised” texture (and to ensure that your guests’ mouths water from the aromas) you can prepare the dish through the point where you have the browned spare-ribs and the sauce ready to place together and put in the oven.  Store the two things separately in the refrigerator.  On the day you are to serve the dish, start at least two hours before the guest arrive, and finish the preparation. The finished dish will hold very well for an hour or so in a very low oven. Finally, this dish makes excellent tacos.  Accompany with rice and beans.  [For me leave off the beans and substitute a salad.] Yield:  Serves 4. Source:  Mexico One Plate at a Time by Rick Bayless, Scribner, 1230 Avenue of the Americas, New York, NY 10020, ©2000 by Rick Bayless.",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}