{
  "title": "Beer-Braised Brisket with Root Vegetables Recipe courtesy Gourmet Magazine Brisket:\n2 1/2-pound piece beef brisket, preferably from the point cut (also called the 2nd cut)\nSalt and freshly ground black pepper\n4 slices bacon, chopped\n3 onions, thinly sliced \n2 tablespoons tomato paste\n4 (12 ounce) lager-style beers \n3 sprigs fresh flat-leaf parsley, plus chopped leaves for garnish\n3 sprigs fresh thyme \n1 bay leaf\n1 large rutabaga (about 2 pounds), peeled and cut into 1-inch pieces\n6 medium carrots, cut crosswise into 1-inch-thick pieces\n6 medium waxy-style potatoes, unpeeled and cut into 1-inch pieces\n\nBeurre manie:\n2 tablespoons unsalted butter, softened \n2 tablespoons all-purpose flour\n\nServing Suggestions: Buttered egg noodles Make the brisket: Preheat the oven to 350 degrees. Pat the brisket dry and season with salt and pepper. In a Dutch oven with a tight-fitting lid, cook the bacon over moderate heat, stirring, until crispy and its fat has rendered. Using a slotted spoon, transfer to paper towels to drain, and pour off all but 2 tablespoons of the fat. Heat the remaining fat over moderately high heat until it is hot but not smoking. Brown the brisket all over and transfer it to a platter. Add the onions to the Dutch oven and cook until golden brown. Add the tomato paste and cook, stirring, until caramelized, about 1 minute. Add the bacon, brisket, and beer and bring to a boil. Tie the parsley sprigs, thyme, and bay leaf together with a piece of kitchen twine and add to the Dutch oven. Cover and braise the brisket in the oven for 2 hours. Stir in the rutabaga, carrots, and potatoes and continue braising until the brisket and vegetables are tender, about 45 minutes more. Transfer the brisket and the vegetables to a platter and set aside covered with foil to keep warm. Boil the braising liquid it until it is reduced to about 3 cups. Meanwhile, make the beurre manie: In a small bowl, blend the butter and flour together to make a paste. Whisk the beurre manie into the reduced braising liquid, bit by bit, whisking well after each addition. Simmer the sauce for 3 minutes and season it with salt and pepper. Slice the brisket against the grain, on the diagonal, and arrange it on the platter. Surround the brisket with the vegetables, spoon some of the sauce over the top, and sprinkle with the chopped parsley. Pass the remaining sauce at the table. Serve with the buttered noodles. Yield: 6 to 8 servings\nPrep Time: 20 minutes\nCook Time: 3 hours 30 minutes\nDifficulty: Medium",
  "requires": "",
  "ingredients": [],
  "instructions": [],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}