{
  "title": "Pork Chops",
  "requires": "",
  "ingredients": [
    "4 pork loins chops, cut 1½ inch thick",
    "Salt and pepper",
    "2 tablespoons oil",
    "1 ounce kirsch, heated",
    "¼ cup beef stock",
    "1 (17-ounce can) pitted dark sweet cherries",
    "½ teaspoon nutmeg",
    "½ teaspoon cloves",
    "½ teaspoon marjoram",
    "½ teaspoon grated lemon rind",
    "2 tablespoons lemon juice",
    "2 teaspoons cornstarch",
    "1 teaspoon Bovril",
    "½ cup chopped and toasted walnuts (prepared ahead)"
  ],
  "instructions": [
    "Trim the excess fat from the pork chops.  Salt and pepper them generously and set aside.",
    "Heat the oil in a skillet over medium heat; and when the oil is barely smoking add the pork chops and cook them until they are browned on both sides.  Remove as much of the fat from the pan; but if need be remove the pork chops temporarily to better drain the fat from the skillet.  If you removed the pork chops to drain the fat return them to the skillet and set the pan back on the heat source; bring the pork chops back to temperature.  In a flame proof measuring cup or ladle warm the Kirsch and light it.  Pour the flaming Kirsch over the pork chops and flambé the pork chops with the heated Kirsch.  When the flames die out pour in the beef stock, cover the skillet.  Lower the heat to low and simmer the pork chops for 1 hour.",
    "Meanwhile, drain the syrup from the cherries into a sauce pan; and set the cherries aside.  To the syrup add the seasonings and the lemon rind.  Mix the lemon juice and cornstarch together and mix to blend the two ingredients.  Heat the syrup mixture over low heat and add to it the cornstarch/lemon juice mixture slowly.  Cook the syrup mixture slowly until the sauce is thick and glossy then add in the Bovril.",
    "After the pork chops have cooked for 45 minutes uncover and pour the syrup mixture into the skillet with the pork chops.  Cover and allow the pork chops to cook for the specified hour.  Just before serving lower the heat to a bare simmer and add the reserved cherries and walnuts.  Allow the cherries and walnuts to warm through and serve.",
    "Remarks:  Serve with potato pancakes.  A dry red or white wine is needed to balance the sweetness of this dish.  If you would like a white wine, consider a Riesling or ; or, if you would like a red wine, a Zinfandel or Bardolino would serve well.",
    "Yield:  Serves 4.",
    "Source:  The Winning Combination is Meats with Fruit by Jinx Morgan, Bon Appétit, October 1977.",
    "pork chops"
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}