{
  "title": "Boiled Meat in Sauce: Lesso in Salsa Recipe copyright Mario Batali, 2002. All rights reserved 2 pounds beef, top round\n2 carrots\n1 onion, halved\n1 rib celery\n2 peppercorns\n2 cloves\n8 cups water\nSalt and pepper\n2 tablespoons pork fat, softened\n1/4 pound pancetta, finely chopped\n1 onion, finely chopped\n2 tablespoons all-purpose flour\n1 cup brown chicken stock, hot, recipe follows\n3 large potatoes, peeled and cut into 1/4-inch dice\n2 red bell peppers, seeds, stems and pith removed, coarsely chopped\n2 tablespoons extra-virgin olive oil\n1 clove garlic, finely chopped\n1 tablespoon white wine vinegar\n2 tablespoons capers, rinsed\n1 tablespoon sugar In a stew pot place beef, carrots, onion, celery, peppercorns, cloves and water. Bring water to a boil, reduce heat and simmer for 1 hour and 15 minutes. Remove pot from heat, cool and strain off liquid and aromatics. Slice the boiled meat and season with salt and pepper. Add 1 tablespoon pork fat to a large pan, heat over medium heat and add the sliced meat and cook until browned on both sides. Set aside. In a large, heavy-bottomed skillet, heat the pancetta over medium heat until it releases its fat, then add the remaining pork fat and onion and brown it in the fat. Sprinkle the flour over and stir well over medium-high heat with a wooden spoon for 5 minutes. Stir in the hot chicken stock, then add the diced potatoes, cover, and cook over medium-high heat for 20 minutes. After 20 minutes, when the potatoes are very tender and the flavors have melded, add the reserved boiled meat to the broth. In a large saute pan, heat the olive oil over medium-high heat, add the garlic, and cook over medium until it is browned and softened. Stir in the peppers, vinegar, capers, and sugar, cook over high heat 1 minute, then remove from the heat. Serve the sliced meat with some of its cooking liquid and some of the pepper sauce drizzled over. Brown Chicken Stock:\n2 tablespoons extra-virgin olive oil \n3 1/2 pounds chicken wings, backs, and bones\n3 carrots, coarsely chopped\n2 onions, coarsely chopped\n4 ribs celery, coarsely chopped\n2 tablespoons tomato paste \n1 tablespoon black peppercorns\n1 bunch parsley stems In a large, heavy-bottomed saucepan, heat the oil over high heat until smoking. Add all the chicken parts and brown all over, stirring to avoid burning. Remove the chicken and reserve. Add the carrots, onions, and celery to the pot and cook until soft and browned. Return the chicken to the pot and add 3 quarts of water, the tomato paste, peppercorns, and parsley. Stir with a wooden spoon to dislodge the browned chicken and vegetables bits from the bottom of the pan. Bring almost to a boil, then reduce heat and cook at a low simmer until reduced by half, about 2 hours, occasionally skimming excess fat. Remove from heat, strain, and press on the solids with the bottom of a ladle to extract out all liquids. Stir the stock to facilitate cooling and set aside. Refrigerate stock in small containers for up to a week or freeze for up to 1 month. Yield: 1 1/2 quarts Yield: 6 servings\nPrep Time: 20 minutes\nCook Time: 4 hours 30 minutes\nDifficulty: Medium",
  "requires": "",
  "ingredients": [],
  "instructions": [],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}