{
  "title": "Boneless Pork Loin Requires:  The recipe for “herbes de Provence” is in the “Miscellaneous” < “Advise” folder.  Additionally, you might need to check out the pictures in the same folder to see how to remove the “silver skin” from the pork loin.",
  "requires": "",
  "ingredients": [
    "One 4-pound boneless pork loin, well trimmed of all fat, “silver skin” and sinews",
    "1¼ teaspoon salt",
    "½ teaspoon freshly ground black pepper",
    "2 teaspoons “herbes de Provence”",
    "2 tablespoons butter",
    "1 tablespoon vegetable oil",
    "5 large Golden Delicious apples, peel on, cored and cut into wedges (approximately 7 cups)",
    "¼ teaspoon sugar"
  ],
  "instructions": [
    "Preheat the oven to 375° F.",
    "Sprinkle 1 teaspoon of salt, ¼ teaspoon of pepper and all of the “herbes de Provence” all over the pork, and rub in the seasonings so that they adhere.  Set the baking dish (or roasting pan) over high heat with the butter and oil.  When it is sizzling, lay in the roast and brown it over medium-high heat, browning, to create a caramelized brown layer on all sides of the roast, about 6 to 8 minutes.",
    "Remove from the heat, lift the roast out of the baking dish, and set it on a plate or cutting board.  Spread the apple slices on the bottom of the baking dish and sprinkle the sugar and the remaining ¼ teaspoon of salt and pepper over them.  Replace the roast on the bed of apples.",
    "Set the dish in the oven and roast for about 1 hour, basting occasionally with the juices that will accumulate in the bottom of the roasting pan.  After 50 minutes, start checking the internal temperature with a meat thermometer inserted into the thickest part of the pork loin.  Roast the loin to a temperature of 150° F.  When the pork loin reaches the 150° F. remove it from the oven, and let it rest for about 10 minutes.",
    "Slice the pork loin “crosswise” into thin slices, and serve on top of the apples, right in the baking dish if you like.  Or, remove the roast to a cutting board, scoop out the apples into a large serving platter, and spread them to from a ring around the edge of the platter.  Arrange the pork slices, and remaining roast if you didn’t slice all of it, in the center and serve.",
    "Remarks:  I would recommend peeling the apples completely and slicing them as if they were going to be used in an apple pie.  There isn’t anything wrong with leaving the peeling on the apples, as it’s edible, but peeling the apples seems to me a lot more appealing.  Additionally, I would probably use at least a half cup of sugar instead of the ¼-cup the recipe calls for on top of the apples.",
    "Yield:  Serves 8.",
    "Source:  Julia and Jacques Cooking at Home by Julia Child and Jacques Pepin, published by Alfred A. Knopf, Inc., © 1999 by A La Carte Communications."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}