{
  "title": "Braised Pork Loin in Tomatillo Sauce (Lomo de Puerco in Salsa Verde)",
  "requires": "",
  "ingredients": [
    "1½ tablespoons of pork lard; or, olive or vegetable oil",
    "2 pound boneless pork loin roast; untied if its sold in two pieces",
    "1 pound (10 to 12 medium) tomatillos, husked and rinsed",
    "Fresh hot green chiles to taste (generally 3 serranos or 1 jalapeño, stemmed and seeded",
    "1 medium size white onion, sliced",
    "3 large garlic cloves, peeled and finely chopped",
    "1 to 2 large sprigs of fresh epazote, plus extra sprigs for the garnish; or, ⅓ cup fresh",
    "cilantro, plus extra sprigs for the garnish",
    "Salt",
    "10 small (about 1¼ pounds total) red-skin potatoes, peeled and quartered"
  ],
  "instructions": [
    "In a medium (4- or 5-quart) Dutch oven or other heavy pot with a tight-fitting lid, heat the lard or oil over medium heat.  When quite hot, lay in the pork loin (if its in two pieces, don’t crowd them, or they’ll stew rather than brown).  Brown well on one side, about 5 minutes, then turn over and brown the other side.  Remove the pot from the heat and transfer the pork to a plate, and set the Dutch oven or pot aside to use it later for the sauce.",
    "Roast the tomatillos and chiles on a baking sheet set 4 inches below a very hot broiler until darkly roasted, even blackened in spots, about 5 minutes.  Flip them over and roast them on the other side – again about 4 to 5 minutes.  When done the tomatillos and chiles will be soft and cooked splotchy-black and blistered.  Cool, then transfer everything to a food processor or blender, being careful to scrape up all the delicious juices that has run out onto the baking sheet.  Process until smoothly pureed.",
    "Set the pork-browning pot back over medium heat.  When hot, add the onion and cook, stirring regularly, until golden, about 7 minutes.  Stir in the garlic and cook a minute longer.  Raise the heat to medium-high, and when the oil is really sizzling, add the tomatillo puree all at once.  Stir until noticeably darker and very thick, 3 to 4 minutes.  Add 1½ cups of water and the epazote or cilantro.  Taste and season with salt, usually 1 teaspoon and stir everything thoroughly.",
    "Preheat the oven to 325° F.  Nestle the browned pork into the warm sauce, cover the pot and set it in the oven.  Cook for 30 minutes.",
    "While the meat is cooking, simmer the potatoes in heavily salted water, covered, until tender, about 10 minutes.  Drain and set aside.",
    "When the pork has cooked the 30 minutes remove from the oven and nestle the cooked potatoes into the sauce around the meat, re-cover and return the pot to the oven.  Use a meat thermometer and continue cooking until the thermometer registers 145° F.  The meat will feel rather firm (not hard) to the touch and cutting into the center will reveal only the slightest hint of pink.",
    "With a pair of tongs and a spatula, transfer the pork to a cutting board.  Let it rest for 3 to 4 minutes while you finish the sauce.  Spoon off any fat on the top of the sauce remaining in the pan then taste it.  Season it with additional salt if you think its necessary.  Spoon the sauce and potatoes into a warm deep serving platter.",
    "Cut the pork into ¼-inch thick slices and arrange the slices over the sauce.  Decorate the platter with epazote or cilantro sprigs and you’re ready for a great meal."
  ],
  "remarks": "The pork can be browned and the sauce made a day ahead.  Refrigerate them separately, well covered, until a couple of hours before you’re ready to braise the pork in the oven.  The pork will have the best texture if braised just before serving. The pork will hold fine in a very low oven (uncover the pot) for just a half hour if you slightly undercooked the pork – it’ll finish cooking as it sits this way. Yield:  Serves 6. Source:  Mexico One Plate at a Time by Rick Bayless, Scribner, 1230 Avenue of the Americas, New York, NY 10020, ©2000 by Rick Bayless.",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}