{
  "title": "Braised Short Ribs",
  "requires": "",
  "ingredients": [
    "¼ cup extra-virgin olive oil",
    "4 16-ounce beef short ribs",
    "Kosher salt",
    "Fresh ground black pepper",
    "2 carrots, peeled and roughly chopped",
    "1 onion, roughly chopped",
    "2 celery stalks, roughly chopped",
    "5 garlic cloves, thinly sliced",
    "2 cups full-bodied red wine such as Barolo",
    "1 16-ounce can of peeled tomatoes, crushed by hand, with their juices",
    "1 cup brown chicken stock",
    "½ bunch of fresh thyme",
    "½ bunch of fresh rosemary",
    "½ bunch of fresh oregano"
  ],
  "instructions": [
    "Pre-heat the oven to 375º F.",
    "In a large, heavy-bottomed skillet or Dutch oven, heat the olive oil over high heat until just smoking.  Season the short ribs with salt and pepper and cook them over high heat until they are a deep brown on all sides, about 15 minutes total if done right.  Remove the short ribs to a plate and set them aside.",
    "To the skillet or Dutch oven add the carrots, onion, celery, and garlic and cook over high heat until the mixture is browned and softened, about 4 minutes.  Season the mixture with salt, black pepper and stir in the red wine, tomatoes and their juices, the herbs, and the chicken stock.  Using a wooden spoon scrape the bottom of the skillet or Dutch oven to dislodge the browned bits.  Bring everything to a boil then return the short ribs to the pan and cover the skillet or Dutch oven with aluminum foil and place in the oven.  Cook for 2 hours, or until the meat is very tender and literally falling off the bones.",
    "Remarks:   The most important step here is the initial browning of the short ribs; do not shorten it or the final braise will not be as intensely flavored or colored.",
    "Yield:  Serves 4.",
    "Source:  The Babbo Cookbook by Mario Batali, published by Clarkson Potter/Publishers, , © 2002 by Mario Batali."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}