{
  "title": "Caramelized Roasted Skillet Pork Chops Requires:  Emeril’s Essence Creole Seasoning.",
  "requires": "",
  "ingredients": [
    "8 double-cut pork loin chops, 2½ to 3 inches thick, 14 to 16 ounces each",
    "6 tablespoons vegetable oil",
    "2 cups pure cane syrup",
    "½ cup maple syrup",
    "½ cup light Karo syrup",
    "¼ cup apple cider vinegar",
    "½ cup water",
    "¼ cup minced onion",
    "2 tablespoons chopped garlic",
    "1 teaspoon salt",
    "½ teaspoon crushed red pepper"
  ],
  "instructions": [
    "Whisk the pure cane syrup, maple syrup, Karo syrup, vinegar, water, minced onion, garlic, salt, crushed pepper, and 2 tablespoons of the oil together in a mixing bowl, blending well. Season both sides of the pork chops with Essence seasoning.  Place the pork chops in a large Zip-lock bag then pour the marinade over the chops.  Seal and shake the bag to coat the chops evenly with the marinade.  Refrigerate for 24 hours, turning the bag several times.",
    "Place the pork chops in a colander, and drain and reserve the marinade.  Pour all the marinade into a saucepan and simmer over medium-low heat until it is thick and dark, about 30 minutes.  Remove it from the heat and set it aside for serving with the pork chops when they are done.",
    "Preheat the oven to 400° F.  Heat two large skillets over medium heat, add 2 tablespoons of oil to each skillet and spread evenly.  Place half the pork chops in each skillet and sear for 3 minutes on each side.  After searing the pork chops on each side remove from the skillets and place the pork chops on a wire rack, set in a baking pan lined with parchment paper.  Bake the pork chops for 15 minutes (for medium); baste them every 5 minutes with the marinade.  Remove them from the oven and let them “rest” for 5 minutes before serving.",
    "Remarks:  This recipe should be easy to cut in half (4 pork chops) or in fourth (2 pork chops).  However, don’t cut the marinade recipe below a half so that you can have enough marinade to offer with the pork chops at the table.",
    "Yield:  Serves 8.",
    "Source:  Recipe courtesy of Emeril Lagasse, 1999."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}