{
  "title": "Carnitas Requires:  To make this recipe you will need “Fuego Spice Mix” and “Agua Negra Marinade”, the recipes for which are in the “Miscellaneous < Odds and Ends” folder.",
  "requires": "",
  "ingredients": [
    "3 pounds pork butt or shoulder",
    "1 tablespoon Fuego Spice Mix",
    "1 orange, quartered",
    "1½ teaspoon chopped garlic",
    "1½ teaspoon ground cumin",
    "1 teaspoon black pepper",
    "1 cup Pepsi Cola plus an additional quantity (as needed)",
    "¾ cup shortening",
    "1 cup Agua Negra Marinade"
  ],
  "instructions": [
    "Start by trimming off the excess fat from the pork.  (You may want to buy more meat by weight than the 3 pounds called for in this recipe since you will be losing some of the weight in the fat that you trim off.)  After you’ve removed as much of the fat as you can, cut the meat into 3-inch size cubes.  Dust the pork with the Fuego Spice Mix and press the mix into the meat with your hands so that it adheres well to the meat.",
    "Squeeze the juice from the orange into an air tight container and add in the peel from each quarter.  Next add to the orange juice the garlic, cumin, salt, pepper, Pepsi, and the marinade and mix everything well.  Add the seasoned meat cubes to the mixture and turn them gently with your hands to coat them with the mixture then close the container tightly and place it in the refrigerator.  Allow the meat to marinate overnight.  (You may want to periodically, during the marinating period, give the container a toss.  Alternatively, you may wish to use a 2-galleon plastic bag for the marinating so that all you need to do is turn it over periodically.)",
    "When you’re ready to cook the meat the next day, remove from the marinade.  Reserve the marinade for using later.  Place the shortening in a large, heavy metal, skillet and allow it to melt over high heat.  When the fat is smoking lightly, add the pork and cook it for 15 minutes, turning it occasionally so that the pork cubes caramelize and turn brown on all sides.  (If need be, remove to a plate the pork cubes that brown before others.  Also don’t crowd the pork in the skillet or you’ll not get the results you’re looking for.  If you are limited by the size of the skillet it’s better to brown the pork in batches.)  When all the pork cubes have been well browned (Return any you’ve removed to a plate to the skillet.) and add the reserved marinade, lower the heat, and simmer everything for about 2 hours, or until the pork is fork tender and dark brown.  As the meat cooks, add additional Pepsi to cover the cubes, as needed, but in the last half hour or so allow the liquids to cook down to a thick paste.",
    "To serve, remove the meat from the skillet and chop it up into approximately ¾-inch pieces and serve with flour tortillas."
  ],
  "remarks": "[From the author:]  “Traditional, taco stand-style, fork-tender pork, slowly simmered in a sweet and spicy marinade.  Our top-secret ingredient (well, it was until now, anyways):  Pepsi!  Trust us, it’s phenomenal.  You can pile carnitas into warm flour tortillas, with guacamole, salsa, beans and rice.  Or serve it just like BBQ pork – it’s even great at a picnic with soft rolls, potato salad, and corn on the cob.” Yield:  Serves 4 to 6. Source:  Chevys [Restaurant] &  [Restaurant] Fresh Mex Cookbook, published by 10 Speed Press, ,  © 2000 by Chevys Inc. Carnitas",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}