{
  "title": "Cheeseburger Onion Pie",
  "requires": "",
  "ingredients": [
    "1 tablespoon vegetable oil",
    "1 pound white onions, sliced and quartered to make a total of 3 cups",
    "1 pound lean ground beef",
    "⅓ cup catsup",
    "2 teaspoons prepared mustard",
    "¼ teaspoon salt",
    "⅛ teaspoon ground black pepper",
    "2 cans (8-ounces each) refrigerated crescent dinner rolls",
    "1 cup shredded cheddar cheese",
    "2 eggs, beaten",
    "1 egg yolk, beaten with 1 tablespoon of water for the glaze"
  ],
  "instructions": [
    "Heat the oil in a skillet set over medium heat.  When the oil is hot add the onion and cook, covered, for 10 minutes, stirring occasionally, until the onion is limp and translucent.  When cooked remove the onion with a slotted spoon and let it drain on paper towels.  In the remaining oil brown the ground beef.  When the beef is browned, no more pink showing, remove the beef to drain on paper towels, similar to the onions.  Remove and discard any remaining oil from the skillet.",
    "Return the skillet to the heat and add in the catsup, mustard, salt and pepper and mix the ingredients well but don’t cook, the mixture should only be warm.  When mixed remove the skillet from the heat and set it aside.",
    "On a floured surface, open one of the containers of crescent dinner rolls and unroll the dough.  Press together the perforations and roll the dough into a 12-inch square.  Place the dough in a 9-inch quiche dish, tart pan, or pie plate and trim it to 1-inch beyond the edge of the dish.  (In other words, there should be a 1-inch overhang.)  Spoon in the meat mixture and sprinkle the cheese over it then spoon the onions on top.  Pour the two beaten eggs over the onion layer.",
    "Unroll the remaining can of dinner rolls and pinch the perforations to seal the dough and roll it out to an 11-inch square.  Place the dough on top of the onion layer then trim and pinch the layers of dough together.  Use the glaze to brush the top of the pie and bake it at 350º F. for 40 minutes; or, until the dough is well browned.",
    "After you remove the pie from the oven allow it to stand for 5 minutes before serving."
  ],
  "remarks": "I think that for my tastes I would substitute Mozzarella cheese instead of Cheddar. Yield:  Serves 4. Source:  A Taste of the Country, recipe by Sharon Jakovac, Salmon, , Country Magazine, August/September 1989. Cheeseburger onion pie",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}