{
  "title": "Chicken Fricassee with Dumplings",
  "requires": "",
  "ingredients": [
    "For the Chicken Fricassee –",
    "About 4½ to 5½ pounds of chicken pieces; breasts, thighs, etc.",
    "1 stick (½ cup) butter",
    "2 tablespoons vegetable oil",
    "1 onion, quartered",
    "2 whole cloves",
    "1 carrot; peeled, split and halved",
    "3 large sprigs of parsley",
    "2 celery sprigs, cleaned and halved",
    "1 bay leaf",
    "7 cups chicken stock; or broth; enough to cover the chicken pieces",
    "⅓ cup all-purpose, unbleached flour",
    "½ cup whipping cream",
    "Salt and pepper",
    "For the Dumplings –",
    "2 cups all-purpose, unbleached flour",
    "4 teaspoons baking powder",
    "1½ teaspoons salt",
    "¼ cup vegetable shortening",
    "⅔ cup milk",
    "¼ cup minced parsley",
    "2 eggs"
  ],
  "instructions": [
    "Trim off any excess fat from the chicken pieces; then rinse and pat them dry using paper towels.  When all are done, sprinkle them with salt and pepper and set them aside until your ready to begin sautéing them.",
    "Set a Dutch oven, over medium-high heat and add half of the butter (½ stick) and the vegetable oil.  When the butter is melted, just before the butter/oil mixture begins to show signs of smoking, add the chicken pieces and sauté them.  When the chicken pieces are “well” browned on all sides, remove them to a plate one at a time until all of them are done.  Spoon out any remaining oil then return the Dutch oven to the heat.  Place all the browned chicken pieces in the Dutch oven and add the onion, carrot, celery, parsley, cloves, and bay leaf.  Add the chicken stock (or broth), enough so that the liquid covers the chicken pieces.  Bring the mixture to a boil, skimming off any froth that rises to the surface.  Reduce the heat to keep the mixture simmering, but not boiling.  Cook the mixture, covered, at a simmer for 1 hour and 15 minutes.  Transfer the chicken pieces to a plate and keep them warm.  Skim the fat from the stock and strain it to remove the solids; reserving 6 cups for use.",
    "In a large flameproof casserole melt the remaining ½ stick of butter over low heat and add ⅓ cup of flour.  Cook the roux over low heat, stirring, for 3 minutes.  Remove the casserole from the heat and add the reserved stock in a stream, whisking.  Increase the heat source setting to medium-high and return the casserole to the heat.  Bring the mixture to a boil; reduce the heat to keep the mixture simmering, and simmer the sauce for 10 minutes.  Add the whipping cream and season with salt and pepper to taste.",
    "Add the chicken pieces to the sauce and bring it to a boil over low heat while you prepare the dumplings.",
    "Sift the flour for the dumplings into a mixing bowl; add the baking powder and salt.  Cut in, with a pastry dough cutter, the vegetable shortening until the flour mixture resembles meal.  Add the milk, minced parsley, and beaten eggs.  Stir the mixture only until the flour/dough is moistened.  Use a tablespoon to scoop out dumplings and drop them into the chicken fricassee.  Cover the casserole and allow the dumplings to steam for 12 minutes.",
    "Remove the casserole from the heat and serve.",
    "Remarks:  This dish could be done over a two day period.  Placing the chicken pieces and the stock in the refrigerator overnight in separate containers; allowing the fat to congeal overnight and removing and discarding it the following day when you return to completing the dish.  One advantage would be that you could use the Dutch oven again on the second day.",
    "Yield:  Serves 8.",
    "Source:  Gastronomie Sans Argent:  Dumplings, Gourmet Magazine, January, 1975.",
    "Chicken Fricassee with Dumplings"
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}