{
  "title": "Chicken Cacciatore",
  "requires": "Emeril’s Essence Creole Seasoning.",
  "ingredients": [
    "8 pieces of chicken (or one whole chicken cut into 8 pieces)",
    "1 cup flour",
    "1 cup olive oil",
    "2 cups chopped yellow onions",
    "salt",
    "Crushed red pepper",
    "1 pound shiitake mushrooms, cleaned, stemmed and sliced",
    "2 tablespoons chopped garlic",
    "1 cup dry white wine",
    "2 cups chopped fresh tomatoes, peeled and seeded",
    "1 cup tomato sauce",
    "2 cups chicken stock",
    "1 bay leaf",
    "4 sprigs fresh thyme",
    "¼ cup basil",
    "½ pound cooked fettuccine or spaghetti (cooked, tossed in olive oil, salt and pepper)",
    "4 ounces grated Parmigiano-Reggiano cheese",
    "1 tablespoons finely chopped fresh parsley leaves"
  ],
  "instructions": [
    "Season the chicken with Essence Creole seasoning.  Season the flour with the same Essence and in it dredge the chicken, coating it completely.  Shake off the excess.  In a large Dutch oven, over medium-high heat, add the oil.  When the oil is hot, add the chicken and brown the pieces for 3 to 4 minutes on each side.  Remove the chicken and set it aside.",
    "Add the onions, season them with salt and red pepper as they sauté.  Sauté for 2 minutes then add the mushrooms and garlic.  Again season with salt and red pepper and continue sautéing for another 2 minutes.  Stir in the wine, tomatoes, tomato sauce, and the stock.  Now bring the mixture to a boil.  When its boiling stir in the bay leaf, thyme and basil.  Then return the chicken back to the mixture.  Reduce the heat to medium and cover.  Simmer for 1 hour or until tender.",
    "Remarks:  Serve by mounding the pasta in the middle of a plate.  Lay the chicken over the pasta and then spoon the sauce over the chicken.  Garnish with the cheese and parsley.",
    "Yield:  Serves 4.",
    "Source:  Recipe courtesy of Emeril Lagasse, 2000."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}