{
  "title": "Chili con Carne",
  "requires": "",
  "ingredients": [
    "3 cups chopped onion",
    "¼ cup vegetable oil",
    "1 tablespoon minced garlic",
    "3 pounds boneless beef chuck, ground coarsely (“chili-ground”)",
    "¼ cup chili powder",
    "1 tablespoon ground cumin",
    "1½ tablespoons unsweetened cocoa powder",
    "2 tablespoons paprika",
    "1 tablespoon dried oregano, crumbled",
    "1½ tablespoons dried hot red pepper flakes; or, to taste",
    "1 bay leaf",
    "Two 8-ounces cans of tomato sauce",
    "1 cup chicken broth",
    "3 tablespoons cider vinegar",
    "3 green bell peppers, cut into ½-inch pieces",
    "6 green onions, trimmed"
  ],
  "instructions": [
    "In a large kettle cook the onion in the oil, covered, over moderately low heat, stirring occasionally, until it is translucent and softened.  Raise the heat to medium-high and add the garlic, and continue cooking the mixture, stirring, for 1 minute, then add the beef chuck.  Cook the beef breaking up the lumps for 10 minutes; or, until it is no longer pink.  Add the chili powder, the paprika, the oregano, the red pepper flakes, and the bay leaf and cook the mixture for 1 minute, stirring so that all the ingredients are well mixed.  Add the tomato sauce, the chicken broth, and the vinegar then bring everything to a boil.  Once it reaches a boil turn down the heat to low, cover, and simmer the mixture, stirring occasionally, for 1 hour and 15 minutes.  Lastly, add the bell pepper, salt and pepper, stir well, and continue to simmer the mixture uncovered for approximately 15 minutes.  (At this point the chili is done when the bell pepper is cooked and tender.)  Find, remove, and discard the bay leaf.",
    "Ladle the chili into bowls and garnish with the green onions."
  ],
  "remarks": "The chili will improve in flavor if cooled completely, uncovered; then stored, covered, in the refrigerator overnight and heated for serving.  Add water to the chili when reheating, if necessary. The chili may be made 3 days in advance and reheated. Yield:  Serves 6. Source:  Cuisine Courante:  An Ice-Skating Party, Gourmet Magazine, January 1989.",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}