{
  "title": "Chili con Carne   Ranch",
  "requires": "",
  "ingredients": [
    "¼ pound (about 12) dry red chile pods",
    "2 to 3 chiles de arbol",
    "1½ cups water",
    "3 tablespoons olive oil",
    "2 cups finely chopped onion",
    "4 large garlic cloves, peeled and minced",
    "2½ pounds pork shoulder meat, in well-trimmed ¾-inch cubes",
    "1 teaspoon dried oregano, crumbled",
    "1½ teaspoons salt",
    "5 cups beef broth; or, chicken broth, preferably homemade"
  ],
  "instructions": [
    "Remove the stems from the dried chile pods and the chiles de arbol then slit them open length wises (kitchen scissors work well here) and shake out as much of the seeds as possible and rinse them briefly under cold running water then set them aside.  Tear or snip the chiles into small, 1-inch, pieces and place them in a medium size heat-proof bowl.",
    "Place a small pot over medium-high heat, pour in the water, and bring it to a boil.  When the water is boiling pour it over the chiles and cover the bowl with a lid, or a plate, to trap the steam vapor and let the chiles stand, stirring once or twice, until the water had cooled.",
    "Using a slotted spoon, transfer the softened chile pieces to the jar of a blender; or, the bowl of a food processor.  Blend the chiles briefly, scraping down the sides, and add some of the soaking water and process again.  Continue adding water, blending, and then scraping down the sides until all of the soaking water has been used up and the chile purée is smooth.  Transfer the purée to a strainer set over a clean bowl.  Add two tablespoons of hot tap water to the blender and purée briefly to rinse the blades and the insides of the blender.  Add this residue to the purée in the strainer.  Force as much of the purée through the strainer with a stiff rubber spatula; discard whatever residue remains trapped in the strainer after you’ve finished.  There should be about 1¼ cups of purée when you’re done.  (If there is more then the 1¼ cups, use it all.  If there is less; then soak, simmer, and purée additional chiles to make the necessary quantity.)",
    "In a Dutch oven; or, a heavy flameproof casserole, set over low heat, warm the olive oil.  When the oil is hot add the onion and the garlic and cook, covered, stirring once or twice, for about 10 minutes.  Add the cubed pork, the chile purée, the cumin, oregano, and the salt.  Cook, tossing and stirring often, for 5 minutes.  Stir in the beef, or chicken, broth and raise the heat to medium-high and bring the mixture to a boil.  Lower the heat to keep a bare simmer, partially cover the Dutch oven, and cook, stirring, until the meat is “very” tender and the sauce has thickened; approximately 2 hours.  Towards the end of the second hour taste and adjust, if necessary, the seasoning.",
    "Cool the chile completely and refrigerate it for up to 3 days, covered.",
    "On the day you are going to serve the chile warm it over low heat, stirring often, before serving.",
    "Yield:  Serves 6.",
    "Source:  The El Paso Chile Company’s Texas Border Cookbook, by W. Park Kerr and Norma Kerr, published by William Morrow and Co., Inc., New York, © 1992 by W. Park Kerr and Norma Kerr and Michael McLaughlin."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}