{
  "title": "Chipotle Marinated Ribs Requires:  Art Blondin’s Chipotle Ketchup, the recipe for which is in the “Sauces, Stocks, and Dressings” folder.",
  "requires": "",
  "ingredients": [
    "1 rack baby back ribs",
    "For the marinade:",
    "¼ cup red wine",
    "¼ cup honey",
    "¼ cup Chipotle Ketchup",
    "¼ cup canola oil",
    "Salt and black pepper, to taste"
  ],
  "instructions": [
    "Rinse and with paper towels dry the ribs.",
    "In a separate bowl combine the marinade ingredients and mix well.  Cut the ribs into either 2 or 3 ribs segments.  Place the ribs in a plastic bag and pour in the marinade.  Massage the bag to insure that the marinade is completely covering the ribs.  Let the ribs marinade at room temperature for 1 to 2 hours; or, overnight in the refrigerator.",
    "Place a good quantity of hickory chips in water well before you light the charcoal.  You’ll need to keep the grill smoking for a good 3 hours.",
    "After the charcoal is lit and burning well; bank all the charcoals on one side of the grill and place a drip pan on the opposite side.  Place a hand full of wet hickory chips around the charcoal.  Place the ribs on the grill, bone-side down, as far away from the direct heat as possible.  You want to maintain a temperature within the grill of between 200º and 225º F.  Cook the ribs for 3 to 3½ hours.  However, you should note that the ribs are done when a toothpick goes through easily when inserted between the bones.",
    "Keep in mind that periodically, you’ll have to add more wet hickory chips to the fire.  Also, remember that as the hickory chips dry out they will ignite, so keep an eye out for flare ups, and put them out as soon as possible.",
    "Remarks:  This recipe is really best when done on a smoker, not a grill.  If you are using a grill the internal temperature may be much higher than they ordinarily would be in a smoker so you want to keep a close watch on the ribs as they cook.  Rotating the ribs from nearest to the charcoals to furtherest from the charcoals will help also.",
    "Yield:  Serves 2 to 3 persons.",
    "Source:  Recipe from Art Blondin’s “Legends of Texas Barbecue Cookbook” included in, “The Barbecue Trail” by Bonnie Walker, Food Section, San Antonio Express News, ."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}