{
  "title": "Coq au Vin",
  "requires": "",
  "ingredients": [
    "3 Chicken breasts",
    "2 ½ teaspoons kosher salt, more as needed",
    "½ teaspoon freshly ground black pepper more to taste",
    "1 bottle of red wine",
    "1 bay leaf",
    "1 teaspoon chopped fresh thyme leaves",
    "4 ounces lardons, pancetta or bacon ¼ inch pieces (about 1 cup)",
    "3 tablespoons extra virgin olive oil, more as needed",
    "1 large onion",
    "1 large carrot peeled and diced",
    "8 ounces mushrooms",
    "2 garlic cloves minced",
    "1 teaspoon tomato paste",
    "1 tablespoon all-purpose flour",
    "2 tablespoons brandy",
    "3 tablespoons butter",
    "8 ounces peeled pearl onions",
    "Pinch of sugar"
  ],
  "instructions": [
    "Season chicken with salt and pepper.  In a large bowl, combine chicken, wine, bay leaf and thyme.  Cover and refrigerate for at least 2 hours, or even better, overnight.",
    "In a large Dutch oven, or a heavy bottomed pot with tightfitting lid, cook lardons over medium low heat, until fat has rendered, and lardons are golden and crisp, 10-15 minutes.   Using a slotted spoon transfer lardon to a paper towel lined plate, leaving the fat in the pot.",
    "Remove chicken from wine, reserving for marinade.  Pat chicken pieces dry with paper towel.   Heat lardon fat over medium heat until it’s just about to smoke.   Add chicken, in a single layer and cook until well browned, 3-5 minutes per side.  (Add additional oil if needed).  Transfer chicken to plate as it browns.",
    "Add, diced onions, carrot and half of the mushrooms to pot.  Season with additional salt and pepper.   Cook vegetables are lightly browned 8 minutes, stirring up any brown bits from the pot and adjust the heat if necessary to prevent burning.",
    "Stir in garlic and tomato paste and cook for 1 minute, then stir in flour and cook for another minute.  Remove from heat, push vegetables to one side of pot, pour brandy into empty side and cook for 1 minute.   Add reserved marinade, bring to a boil and reduce halfway (to 1 ½ cups) about 12 minutes.  Skim off any large pockets of foam that form on the surface.",
    "Add chicken, any accumulated juices and half the cooked lardons to the pot.  Cover and simmer over low heat for 1 hour, turning halfway through.",
    "At about the half point, in another pan melt 1 tablespoon of butter over medium heat.   Add pearl onions, a pinch of sugar, salt and pepper to taste.  Cook for about 10-15 minutes.   Move pearl onions to plate.  Add an additional 1 tablespoon of butter and other half of mushrooms and cook on medium heat for 10 minutes.  Season mushrooms with salt and pepper.  Once the mushrooms have cooked down add the pearl onions back into the pan a cook an additional couple minutes.",
    "Uncover the pot with the chicken.   Taste and add salt and pepper if necessary.   Add the mushrooms and pearl onions to the pot and cook for 15 minutes to blend the flavors and to thicken."
  ],
  "remarks": "Source:   Adapted from NY times recipes.",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}