{
  "title": "Croque Monsieur",
  "requires": "",
  "ingredients": [
    "4 oz - Gruyere",
    "2 Tbsp - Unsalted Butter",
    "2 Tbsp – All Purpose Flour",
    "1 ¼ cups – Whole milk",
    "¾ tsp – Kosher Salt",
    "¼ tsp – Freshly ground nutmeg",
    "1 Tbsp – Dijon mustard, plus more for serving",
    "8 ½ thick slice country style or sourdough bread",
    "8 oz sliced ham",
    "Cornichons (for serving)"
  ],
  "instructions": [
    "Place a rack in middle of oven; preheat to 425°. Grate 4 oz. Gruyère on the large holes of a box grater and set aside for later.",
    "Melt 2 Tbsp. butter in a medium saucepan over medium-low heat. Add 2 Tbsp. all-purpose flour and cook, whisking constantly, until butter and flour are well combined and foaming but still very pale in color, about 2 minutes.",
    "Very slowly stream in 1¼ cups whole milk, whisking constantly (this must be done very gradually because if you incorporate the milk into the roux too quickly, it can become very lumpy), until mixture is pale and smooth.",
    "Continue to cook, whisking constantly, until sauce is thickened (it should leave a trail when you run your whisk through it) and shiny and the foaming has slowed down, 6–8 minutes. It’s important to keep an eye on the béchamel and stir often; otherwise, you can scorch the bottom of the pot and be left with a lumpy sauce with an unpleasant flavor.",
    "Remove from heat and stir in ¾ tsp. salt, ¼ tsp. freshly ground nutmeg, and 1 Tbsp. Dijon mustard.",
    "Using a spoon, spread béchamel over 1 side of each slice of country-style bread, making sure to cover the full surface.",
    "Transfer 4 slices, sauce side up, to a parchment-lined rimmed baking sheet. Divide 8 oz. sliced ham among slices on sheet, then top with half of reserved Gruyère.",
    "Top with remaining slices of bread sauce side up. Sprinkle remaining cheese over each.",
    "Bake sandwiches until cheese and sauce are lightly browned and bubbling, 10–15 minutes.",
    "Slice sandwiches crosswise on a diagonal. Serve with cornichons and extra Dijon mustard for dipping alongside.",
    "Source:  Bon Appetit (https://www.bonappetit.com/recipe/basically-croque-monsieur)"
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}