{
  "title": "Cubed Pork Stewed in an Ancho Chile & Tomato Sauce (Coleto Asado)",
  "requires": "",
  "ingredients": [
    "2½ pounds lean, boneless pork loin; or, 4 pounds country-style pork ribs",
    "2 tablespoons oil",
    "5 chile anchos",
    "4 tomatoes",
    "¼ white onion",
    "6 garlic cloves",
    "2 three-inch “canela” sticks (Mexican cinnamon); or, 1 three-inch cinnamon stick (non-Mexican)",
    "2 sprigs fresh Mexican oregano; or, 1 tablespoon dried oregano",
    "2 sprigs fresh thyme; or, 1 tablespoon dried thyme",
    "½ teaspoon freshly ground pepper",
    "¼ cup white vinegar",
    "½ teaspoon salt",
    "½ cup dark brown sugar (optional)"
  ],
  "instructions": [
    "Clean and cut the pork loin into 1-inch size cubes.  (If using the country-style pork ribs then remove the excess fat as you clean it.  Cut the pork rib meat into 1-inch size cubes as best as possible.)  Set aside the cubed pork until your ready to sear it.",
    "Place a frying pan over medium heat, add the oil, and when it’s hot (just as it starts to smoke) add the cubed pork and sear it on all sides for about 10 minutes.  (If necessary, sear the pork in several batches using additional oil, in order not to crowd the pork and forcing it to sweat out a lot of its juices as it sears.)",
    "In a large pot over medium heat bring 1 quart of water to a boil then add the seared pork cubes.  Allow the water to return to a boil then cover with a lid (set slightly skewed to allow steam to escape), reduce the heat to maintain a simmer, and simmer the pork for 1 hour.",
    "Remove the stems from the chile anchos; slit them open along their edges, remove their seeds and open them flat.  Toast them on a hot, dry comal until the chiles change color and start releasing their “perfume.”  Transfer them into a bowl of hot water and allow them to soak, immersed, for 30 minutes.  (Weigh them down with a cup or smaller bowl if necessary.)",
    "After you’re finished toasting the chiles on the comal start toasting the tomatoes, onion, and the unpeeled garlic cloves.  When the tomatoes are well scorched transfer them into a plastic bag and allow them to “sweat” so that you can remove their skin easily.  Peel and place the tomatoes and garlic cloves in a blender.  Add the onion to the blender.  Tear the chile anchos into small pieces after their soaking and add them to the blender ingredients.  Lastly, add the “canela” (also broken up into pieces), the oregano, thyme, pepper, and the vinegar and purée the ingredient into a smooth paste.",
    "Strain the chile ancho/tomato purée into the pot with the pork and stir to blend well.  After the sauce is well blended add the salt and, if using, the brown sugar and continue simmering, uncovered, for an additional 30 minutes.",
    "When done pour the stew into a large bowl and bring to the table.  (If desired, you may garnish the dish with sliced avocados.)",
    "Remarks:  Serve with Mexican Rice and a fresh lettuce salad.",
    "Yield:  Serves 6.",
    "Source:  A Cook’s Tour of Mexico by Nancy Zaslavsky, published by St. Martin’s Press, New York, New York, © 1995 by Nancy Zaslavsky."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}