{
  "title": "French Canadian Meat Pie (Tourtiere) Requires:  Pastry Crust Mix, look in the “Bread, Cakes, and Cookies Folder” for the recipe; use the measured as if for a double crust 9-inch pie.",
  "requires": "",
  "ingredients": [
    "1 large onion, chopped",
    "1 tablespoon butter",
    "1½ pounds of ground pork",
    "½ pound ground veal",
    "¼ cup of finely chopped celery leaves",
    "¼ cup of finely chopped parsley",
    "¼ cup hot water",
    "½ teaspoon ground allspice",
    "1 teaspoon each of salt and pepper (or to taste)",
    "1 egg yolk",
    "1 tablespoon heavy cream"
  ],
  "instructions": [
    "Measure out and prepare the pastry crust mix as per instructions.  Divide the dough into two equal portions.  Dust each ball of dough with flour and chill them, wrapped in wax paper for 1 hour.",
    "In a saucepan, sauté the onion in one tablespoon of butter until it is tender and translucent.  Add the ground pork and the veal and cook the mixture, stirring, until the meat is browned.  When the meat mixture is browned add the chopped parsley, celery leaves, the hot water, the allspice, and the salt and pepper.  Continue to simmer the mixture over low heat, covered, for 1 hour, stirring occasionally.  After its done let the mixture cool.",
    "On a floured board, or surface, roll out half the dough in a circular round, about ⅛ inch thickness.  Using the rolling pin to help transfer the rolled dough transfer it to a buttered, 9-inch pie plate and trim of the excess.  Prick the bottom of the pie shell with a fork and chill it for 1 hour.",
    "Remove the pie plate from the refrigerator and spread the meat filling evenly in the pie shell.  Roll out the second ball of dough in the same manner and again, using the rolling pin to help, transfer the rolled dough and arrange it over the pie dish.  Trim off the excess dough and crimp the edges together.  Cut an air vent in the center of the dough then brush the pie with an egg wash made by lightly beating the egg yolk and cream together.  Bake the pie in the lower third of a preheated, very hot oven, 450° F., for 15 minutes.  After the 15 minutes transfer the pie to the upper third of the oven, reduce the heat to 325° F., and bake the pie for an additional 30 minutes, or until it is golden brown.",
    "Let the pie cool for 30 minutes and then serve hot.",
    "Yield:  Serves 4.",
    "Source:  Sugar and Spice, Gourmet Magazine, October 1972."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}