{
  "title": "Greek Dry-Marinated Pork Chops",
  "requires": "",
  "ingredients": [
    "2 garlic cloves, crushed with the flat side of a knife",
    "½ teaspoon sea salt; plus more, to taste",
    "2 bay leaves",
    "1 teaspoon coriander seeds",
    "½ teaspoon dried Greek oregano; or, thyme",
    "Freshly ground black pepper",
    "2 tablespoons extra-virgin olive oil and 2 tablespoons pure pork lard; or, ¼ cup extra-virgin olive",
    "Oil",
    "4 pork chops, at least ½-inch thick",
    "½ cup dry white wine"
  ],
  "instructions": [
    "Using a mortar and pestle pound and grind the garlic cloves with the sea salt to make a paste.  Break up the bay leaves and add them to the mortar, along with the coriander seeds.  Continue pounding until you have a coarse paste.  Stir in the oregano and plenty of black pepper then add 2 tablespoons of the olive oil.  Stir the mixture to make a thick paste.",
    "Smear some of the paste on both sides of each pork chop and set them on a platter, covered with plastic wrap.  Allow the pork chops to marinade for 2 to 3 hours in the refrigerator.",
    "When you are ready to proceed preheat the oven to 325° F.",
    "Heat the lard or the remaining 2 tablespoons of olive oil in a heavy skillet over medium-high heat until it’s barely smoking.  Sauté the pork chops in the hot oil until both sides a nicely browned then transfer them to a large baking dish, large enough to hold all the pork chop in a single layer.  Deglaze the skillet with the wine; bring it to a boil over medium-high heat.  Pour the wine mixture over the pork chops in the baking dish and bake for 20 to 30 minutes; at least until the pork chops are cooked through.",
    "Serve immediately.",
    "Remarks:  You can also grill the pork chops on a charcoal grill.  Set the grill about 5 inches above the charcoals.  However, if you do this don’t brown the pork chops first in the skillet.  The pork chops should be turned frequently to keep them from burning or drying out.  Baste them occasionally, as they cook, with the remaining 2 tablespoons of olive oil.  Also, you won’t need the white wine for a sauce.",
    "Yield:  Serves 4.",
    "Source:  The Essentials Mediterranean by Nancy Harmon Jenkins, Harper Collins Publishers, Inc., , ©2003 by Nancy Harmon Jenkins."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}