{
  "title": "Grilled Asian Chicken",
  "requires": "",
  "ingredients": [
    "8 boneless, skinless chicken breast halves",
    "2 tablespoons vegetable oil",
    "2 tablespoons reduced-sodium soy sauce",
    "⅓ cup honey",
    "⅓ cup bottled chopped ginger or chopped fresh ginger root",
    "The juice of 2 limes",
    "1 tablespoon dark sesame oil",
    "2 teaspoons garlic powder",
    "2 teaspoons onion powder"
  ],
  "instructions": [
    "Clean and trim off any remaining fat from the chicken breasts halves, then rinse and pat them dry, using paper towels.  Place the chicken breast halves in a 2-gallon zipper-top plastic bag and set it aside.",
    "In a small mixing bowl, combine the remaining ingredients, listed above.  Whisk to mix them well then pour the mixture into the plastic bag with the chicken breasts.  Seal the bag, and shake and massage the bag well, to coat all of the breasts with the marinade.",
    "Position the plastic bag so that all the breasts are in a single layer, flat, in the refrigerator.  Allow the chicken breasts to marinate for at least 2 hours, or up to 12 hours.",
    "When you have the grill fire going well bank the charcoal to one side of the grill and place a drip pan on the other side.  Position the charcoal rack as close to the grill as settings allow and place the chicken breasts directly above the charcoals.  Close the lid and allow the breasts to grill directly above the coals for 6 to 7 minutes.  Open the grill lid and turn the breasts.  Close the lid and allow the second side of the breasts to grill, again directly above the coals, for 6 to 7 minutes.  Open the grill lid and place the chicken breasts above the drip pan.  Close the lid and allow the chicken to continue cooking until the chicken is cooked through.  This will depend on the size of the breasts.",
    "The pieces are done when a thermometer inserted in to the thickest part reads 160º F.",
    "Serve immediately or allow them to cool and store them for a future meal.",
    "Remarks:  The chicken breasts may be refrigerated for up to 3 days, or frozen in heavy-duty foil for up to a month.  On the night before you plan to serve them take them out of the freezer and allow them to thaw in the refrigerator overnight.  Heat them in the foil in the oven or on counter top portable oven.",
    "Yield:  Makes 8 breast halves.",
    "Source:  Desperation Dinners:  Thinking About Future Meals When Grilling by Beverly Mills with Alicia Ross, Food Section of the  Express News, ."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}