{
  "title": "Hamburger Steaks with Peppercorns",
  "requires": "",
  "ingredients": [
    "1 pound ground sirloin",
    "2 tablespoons grated onion",
    "1 large garlic clove, mashed",
    "½ teaspoon salt",
    "2 tablespoons peppercorns",
    "1 tablespoon clarified butter",
    "2 tablespoons brandy",
    "¼ cup “brown stock” or beef broth",
    "¼ cup whipping cream"
  ],
  "instructions": [
    "Before starting, use a mortar and pestle to crack the peppercorns; leaving the cracked pepper in a rough state.  Transfer the cracked pepper to a container and set it aside.  In the same mortar, crush the garlic with the salt until you have a smooth paste.  If you don’t have a mortar use a small bowl and the back of a spoon.",
    "In a mixing bowl combine the ground sirloin, the onion, and the garlic/salt paste. Work the mixture by hand until the ingredients are well integrated into the ground sirloin; then form the meat into two ½-inch-thick steak-rounds.  (If you decide that the portions are too large use the “½-inch thickness” as a guide in forming the steak-rounds.  The ½-inch thickness will allow the steak-rounds to cook and come to the same level of “doneness” at the same time.)  Press the cracked pepper into the steak-rounds and set them aside until the skillet is ready.  (If individual tastes dictate lighter coatings of the cracked pepper use your best judgment.)",
    "In a skillet, set over moderately high heat, bring a tablespoon of clarified butter to the point where it’s just starting to smoke.  Cook the sirloin-rounds:  three minutes on each side for “rare;” four to five minutes on each side for “medium-rare.”  Just before the end of the cooking time add the brandy, allow it to come to pan temperature, then ignite the spirits.  When the brandy ignites shake the pan so that the steak-rounds can stir up the pan juices.  (Use care when the spirits ignite and when shaking the skillet because an open flame can be dangerous.)  When the flames go out transfer the steak-rounds to a heated serving dish and keep them warm.",
    "Return the skillet to the heat and add the brown stock (or beef broth) and the whipping cream.  With a whisk stir the mixture, picking up all the brown bits clinging to the pan bottom, bringing the liquid to a boil.  Reduce this sauce over high heat by half.  Pour it over the steak-rounds and bring them to the table.",
    "Yield:  Serves 2.",
    "Source:  You Asked for It, Gourmet Magazine, February 1975."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}