{
  "title": "Lemon, Herb, and, Chipotle Roasted Chicken",
  "requires": "This recipe requires Chipotle Purée, the recipe for which is in the “Sauces, Stocks, and Dressings” folder.",
  "ingredients": [
    "1 (2¾ to 3½ pound) fresh whole fryer chickens",
    "¼ cup olive oil",
    "1 tablespoon kosher salt",
    "½ teaspoon black pepper",
    "6 sprigs of rosemary",
    "6 sprigs fresh oregano",
    "½ lemon",
    "2 large garlic cloves cut in half",
    "1 tablespoon Chipotle Purée",
    "Butcher twine"
  ],
  "instructions": [
    "Remove the giblets from the body cavity of the chicken and trim away any excess fat.  Rinse the chicken inside and out under cold running water and pat dry with paper towels.",
    "Preheat the oven to 350º F.",
    "Combine the olive oil with half of the salt, and pepper in a small bowl.  Using this seasoned olive oil coat the cavity of the chicken.  Strip the leaves off two sprigs each of rosemary and oregano and using a sharp knife mince them well; then place the minced leaves in the cavity of the chicken, spreading them evenly.  Take two more sprigs of rosemary and oregano, leaving the leaves still attached to the sprig, and place them inside the cavity of the chicken.",
    "Squeeze the juice from half of a lemon into the cavity of the chicken and place the squeezed lemon inside the cavity.  Spread the remaining seasoned olive oil under the breast skin.  Place 2 garlic clove halves under the breast skin, one on each side of the breast.  Again, strip off the leaves off the two remaining sprigs of rosemary and oregano and mince them well.  Use the minced rosemary and oregano and distribute evenly under the breast skin.",
    "Truss the chicken drumsticks together with butcher twine, closing the cavity; or, with a wooden skewer, pinch the skin together over the cavity and pierce through the skin, working your way upwards with the skewer, “sewing” the opposite flaps of skin together, and closing the cavity.",
    "Baste the entire chicken with the Chipotle Purée then sprinkle the entire chicken with the remaining salt and pepper.",
    "Place the chicken on a roasting rack in a roasting pan and roast until the thigh juices run clear when the skin is pierced with a knife, approximately 1½ hours; or until the thigh meat registers 165º F. on a thermometer.   You should also baste with the pan juices every 30 minutes or so, as the chicken is cooking."
  ],
  "remarks": "This spicy Mexican roasted chicken always turns out moist and memorable because of two “tricks”.  Stuffing half a lemon inside the bird and spreading olive oil, garlic, and herbs under the skin.  A little “Chipotle Purée” gives the outside extra flavor and a beautifully bronze finish. When you rub herbs, garlic, or spices on the outside of a chicken they tend to burn and fall off.  Instead, spread them under the skin, and their flavor will penetrate right into the chicken. Dip you fingertips in oil and gently loosen the skin, working your fingers underneath, and lift the skin away.  If you’re careful, you can work your way down to the drumstick.  Once you’ve loosened the skin, you can then stuff the seasonings underneath. Yield:  Serves 6. Source:  Chevys [Restaurant] &  [Restaurant] Fresh Mex Cookbook, published by 10 Speed Press, ,  © 2000 by Chevys Inc. Lemon, Herb, and, chipotle roasted chicken",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}