{
  "title": "Liguria Lasagna with Meat and Tomato Sauce (Lasagna al sugo)",
  "requires": "",
  "ingredients": [
    "2¾ cups sifted flour",
    "3 eggs",
    "salt",
    "1 onion",
    "1 stick celery",
    "1 small carrot",
    "1 sprig parsley",
    "¼ cup butter",
    "¾ pound ground veal or beef (as lean as possible)",
    "6 tablespoons dry white wine",
    "4 ripe or canned tomatoes, peeled",
    "salt and pepper",
    "⅔ cup grated Parmesan cheese",
    "¾ cup chicken or beef stock"
  ],
  "instructions": [
    "Mix the flour (reserve 1 tablespoon), the eggs, and a pinch of salt, then knead to obtain smooth elastic dough.  Roll the dough out fairly thinly and cut into 2 by 2½ inch squares (which are known as “lasagne” in Genoa).  Set them aside.",
    "If you are using fresh, ripe, tomatoes plunge them in boiling water for 1 minute.  Remove them from the boiling water and plunge them into cold water to stop the cooking process.  When they have cooled, peel them, remove and discard the seeds, and chop them coarsely.  If you are using canned tomatoes simply remove the seeds and chop them coarsely.",
    "Finely chop the onion, celery, carrot and parsley.  Melt the butter in a frying pan and in it add cook the ground meat and chopped vegetables over a moderate heat, stirring continuously for 5 or 6 minutes.  When the meat has browned add the wine and raise the heat.  Cook, uncovered, until the wine has been incorporated, and the smell of the wine is gone.  Add the chopped tomatoes to the meat and season with salt and freshly ground pepper and all the mixture to simmer, covered, for about 15 minutes.",
    "Put the reserved tablespoon of flour into a steel or aluminum pan and cook over moderate heat, stirring continuously until the flour is golden brown.  Add the chicken, or beef, stock to the browned flour, mix and add to the meat.  Continue cooking the meat, covered, until the sauce is smooth and thick.",
    "Cook the “lasagne” in plenty of boiling, heavily salted, water then drain while the pasta is still firm and chewy.  Put layers of the pasta in a serving dish, together with the sauce and grated Parmesan cheese.  Serve it all very hot.",
    "Remarks:  I think that to my tastes, after I removed the pasta from the boiling water, I would add the “lasagne” to the meat sauce in the cooking pan, while the meat was in the final seconds of cooking.  I would give all the ingredients several final tosses to coat the pasta well with the meat sauce and pour it all out into the serving plate, or bowl.",
    "Yield:  Serves 4.",
    "Source:  Pasta & Pizza, Recipes compiled by Ann Martini, Translated by Elisabeth Evens, St. Martin’s Press Inc., 175 Fifth Ave., New York, N.Y., 10010, © 1974 by Arnoldo Mondadori – Verona, Italy.",
    "Lasagna with Meat and Tomato Sauce"
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}