{
  "title": "Low-Fat Chicken Tequila Fettuccine",
  "requires": "",
  "ingredients": [
    "1 teaspoon olive oil",
    "1 pound skinless chicken breasts; cut into 2-inch long by ½-inch wide strips",
    "3 cloves garlic, pressed or minced (approximately 1 tablespoon)",
    "1 red bell pepper, seeded, deveined and cut into 2-inch by ¼-inch strips",
    "1 medium size red onion, cut in half, then sliced into ¼-inch thick strips",
    "½ jalapeño chile, seeded and minced",
    "2 tablespoons tequila",
    "2 tablespoons low-sodium soy sauce",
    "¾ cup fat-free chicken broth",
    "1½ tablespoons cornstarch",
    "2 cups half-and-half",
    "Juice of 1 lime",
    "4 tablespoons fresh cilantro, chopped (divided use)",
    "12 ounces fettuccine"
  ],
  "instructions": [
    "Use Pam©, or other similar spray lubricant, and spray the insides of a large, nonstick, skillet.  Add the olive oil and set the skillet over medium-high heat.  When the oil is hot and barely smoking add the garlic; stir to release the flavor into the oil then add the chicken pieces.  Cook the chicken until the pieces begin to take on a light brown texture.  (If you want the browning to occur rapidly don’t stir the pieces a lot; or, brown the pieces in batches.)",
    "When the chicken reaches the degree of “brownness” you want add the bell pepper, the onion, and the jalapeño.  (Don’t think that the chicken will continue to brown after you add the vegetables; it won’t because the vegetables will release a great deal of juices and stop the “browning” process.)  Sauté the vegetables until most of their liquid has been cooked off (evaporated).",
    "Combine the cornstarch with the half-and-half and slowly add it to the skillet.  When all the half-and-half has been added bring the mixture to a boil then add the lime juice, the tequila, and half of the chopped cilantro.  Turn off the heat and stir to mix all the ingredients together and serve over cooked fettuccine.",
    "Use the remaining cilantro as a garnish.",
    "Yield:  Serves 4.",
    "Source:  Cook It Light by Jeanne Jones, Food Section,  Express-News, Wednesday, August 31, 2005."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}