{
  "title": "Mahogany Short Ribs",
  "requires": "",
  "ingredients": [
    "3 pounds beef short ribs, cut into a total of 4 pieces",
    "1 cup teriyaki sauce",
    "1 cup prune juice",
    "1 cup water",
    "½ teaspoon whole black peppercorns"
  ],
  "instructions": [
    "Clean and trim off some of the fat from the beef short ribs then cut them into 4 pieces.  When done use some paper towels to pat them dry.  Place the short ribs in a container with a lid and arrange them, if possible, in a single layer.  Pour in the teriyaki sauce, prune juice, and the water.  If the liquid marinade doesn’t cover the short ribs add equal portions of sauce, juice, and water until the liquid marinade covers them.  Cover and refrigerate overnight; or, up to one whole day.",
    "Remove the short ribs from the marinade and set them aside while you continue with the preparations.",
    "Set a large pot over medium-high heat, pour in all of the marinade and add the peppercorns.  Bring the mixture to a boil before you reduce the heat to medium-low.  Once you reduce the heat add in the short ribs and cover the pot.  Cook the short ribs at the medium-low heat setting for 2 hours; or, until the meat is very tender and is “falling off the bone.”  Remove the short ribs and transfer them to a platter.",
    "Increase the heat to medium-high and cook the marinade until it is syrupy.",
    "Pour the sauce over the short ribs and serve."
  ],
  "remarks": "Beef short ribs usually have a lot of fat (which is why they are so tasty).  So, if you are trying to eat healthy let the short ribs and the sauce cool; then store them separately in the refrigerator to serve on the following day. When preparing the meal the following day start by removing and discarding the congealed fat from the top of the sauce.  Pour the sauce into a large pot, add the short ribs, and slowly warm the ribs in the sauce.  When everything is heated through remove the short ribs to a platter, pour the sauce over them, and bring to the table. Yield:  Serves 4. Source:  ‘Beef short ribs made with teriyaki and prune juice easy, tasty’ by Candy Sagon of the Washington Post, adapted from ‘Recipes 1-2-3’ by Rozanne Gold, published in the Express-News, Wednesday, January 25, 2006.",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}