{
  "title": "Mom’s Enjitomatado",
  "requires": "",
  "ingredients": [
    "Pork, your mom likes to use pork loin",
    "One 8 ounce can of tomato sauce",
    "Oregano, to taste",
    "Cinnamon, to taste",
    "Thyme, to taste",
    "Ginger, to taste",
    "1 bay leaf",
    "1 garlic clove",
    "1½ tablespoon olive oil",
    "1½ tablespoon of flour",
    "Salt, to taste (your mom says pepper is optional)"
  ],
  "instructions": [
    "Decide if you’re going to use all of the pork.  If not, cut it into steak size portions and place what you intend to use for this meal in a frying pan.  Add enough water to cover the meat; add salt and a garlic clove and cook the meat over medium high heat.",
    "Once the pork is cooked remove the pork from the cooking liquid.  Dispose of the garlic clove and reserve the cooking liquid.  After the pork cools either shred it or cut it into bite size pieces and set it aside.",
    "Wash the frying pan to use again.",
    "In the cleaned frying pan, set over medium high heat, add the olive oil and the flour.  Cook the flour in the oil until the roué turns a golden brown color.  When the roué reaches the desired color add the tomato sauce and blend and mix well.  At this point you’re going to add all the spices; the oregano, cinnamon, thyme, bay leaf and the ginger.  Add as much of the reserved cooking liquid as necessary to make the quantity of sauce you want and in which you’re going to add the pork.  It wouldn’t be a bad idea to taste the sauce for the salt level and “the balance” in the spices before adding the pork.",
    "(You’re going to have to use your memory to achieve the “balance” in the spices that you remember and want to achieve.  Your mother has the experience of past preparations to go by but you’re going to have use trial and error to get “the balance” you’re looking for, and remember.)",
    "Add the shredded (or cut) pork to the sauce and cook over medium high heat for 15 minutes; or, until the flavor of the spices stabilizes in the sauce and penetrates the pork.  (It goes without saying make sure that the pork come up to the temperature of the sauce before serving.)"
  ],
  "remarks": "I like the sauce to be somewhat thick; kind like a gravy.  I also like to serve it over Mexican rice. Source:  Traditional Mexican recipe from your mother’s family.",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}