{
  "title": "North African Meatballs",
  "requires": "",
  "ingredients": [
    "1 pound lean ground beef",
    "1 tablespoon olive oil",
    "¾ cup minced onion",
    "1 tablespoon minced garlic",
    "¾ teaspoon ground cumin",
    "½ teaspoon ground cardamom",
    "½ teaspoon ground coriander",
    "¼ teaspoon ground turmeric",
    "⅛ teaspoon ground ginger",
    "3 tablespoons minced flat-leaf parsley",
    "2 tablespoons minced cilantro",
    "2 tablespoons minced mint",
    "2 large egg whites, lightly beaten",
    "1½ teaspoons salt",
    "1 teaspoon “harissa” or other red chile paste",
    "½ teaspoon freshly ground black pepper",
    "Vegetable oil for sautéing"
  ],
  "instructions": [
    "In a medium size skillet heat the olive oil over medium heat until just smoking.  Add the onion and garlic and sauté the combination until the onion has softened and becomes translucent, about 4 minutes.  Add the cumin, cardamom, coriander, turmeric, and ginger and cook until the combination becomes fragrant, about 1 minute.  Scrape the onion mixture into a mixing bowl and allow it to cool.",
    "When the onion mixture has cooled add the ground beef, the parsley, cilantro, mint, egg whites, salt, “harissa” and black pepper and mix the ingredients with your hands until everything is thoroughly combined.",
    "Divide the meat mixture into 12 equal portions and roll each into balls and set on a large plate.",
    "In a large skillet add enough vegetable oil to measure approximately ¼ inch and place it over medium-high heat.  When the oil is just smoking add the meatballs and sauté them, turning them occasionally, until they are evenly browned and cooked through, about 10 minutes.",
    "Drain the meatballs on paper towels before serving.",
    "Remarks:  “Harissa” is a hot sauce made from red chiles and such spices as coriander and caraway.  It is available in tubes, cans and jars in Middle Eastern grocery stores or in specialty food markets.",
    "Yield:  Makes 12 meatballs.",
    "Source:  Food & Wine Magazine’s 2001 Cookbook, American Express Publishing Corp., New York, ©2001 by the American Express Publishing Corporation."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}