{
  "title": "Onion Rolls Stuffed with Meat in Tamarind Sauce (Mahshi Bassal bel Tamarhendi) Requires:  Tamarind paste or concentrate.   Comments on tamarind are in the “Miscellaneous << Advice” folder.",
  "requires": "",
  "ingredients": [
    "2 large mild flavor onions",
    "1 pound lean ground beef, or lamb",
    "1 teaspoon cinnamon",
    "½ teaspoon allspice",
    "3 tablespoons finely chopped flat-leaf parsley",
    "1½ tablespoons tamarind paste",
    "1½ tablespoons sugar",
    "3 tablespoons sunflower oil",
    "Salt and pepper to taste"
  ],
  "instructions": [
    "Peel the onions and cut off the ends.  With a sharp knife, make a cut on one side of each onion from the top to the bottom, through to the centers – and no further.  Place them in a big pan of boiling water and allow them to cook for 10 to 15 minutes, until they have softened and begin to open up, so that the layers can be detached.  Drain the onions and allow them to cool enough to handle.  When you can handle them, separate each layer carefully by easing your fingers inside each onion, between the layers.  If they don’t detach easily, separate one or two layers of the onion (what can be separated easily), then place the onions back in boiling water to cook some more.",
    "For the filling, knead the ground meat with the salt, pepper, cinnamon, allspice, and parsley.  Place a walnut-size lump of the filling into each curved onion layer and roll it up tightly.  Line the bottom of a wide shallow pan with discarded pieces of the onions (those parts of the onion that would be too small to fill).  (Lining the pan will help protect the rolls when cooking.)  Then, as you fill the onions segments pack them tightly, on top of the onion layer, in the pan.",
    "When all the onions and filling have been used up melt the tamarind paste and 1 tablespoon of sugar in about ¾ cup of boiling water in a small pan.  Pour this mixture over the onions.  Add more hot water to ensure all the onion rolls in the pan are covered.  Place a plate on top to hold the onions down and simmer, covered, over very low heat, adding more water if required, to insure the onions cook for about 45 to 60 minutes and still remain moist.  (The ideal situation is that at the end of the cooking period most of the moisture has been absorbed.)",
    "Arrange the onion rolls in one layer on a flat heatproof serving dish and pour over them the remaining sauce.  Sprinkle the top of the onion rolls with the remaining sugar and place under the oven broiler to caramelize the sugar.  (It will give the onion rolls a warm, wrinkly look.)",
    "The onion rolls are best served hot but are also very good served cold.",
    "Remarks:  This is an elegant dish with an exquisite sweet-and-sour caramelized flavor, a specialty of Aleppo in Syria.  In Egypt we [the author, Claudia Roden] soak the tamarind pods and used the filtered juice.  Now, I [the author, Claudia Roden] find that the Indian tamarind paste, obtainable from Middle Eastern stores, is perfectly good to use.",
    "Yield:  Serves 4 to 6.",
    "Source:  The New Book of Middle Eastern Food by Claudia Roden, published by Alfred A. Knopf, © 1968, 1972, 1985, 2000 by Claudia Roden, distributed by Random House, Inc., New York."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}