{
  "title": "Pan-Seared Steaks with Pizzaióla Sauce (Bisteca alla pizzaiola)",
  "requires": "",
  "ingredients": [
    "1 red bell pepper, cored, seeded and cut into ½-inch slices",
    "1 yellow bell pepper, cored, seeded and cut into ½-inch slices",
    "Salt to taste",
    "4 (8-ounces) strip steaks, ¼-inch thick, trimmed of fat",
    "5 to 6 tablespoons extra-virgin olive oil; divided use",
    "6 garlic cloves, peeled",
    "1½ cups sliced assorted mushrooms",
    "1 (35-ounce) can Italian plum tomatoes (preferably San Marzano brand), seeded and crushed",
    "but still chunky (drain some of the juices if it’s too watery)",
    "1 teaspoon crushed red pepper flakes",
    "4 to 6 fresh basil leaves, shredded - for garnish"
  ],
  "instructions": [
    "Rub the steaks with about 1 tablespoon of olive oil and let them stand at room temperature until they reach room temperature.",
    "In a bowl large enough to contain the colander fill it with cold water and add ice cubes and set aside.",
    "Set a large pot of salted on the stove and bring it to a rolling boil.  Once the salted water reaches a rolling boil carefully stir in sliced bell peppers.  Once the water returns to a boil let the bell pepper strips cook for 2 minutes then drain them using a colander.  Stop the cooking process by immersing the bell pepper strips in the ice water.  Once the cooking process is stopped remove them from the ice water and set them aside to drain.",
    "Place a large, heavy skillet over low heat and allow it to heat up.  Once hot, add 4 tablespoons of olive oil in the skillet and while it is heating use the flat edge of a knife to flatten the garlic cloves.  Add the flattened garlic cloves to the hot oil and allow them to start cooking.  Shake the pan occasionally and cook the garlic until they reach a golden brown color.  At this stage add the mushrooms to the pan season with salt and pepper sauté, stirring for about 6 minutes.",
    "Add the blanched bell pepper strips, the chunky tomato, and the red pepper flakes and stir to mix well.  After everything is well mixed taste and adjust the saltiness and spiciness if necessary.  If necessary, adjust the heat level to keep the mixture simmering for 15 to 20 minutes.",
    "Use a large, heavy cast-iron skillet over medium heat for cooking the steaks.  Once the skillet is hot add the remaining tablespoon of olive oil.  Spread the oil in the hot skillet then arrange the steaks within the skillet and allow them to cook until the underside is well-browned.  Turn the steaks and cook the second side for 2 to 3 minutes for a medium-rare steak; longer for more well done steaks.",
    "Transfer the steaks to a warm platter and over them spoon the tomato-mushroom-bell-pepper sauce.  Shred the basil leaves on top and bring the platter to the table.",
    "Yield:  Serves 4.",
    "Source:  Peppers Add Color to Italian Dish by Lidia Matticchio Bastianich, Dining Section,  Express-News, Wednesday, February 14, 2007."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}