{
  "title": "Picadillo Carmela",
  "requires": "",
  "ingredients": [
    "2 pounds lean ground beef",
    "1 or 2 tablespoon olive oil (depends on how lean the ground beef is)",
    "1 large onion, chopped",
    "2 large cloves garlic, pressed through a garlic press; or finally chopped",
    "½ cup bell pepper, seeded and chopped",
    "½ cup chopped celery",
    "½ cup sliced carrots",
    "½ teaspoon salt",
    "½ teaspoon black pepper",
    "2 tablespoons flour",
    "2 cups Beef Stock (add the 2 tablespoons of flour to the stock and mix well)",
    "½ cup skinned potatoes, cut into 1-inch chunks",
    "1 or 2 whole jalapeños"
  ],
  "instructions": [
    "In a large skillet, over medium-low heat, cook the onion in the olive oil.  At the point just before the onion starts to become translucent add the garlic, and continue cooking until the onion is translucent.  Add the ground beef and cook the mixture, stirring constantly, until no more pink remains in the ground beef.  Add the bell pepper, celery, carrots, salt, and pepper; stir to mix thoroughly and continue cooking.  When all the ingredients have been thoroughly mixed with the ground beef add the beef stock (to which the flour has been added).  The stock should barely cover the meat mixture.",
    "Lower the heat, cover and cook for 10 minutes.",
    "After cooking for 10 minutes, remove the cover and add the potatoes and chopped jalapeños and stir to evenly distribute all the ingredients.  Cover again and simmer for 10 to 15 minutes, until the potatoes are just tender."
  ],
  "remarks": "I like to have raisins in my picadillo so I would add the raisins at the same time one adds the bell pepper, celery, and carrots. Another ingredient that goes well in picadillo is toasted almond slivers.  Again, I would add the almonds at the same time as the bell pepper, celery, and carrots. Yield:  Serves 6 to 8. Source:   Cowboy Cooking by Tom Perini with Paschal Fowlkes, published by Time/Life Books, , © 2000 Tom Perini. Picadillo Carmela",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}