{
  "title": "Pork Braised to Taste like Wild Boar",
  "requires": "",
  "ingredients": [
    "3 pounds boneless pork loin roast",
    "2 ounces lean salt pork, cut into very thin slices",
    "3 tablespoons extra-virgin olive oil",
    "2 medium yellow onions, thinly sliced",
    "2 to 3 medium yellow potatoes, peeled and cut into sections",
    "2 garlic cloves, crushed (use the flat side of a knife)",
    "1 celery stalk, thinly sliced",
    "2 medium carrots, thinly sliced",
    "2 large bay leaves, preferably “Turkish”",
    "Leaves from 3 to 4 sprigs of fresh sage",
    "Leaves for 3 to 4 fresh thyme",
    "Sea salt and freshly ground black pepper",
    "6 to 8 black peppercorns",
    "Water (optional)",
    "2 cups flavorful red wine, such as Italian Chianti or Spanish Rioja"
  ],
  "instructions": [
    "Lightly salt, but heavily black pepper, the pork roast rubbing all the seasonings into the flesh of the roast and set aside.",
    "Preheat the oven to 425° F.",
    "In a heavy sauce pan, large enough to hold the whole pork roast, or cast iron Dutch oven, melt the salt pork in the olive oil over medium-low heat.  This should take a few minutes, but look for when the salt pork slices are transparent, but don’t let them brown.  When the salt pork is translucent, it will have by then given up most of its fat, add the onions, garlic, celery, and carrots.  Stir the mixture well then mince and add the bay, sage, and thyme leaves and stir them into the vegetables in the pot.",
    "Set the roast, fat side up, on top of the vegetables and sprinkle the peppercorns around the edges.  Cover the pot with a tight-fitting lid, or Dutch oven, and place on the center rack of the oven and bake for 40 minutes.  The vegetables should give off plenty of liquid as the cook and soften, but check the pot halfway through the cooking time to make sure nothing is burning.  Add a couple of tablespoons of water if the pot seems too dry.",
    "When the 40 minutes are up, remove the pot from the oven and pour in the red wine over the roast and turn it over.  Cover again and return the pot to the oven for an additional 30 minutes.  At the end of this time, again remove the pot from the oven and turn the roast over once more so that the fat side is once again uppermost.  Return the pot to the oven only this time without the lid to let the roast brown and the juices in the pot reduce.  This should take from 20 to 30 minutes.",
    "When the roast is “caramel brown” on top, remove the pan from the oven and remove the roast onto a platter to let it rest.",
    "At this point you need to decide if you’re going to puree the vegetables and add them back into the pan juices; or, serve the roast with the vegetables as an accompaniment to the roast.",
    "Remove the vegetables to the container of a blender and add some of the pan juices and puree the mixture.  Allow the remaining pan juices to come to a boil over high heat then add the puree mixture.  Allow the “gravy” mixture to cook over the heat and thicken as much as you wish.  Pour the gravy into a serving dish.",
    "Remove the vegetables from the cooking pot and keep warm.  Allow the pan juices to come to a boil and thicken slightly to serve “au jus” (natural juices) style.",
    "Let the meat stand for 30 minutes or so, then slice and arrange the pork on a serving platter with the vegetables and the gravy.",
    "Remarks:  The original recipe doesn’t call for potatoes but in my “house” one doesn’t serve a roast with potatoes.",
    "Yield:  Serves 8.",
    "Source:  The Essentials Mediterranean by Nancy Harmon Jenkins, Harper Collins Publishers, Inc., , ©2003 by Nancy Harmon Jenkins."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}