{
  "title": "Pot Roasted Pork with Yellow , Plantain and Piloncillo",
  "requires": "",
  "ingredients": [
    "1 small cone (about 1 ounce) piloncillo; or, 2 tablespoons dark brown sugar\n1½ tablespoons vegetable oil\n½ pound (about 6 medium) fresh yellow chiles (I prefer hot Hungarian wax or banana peppers here)\nA 2-pound boneless pork shoulder roast\n1 medium white onion, sliced ¼-inch thick\nOne 18-inch section of banana leaf, hard spine cut off, plus an extra piece to line the serving platter\n 1 large (10-ounce) ripe plantain (it should be noticeably soft and yellow splotched with black), peeled and cut into ½-inch cubes\nSalt\n1 small red onion, sliced into rings 1/8 inch thick\n2 limes, cut into wedges"
  ],
  "instructions": [
    "Fill a microwaveable measuring cup with ¾ cup water.   Add the piloncillo (or brown sugar) and microwave on high for 1 minute.  Remove and let stand until piloncillo dissolves, about 5 minutes.  (The brown sugar will dissolve more quickly.)",
    "Roast the chiles over an open flame or 4-inches below a preheated broiler until blackened and blistered all over.  Place in a bowl and cover with a kitchen towel and let cool until they can be handled.  One by one, clean the chiles:  Cut off the stem-end, slit down the side from seed pod to point, and open out flat.  Gently scrape out the seeds and discard.  Flip the chile over and, scrape off the blistered skin.  Cut the cleaned chile flesh into ½-inch slices.",
    "In a large (7-quart) Dutch oven, heat the oil over medium-high.  Brown the pork on all sides—it’ll take about 8 minutes—then remove it to a plate. Add the white onion to the pan and cook until richly browned, about 8 minutes. Scrape it into a bow; set the pan aside.",
    "Heat the oven to 325 degrees. If a strip of the hard central rib is still attached to one side of the banana leaf, cut it off with scissors.  Then use the leaf to line the unwashed Dutch oven (it will spill over the sides).  Lay in the pork.  Strew the onions over the pork, followed by chile strips and plantain.  Drizzle all the ingredients with the piloncillo water.  Fold the ends of the leaf in to cover the whole affair, secure the lid and bake until the pork is fork tender, 1 ½ to 2 hours.",
    "Line a warm serving platter with a fresh banana leaf.  With the aid of two spatulas, transfer the pork to the platter.  Use a pair of tongs to break it into small chunks.",
    "Remove the banana leaves from the pan, scraping any clinging goodness back into the pan.  If there is a lot of fat on top of the juices, spoon it off.  Taste the juices and season highly with salt. Spoon everything in the pan over the pork.  Garnish with red onion rings and lime wedges, and carry to the table, along with plenty of warm tortillas for making very delicious tacos.",
    "Yield:  Serves 4.",
    "Source:  Recipe is from Season 5 of “ – One Plate at a Time” by Rick Bayless (Asado de Puerco con chile güero, plátano y piloncillo)."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}