{
  "title": "Potato Lasagna",
  "requires": "",
  "ingredients": [
    "1½ pounds ground beef",
    "1 tablespoon olive oil",
    "1 medium size yellow onion, chopped",
    "1 jar (32-ounces) spaghetti sauce",
    "1 teaspoon dried basil",
    "1 teaspoon dried oregano",
    "1 teaspoon sugar",
    "½ teaspoon salt",
    "¼ teaspoon black pepper",
    "⅓ cup water",
    "1 can (4 ounces) mushroom pieces and stems, drained",
    "5 medium sized potatoes, peeled and thinly sliced into half-moons wedges",
    "2 cups (8-ounces) shredded Mozzarella cheese"
  ],
  "instructions": [
    "Set aside a baking dish, 13-inch, by 9-, by 2-inch for the potato lasagna.",
    "In a large skillet set over medium high heat, heat the olive oil, and when it begins to smoke lightly sauté the onion.  Once the onion begins to wilt and become translucent add the ground beef and continue sautéing until the beef is browned and all the pink is gone.  Remove the skillet from the heat source; tilt the skillet and spoon out all the juices and oils that have been released.  Return the skillet to the heat source and pour in all of the spaghetti sauce; stir to mix.  Add the seasonings (basil, oregano, sugar, salt, and black pepper) and stir to mix well.  Finally, add the mushrooms and water and mix all the ingredients well.  Turn off the heat and allow the mixture to remain on the heat source until the potatoes are peeled, cut, and ready.",
    "Wash and peel the potatoes.",
    "Preheat the oven to 350° F.",
    "Pour half of the meat sauce into the baking dish and cover with all of the potatoes.  Pour, and spread, the remaining meat sauce over the potatoes.  Cover the baking dish with a sheet of Aluminum foil and fold it tightly around and under the baking dish.  Place the baking dish in the center rack of the preheated oven and bake for 1 hour and 15 minutes; or, until the potatoes test as “tender” through and through.  Remove the baking dish from the oven and remove and discard the foil.",
    "Sprinkle all of the mozzarella cheese over the baked potato lasagna and return it to the oven for another 10 minutes; or, until the cheese melted.  Remove from the oven and set it on a metal grille to cool for 10 minutes before bring it to the table or serving.",
    "Remark:  I would recommend that after one sprinkles the mozzarella over the baked potato lasagna and return it to the oven, that leave the oven set at 350° F. for 5 minutes then that you change the oven setting to “grill.”  Allow the baked potato lasagna to remain under the grill setting just long enough to obtain a light grilled cheese look.",
    "Yield:  Serves 8 to 10.",
    "Source:  Oven Meals, Taste of Home Ground Beef Recipe Collection, Vol. 3, 1999."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}