{
  "title": "Roasted Pork with Cranberry Chutney",
  "requires": "Cranberry chutney, the recipe for which is in the “Sauces, Stocks, and Dressings” folder.",
  "ingredients": [
    "1 (3-pound) pork loin or boneless pork butt roasts; or, 2 (1½-pound) pork tenderloins",
    "For the Brine:",
    "9 cups hot water",
    "½ cup sugar",
    "½ cup kosher salt",
    "2 tablespoons cracked black peppercorns",
    "For the Rub:",
    "2 teaspoons salt",
    "2 teaspoons granulated garlic",
    "1 teaspoon chili powder",
    "1 teaspoon paprika",
    "2 tablespoons light brown sugar"
  ],
  "instructions": [
    "Make the brine by combining the hot water, sugar, and salt.  Stir until the sugar and salt are dissolved then add the cracked black peppercorns.  Cool the mixture to below 45º F. in the refrigerator.",
    "When the brine is ready place your pork loin or butt roast in a large bowl and add the brine.  You want to make sure that the pork is totally submerged in the brine.  Cover and refrigerate for 1 to 2 days, stirring the brine and turning the pork occasionally.",
    "After the brining period is done, remove the pork from the brine and pat it dry with paper towels.  Allow the pork to come to room temperature before cooking.",
    "If you are using a pork roast, cook it in the oven; if however, you are using pork tenderloin grill it over charcoals as follows:",
    "For Roasts:",
    "Preheat the oven to 450º F.  Rub the roast with the spice rub made by combining all the “Rub” ingredients.  Lay the roast, fat side up, in a roasting pan and roast it for 15 minutes, then turn the oven heat down to 300º F. and roast for about 1 hour more, until the center reads 145º F., up to 150º F., on and thermometer.  Remove the meat from the oven and place it on a cutting board, cover it loosely with foil for about 15 minutes before slicing.",
    "For Tenderloins:",
    "Build your fire in the grill in two levels by banking all the charcoal over to one side of the grill and leaving other side with no coals.  Place a drip pan under the side of the grill that is free of charcoals.  When the fire is ready grill the tenderloins over direct heat on the side where the charcoal is banked, about 1½ to 2 minutes per side.  After the sides of the tenderloin have been seared in this fashion move them to the part of the grill without charcoal, the cooler side of the grill, over the drip pan.  Lower the top of the grill and cook for 2 to 3 minutes more per side, until the meat is firm to the touch and a thermometer reads 145º F., up to 150º F.  Remove the meat from the grill and place it on a cutting board, cover it loosely with foil for about 15 minutes before slicing."
  ],
  "remarks": "Sergio Rodriguez, Executive Chef for Don Strange of , shared this recipe with Pat Mozersky, which she published in her Chefs’ Secrets article.  Sergio Rodriguez writes:  “For a pork loin or butt I brine it a day ahead, then proceed with the roasting.  Tenderloins require only 6 to 8 hours.” Yield:  Serves from 4 to 6 persons. Source:  Chefs’ Secrets by Pat Mozersky, Food & Dining Section,  Express News, .",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}