{
  "title": "San Antonio Snapper",
  "requires": "",
  "ingredients": [
    "2 tablespoons olive oil",
    "1 small onion diced",
    "1 small green bell pepper, seeded and diced",
    "1 jalapeno pepper, seeded, de-veined and minced",
    "3 garlic cloves, minced",
    "1 pounds fresh ripe tomatoes, seeded and diced",
    "4 tablespoons minced fresh cilantro",
    "1 teaspoon salt, plus more to taste",
    "½ teaspoon freshly ground black pepper, plus more to taste",
    "¼ teaspoon sugar",
    "¼ teaspoon dried thyme",
    "¼ teaspoon dried oregano",
    "1 small bay leaf",
    "1 teaspoon fresh lemon juice, plus more to taste",
    "1 cup all-purpose flour",
    "1½ pounds red snapper fillets with skin",
    "3 tablespoons vegetable oil"
  ],
  "instructions": [
    "In a large skillet, heat the olive oil over medium heat until hot.  Add the onion and bell pepper and cook for 3 minutes, stirring frequently.  Stir in the jalapeno and garlic and cook for one more minute.  Stir in the tomatoes, 2 tablespoons of the cilantro, ½-teaspoon salt, ¼-teaspoon pepper, sugar, thyme, oregano and bay leaf.  Reduce the heat to low and simmer for 15 minutes, stirring occasionally.",
    "Remove the bay leaf and simmer the sauce for 20-25 minutes more, or until thickened.  Stir in the lemon juice.  Taste and add additional salt, black pepper and lemon juice, if needed.",
    "In a shallow bowl or plate, combine flour, the remaining salt and pepper.  Dip the fish fillets in the flour mixture to coat.",
    "In a large skillet, heat the vegetable oil over medium heat until hot.  Add the fish, skin side down, making sure the fillets do not touch each other.  Cook the fish for 3-4 minutes on each side, or until golden brown.  Transfer the cooked fish onto a paper towel lined platter to drain.",
    "Serve the fish fillets immediately with the sauce spooned over the top and garnished with the remaining 2 tablespoons of cilantro.",
    "Yield:  Serves 4.",
    "Source:    Recipe Extra, San Antonio Express-News, Wednesday, March 17, 1999."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}