{
  "title": "Sautéed Pork Chops Requires:  The recipe for Julia Child’s Spice Blend is in the “Miscellaneous” < “Odds and Ends” folder while the recipe for her “Flavorful Brown Stock”  is in the “Sauces, Stocks, and Dressings” folder.",
  "requires": "",
  "ingredients": [
    "2 center-cut pork rib or loin chops, each about 10 ounces, 1¼ to 1½ inches thick",
    "1 tablespoon, or more, vegetable oil",
    "¼ teaspoon salt",
    "½ teaspoon or more Julia Child’s Spice Blend",
    "¼ cup dry white French vermouth",
    "½ cup Flavorful Brown Stock",
    "A sprig of fresh savory, or thyme; or, a “big pinch” of the dried savory (or thyme)",
    "1 teaspoon chutney (Earl Gray’s)",
    "1 tablespoon soft butter"
  ],
  "instructions": [
    "At least ½ hour in advance of cooking trim the rib chops as shown in the series of photos below, and trim off any excess fat and sinews.",
    "To season the chops, rub each side with drops of vegetable oil to coat lightly, sprinkle with salt, and rub in some of the spice blend, using about ½ teaspoon in all.  Cover the chops and refrigerate until ready to cook.  Set the frying pan over moderately high heat and film the bottom with oil.  Meanwhile, rapidly dry the chops on paper towels, and when the pan is very hot lay in the chops.  Sauté the chops until they are lightly browned on both sides, about 3 to 4 minutes per side.",
    "Pour the vermouth and stock into the pan, add the herbs, cover the pan, and adjust heat to maintain a slow simmer.  Cook slowly 4 to 5 minutes, turn, and cook 4 to 5 minutes on the other side.  They are done when you cut close to the bone with a little knife and the meat is only faintly pink.",
    "Remove the chops to a side dish while you rapidly boil down the pan juices until they are syrupy.  Stir in the chutney and simmer a moment, then return the chops to the pan.  With the chops back in the pan baste them with the sauce; then taste and adjust the seasoning if necessary.  When the chops have returned to temperature remove the pan from the heat, place the chops on a warm serving plate, leaving the sauce in the pan.  Return the pan to the heat and simmer the sauce, remove the pan from the heat, drop in the butter and swirling the pan by the handle allow the butter to melt and be incorporated completely into the sauce.  Pour the sauce over the chops and serve immediately.",
    "Remark:   Pork, cooked “rare” has not developed its optimum flavor.  Pork develops it’s optimum flavor and tenderness when only a hint of pink remains in the meat next to the bone; over cooked the pork becomes dried out and begins losing its optimum flavor.",
    "Yield:  Serves 2.",
    "Source:  Julia and Jacques Cooking at Home by Julia Child and Jacques Pepin, published by Alfred A. Knopf, Inc., © 1999 by A La Carte Communications."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}