{
  "title": "Shrimp with Orange and Tequila (Camarones con Naranja y Tequila)",
  "requires": "",
  "ingredients": [
    "1 orange",
    "6 tablespoons unsalted butter",
    "2 tablespoons finely chopped white onion",
    "2 cloves garlic, peeled",
    "16 large shrimp, peeled with the final tail segment intact and deveined",
    "1 chile chipotle en adobo; or, 2 serrano chiles, finely chopped",
    "¼ cup tequila reposado",
    "3 tablespoons minced fresh cilantro",
    "Salt to taste (preferably sea salt)"
  ],
  "instructions": [
    "With a zester or vegetable peeler, cut the zest from the orange in very narrow strips, being careful to avoid any of the white pith.  Bring a saucepan of water to a boil and place the strips of zest in a small sieve or slotted spoon and plunge them into the boiling water, remove them immediately and rinse under running cold water.  Repeat this process three times.  (What you are attempting to do is to remove the “bitter” taste.)  Finally, pat the zest strips dry with paper towels and set them aside.",
    "In a frying pan over medium heat, melt the butter.  Add the onion and sauté it until it’s translucent, 3 to 4 minutes.  Add the garlic cloves and the shrimp and cook, stirring frequently, until the shrimp turns pink and begins to curl, 4 to 5 minutes.  (Do not over cook the shrimp; they should be tender, not rubbery.)",
    "Add the chipotle chile (or the minced serrano chiles) and the orange zest strips.  Stir briefly to mix.  Pour the tequila over the shrimp, carefully ignite with a long match, and let the flames burn out.  Add the minced cilantro, season with salt, and serve on a warm platter or individual plates.",
    "Remarks:  This coastal dish, from Maria Dolores Torres Yzábal, has an orange-and-chile sauce for a tangy accent should be served with seasoned white rice.",
    "Yield:  Serves 4.",
    "Source:  Savoring Mexico:  Recipes and Reflections on Mexican Cooking, by Marilyn Tausend, published by Time Life Books, a division of Time Warner Inc., © 2001 Weldon Owen Inc.",
    "Camarones con Naranja y Tequila"
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}