{
  "title": "Stuffed Pork Chops",
  "requires": "",
  "ingredients": [
    "6 bacon slices; fried until crisp and crumbled; reserve 2 tablespoons of drippings",
    "2 Granny Smith apples, peeled and diced",
    "2 shallots, finely chopped",
    "1 tablespoon chopped fresh ginger",
    "1 tablespoon chopped fresh sage",
    "1 cup  cheese, cubed",
    "6 (1½-inch-thick) center-cut pork loin chops",
    "¼ teaspoons salt",
    "¼ teaspoons pepper",
    "2 tablespoons olive oil"
  ],
  "instructions": [
    "Cook the bacon in a large skillet until its crisp then remove it to paper towels.  Pat the bacon dry with paper towels and set it aside until its cool.  When the bacon is cold and dry crumble and set the bacon bits aside.  Reserve 2 tablespoons of the bacon drippings.",
    "Sauté the apples with the shallots and the ginger in hot bacon drippings for 5 minutes; or, until the apple are tender.  Remove the skillet from heat and stir in the sage and allow the mixture to cool.",
    "When the apple mixture cools, combine it with the bacon bits and cubed cheese.  Stir to mix well.",
    "Cut a horizontal slit through the side of each pork chop to the bone, without breaking through, to form a pocket in each pork chop. Sprinkle both sides and inside the pocket with salt and pepper.  Spoon the apple mixture evenly into pockets, and secure with wooden picks.",
    "Preheat the oven to 425° F.",
    "Add the olive oil to a large skillet and place over medium-heat.  When the oil is hot and barely smoking carefully lay in the pork chops.  Cook the pork chops in batches, to avoid the buildup of released juices in the olive oil, in a large skillet for 1 to 2 minutes on each side; or, until they are golden.",
    "Remove the pork chops from the skillet and place them in a lightly greased roasting pan; or, in a large shallow baking dish.",
    "Bake the pork chops, uncovered, at 425° for 25 to 30 minutes; or, until the internal temperature of the pork, at the thickest part, measures 175° F. on a meat thermometer.",
    "Yield:  Serves 6.",
    "Source:  http://www.worldfamousrecipes.com/"
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}