{
  "title": "Tamale Pie Recipe Courtesy Gourmet Magazine Cook's Note: Chili can be made 1 day ahead and cooled, uncovered, then chilled, covered. For Chili:\n4 tablespoons vegetable oil\n2 pounds boneless beef chuck or rump, cut into 1/2-inch cubes\n1 large onion, chopped\n2 large fresh jalapeno chiles, seeded if desired and finely chopped\n4 garlic cloves, finely chopped\n1 teaspoon salt\n3 tablespoons chili powder\n1 (28-ounce) can crushed tomatoes in puree\n1 (10-ounce) box frozen corn\n1 1/2 cups water\n1 (15 to 16-ounce) can pinto or black beans, drained and rinsed \n1 cup chopped pimiento-stuffed green olives \n\nFor Topping:\n1 cup all-purpose flour\n1 cup yellow cornmeal (not coarse) \n3 ounces coarsely grated sharp cheddar (3/4 cup) \n1 1/2 tablespoons sugar\n2 teaspoons baking powder\n1/2 teaspoon salt\n1/2 teaspoon ground cumin\n1 medium fresh jalapeno chile, seeded and finely chopped\n3/4 cup milk\n3 tablespoons unsalted butter, melted and cooled\n1 large egg, lightly beaten Make chili: Heat 3 tablespoons oil in a 5 to 6-quart heavy pot over moderately high heat until hot but not smoking, then brown beef in 4 batches, stirring occasionally, about 4 minutes per batch, transferring with a slotted spoon to a bowl. Add remaining tablespoon oil to pot and cook onion and jalapenos over moderately high heat, stirring, until onion is softened, about 4 minutes. Reduce heat to moderate, then add garlic, salt, and chili powder and cook, stirring, 1 minute. Return beef to pot with any juices that have accumulated in bowl and stir in tomatoes, corn, and water. Simmer chili, uncovered, stirring occasionally, until meat is very tender, 1 1/4 to 1 1/2 hours. Remove from heat and stir in beans, olives, and salt, to taste. Transfer chili to a shallow 3 quart baking dish. Make topping: Preheat oven to 400 degrees F. Whisk together flour, cornmeal, cheese, sugar, baking powder, salt, cumin, and jalapeno in a large bowl. Whisk together milk, butter, and egg in a small bowl, then stir into flour mixture until just combined. Drop batter by large spoonfuls (about 8) over chili, spacing them evenly, and bake in middle of oven 10 minutes. Reduce temperature to 350 degrees F and bake pie until topping is cooked through, about 30 minutes more. Yield: 8 servings\nPrep Time: 35 minutes\nCook Time: 2 hours 20 minutes\nDifficulty: Medium",
  "requires": "",
  "ingredients": [],
  "instructions": [],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}