{
  "title": "Tangy Yucatecan Grilled Pork with Roasted Onions & Fresh Garnishes",
  "requires": "",
  "ingredients": [
    "2 medium white onions, unpeeled\n1½ pounds well-trimmed, thin-cut, boneless pork steaks, cut from the shoulder or leg; or,\n \t1½ pounds thin-cut, boneless pork chops\n¾ cup fresh sour orange juice, plus a little more if needed; or, a generous ½ cup fresh lime juice,",
    "plus a little more if needed\nSalt and freshly ground black pepper, for seasoning the meat and vegetables\n3 cups thinly sliced cabbage\n⅓ cup roughly chopped cilantro, plus a few sprigs for garnish\n1 pound (2 medium-large round) ripe tomatoes, cored and sliced ¼-inch thick\n1 large avocado, peeled, pitted and sliced ¼-inch thick"
  ],
  "instructions": [
    "1.  Roasting the onions.  Light a charcoal fire and let it burn until all the coals are medium- hot and covered with gray ash. Nestle the onions directly in the coals and let them roast until charred on the outside and soft within, about 20 minutes.\n\n2.  Preparing the meat and vegetables.  While the onions are roasting, pound the meat with a flat mallet to about 1/8 inch thick. Drizzle with 1/4 cup of the sour orange (or 3 tablespoons lime) juice, cover and set aside.  Cool the onions until they can be handled, peel the charred outer layers off, then cut what remains into 1/2-inch squares. Toss with 1/4 cup of the sour orange (or about 3 tablespoons lime) juice and season with salt and pepper.  Toss the cabbage with the cilantro and the remaining 1/4 cup of the sour orange (or 3 tablespoons lime) juice; season with salt and pepper. Spread onto a large serving platter about 14-inches or so in diameter. Decorate the perimeter with alternating slices of tomato and avocado, and sprinkle them with salt and pepper.\n\n3.  Grilling and serving.  Stoke your fire with new charcoal and let it get really hot.  Sprinkle both sides of the meat generously with salt and pepper. Working with a couple of pieces at a time, grill the pork: let it sear about 2 minutes on one side, then flip it over and sear on the other.  (The total cooking time for 1/8-inch pork steaks over a very hot fire will be no more than 3 or 4 minutes.)  Lay the meat slightly overlapping down the center of the platter and strew the onions over the meat. Decorate with a few cilantro sprigs and serve without delay, accompanied by salsa and baskets of hot tortillas."
  ],
  "remarks": "This simple dish could easily be made with butterflied, pounded, boneless, skinless chicken breasts or with skirt steak.  If you like spicy food and want more flavor in the marinade, smear a little habanero salsa over the meat in place of the sour orange. There are various versions of poc chuc, from saucy to plain, but until I tasted the one at El Príncipe Tutul Xiu in Maní, I never thought the dish more than an example of the utterly simple side of Mexican cooking, food to fill your stomach.   Still, even the best poc chuc is the simplest of dishes, and you need all the parts in place or you won’t hear the band: you need the charcoal fire, the grill-roasted onions, the sharp marinade for the pork, the plateful of lightly seasoned vegetables and the explosive dribble of roasted habanero salsa. Start with a batch of margaritas and some Crusty Griddle-Baked Quesadillas from a griddle set right on the grill-- then, with the pork, serve a cup of Classic Mexican “Pot” Beans (the beans served with this dish in the Yucatan are customarily blended to a medium-thick puree and strained,  frijoles colados). These are very rustic, al fresco flavors, so margaritas may be too refined; you may think they cry out for a cold beer. [Comment by Rick Bayless] Yield:  Serves 4. Source: Recipe is from Season 5 of “ – One Plate at a Time” by Rick Bayless.",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}