{
  "title": "Tex-Mex Chili Meat Loaf",
  "requires": "",
  "ingredients": [
    "3 tablespoons olive oil",
    "1 cup finely chopped onion",
    "1 large sweet red bell pepper, stemmed, cored, and finely chopped",
    "2 to 3 fresh jalapeño chiles, stemmed, seeded and minced",
    "2 large garlic cloves, peeled and minced",
    "2 tablespoons mild chili powder blend",
    "2 teaspoons salt",
    "1½ teaspoons oregano, crumbled",
    "1½ teaspoons ground cumin",
    "1 (28-ounce) can Italian-style plum tomatoes, crushed and drained",
    "1½ pounds ground beef, not too lean",
    "½ pound ground pork, not too lean",
    "1 cup fine, dry (commercially prepared) bread crumbs",
    "2 eggs, beaten",
    "1 cup frozen corn kernels, thawed and drained",
    "3 green onions, trimmed and sliced; about ½ cup",
    "8 ounces grated mozzarella cheese"
  ],
  "instructions": [
    "In a medium size skillet set over moderate (medium) heat, warm the olive oil, and sauté the onions, red bell pepper, garlic, stirring, occasionally.  Add the chili powder blend, the oregano, cumin, and the salt as the sautéing progresses.  When the vegetables and all the spices are well mixed, cover, lower the heat, and continue cooking for 10 minutes more.  Add the tomatoes and cook, covered, stirring once or twice, for an additional 10 minutes.  Remove from the heat and allow the mixture to cool to room temperature.",
    "Position a rack in the lower third of the oven and preheat the oven to 350° F.",
    "In a large mixing bowl, combine the beef and the pork.  Add the tomato mixture, bread crumbs, and the beaten eggs and mix thoroughly (it’s best to do this by hand).  When the mixture is well mixed add the corn and green onions and once again mix by hand.  Transfer this mixture to a relatively shallow baking dish and form it into a flat loaf.",
    "Bake the meat loaf for about 1 hour and 20 minutes; or, until a thermometer inserted into the center of the loaf registers 160° F.  Remove the meatloaf from the oven and pour off any fat from the dish.  Sprinkle the cheese evenly over the meatloaf and return it to the oven until the cheese is just melted, about 4 minutes.  Serve immediately.",
    "Yield:  Serves 8.",
    "Source:  The El Paso Chile Company’s Texas Border Cookbook, by W. Park Kerr and Norma Kerr, published by William Morrow and Co., Inc., New York, © 1992 by W. Park Kerr and Norma Kerr and Michael McLaughlin."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}