{
  "title": "Texas Party Brisket",
  "requires": "",
  "ingredients": [
    "1 (13¾-ounce) can beef broth, preferably homemade",
    "1 (4-ounce) bottle liquid  smoke",
    "¼ cup Worcestershire sauce",
    "1 tablespoon dark brown sugar",
    "1 tablespoon hot pepper sauce",
    "1 tablespoon tomato paste",
    "Flour",
    "1 (5-pound) top-cut brisket of beef",
    "1 large onion, peeled and sliced",
    "3 large garlic cloves, peeled and minced"
  ],
  "instructions": [
    "In a medium size mixing bowl, whisk together the beef broth, liquid smoke, Worcestershire sauce, brown sugar, hot pepper sauce, and the tomato paste.",
    "Prepare and flour a large (holding up to 12 pounds) brown-in-bag according to the manufacturer’s directions.  In it lay the brisket, fat side up, and put the bag in a shallow baking dish just large enough to hold it.  Scatter the onion slices and the garlic over the brisket.  Pour the broth mixture over the brisket and seal the bag.  Let the sealed bag stand at room temperature for 1 hour.",
    "Position a rack in the middle of the oven and preheat the oven to 325° F.",
    "Bake the brisket about 4 hours; or, until it is very tender.  Remove it from the oven and let it rest in the bag for 10 minutes.",
    "Transfer the brisket to a cutting board, discard the onion slices and liquid.  Carve the brisket across the grain and at a slight angle, into thin slices.  Serve immediately."
  ],
  "remarks": "With brisket its best not to trim off too much of the fat before cooking as the fat add loads of flavor to the meat as it cooks.  Wait until after it’s cooked, and you are carving the brisket, to trim off and discard the fat. This recipe duplicates (sort of) a real barbecued brisket from a real smokehouse. It can be served like a regular pot roast with potatoes and all the trimmings; or, served just like fajitas with barbecue sauce, tortillas, and the trimmings. Yield:  Serves 8. Source:  The El Paso Chile Company’s Texas Border Cookbook, by W. Park Kerr and Norma Kerr, published by William Morrow and Co., Inc., New York, © 1992 by W. Park Kerr and Norma Kerr and Michael McLaughlin.",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}