{
  "title": "Trail Blazing Beef Stew",
  "requires": "",
  "ingredients": [
    "6 Tablespoons olive oil, used in two equal parts",
    "2 Pounds boneless chuck or pot roast, trimmed of fat, and cut into bite size cubes",
    "1 teaspoon garlic powder, used in two equal parts",
    "2 teaspoons ground cumin, used in two equal parts",
    "2 large white onions cut into 8 segments each",
    "5 cups beef stock",
    "3 cups water",
    "4 garlic cloves, minced",
    "9 large red potatoes cut into halves",
    "4 ears fresh corn, cut into fourths (use frozen corn if fresh corn is not available)",
    "2 large carrots, peeled and cut into 1-inch pieces",
    "½ cup coarsely chopped fresh cilantro",
    "1 teaspoon salt",
    "½ teaspoon ground black pepper"
  ],
  "instructions": [
    "Heat 3 tablespoons of the oil in a large skillet and, when it’s just starting to smoke, stir-fry the beef cubes with half of the garlic powder, and cumin.  When the beef cubes begin to caramelize remove them with a slotted spoon and put them in a 6- or 8-quart stockpot.  Add the remaining oil and again just as it begins smoking sauté the onion until just soft.  Transfer the onion, using a slotted spoon, to the stockpot in which you’ve placed the beef.",
    "Add all the remaining ingredients to the stockpot: the remaining half measures of garlic powder and cumin, the beef stock, water, minced garlic cloves, potatoes, corn, carrots, cilantro, salt and pepper and bring it all to a boil.  Once it begins boiling reduce the heat to low, cover, and simmer for 1½ to 2 hours.",
    "Serve with tortillas.",
    "Remarks:  I [the author, Tom Perini] think of stew as being chunky and soup as being more liquid, and this is definitely stew – and a real cowboy version.  On a chuck wagon you might not have a lot to put in, but at the “cook shack” you’ve potatoes, corn, carrots and all kinds of things to add.  You put them in, in the order of how long it takes things to cook.  When you dip in and get a spoonful, you should get a taste of everything.",
    "Yield:  Serves 6 to 8.",
    "Source:   Cowboy Cooking by Tom Perini with Paschal Fowlkes, published by Time/Life Books, , © 2000 Tom Perini.",
    "Trail blazing beef stew"
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}