{
  "title": "with a Kick",
  "requires": "",
  "ingredients": [
    "2 (6 to 8 ounce) beef tenderloins",
    "2 teaspoon horseradish",
    "1 package, prepared puff pastry",
    "2 medium size mushrooms (you may use canned mushrooms)",
    "1 egg",
    "Salt and pepper, to taste"
  ],
  "instructions": [
    "Trim and clean the two pieces of beef tenderloin; then pat dry with paper towels.  Season each of the two tenderloins with salt and pepper, to taste.",
    "Add one tablespoon of vegetable shortening to a hot skillet and when the shortening is “very hot” place the tenderloins in the skillet and sear for one minute on all sides, over medium-high heat.  (If your skillet isn’t large enough to accommodate the two tenderloins simultaneously then sear them one at a time.)  When the searing is to your satisfaction remove the skillet from the heat and spread 1 teaspoon of horseradish on top of each of the tenderloins.  Remove from the heat and allow the meat to rest and cool while you continue.",
    "Prepare the egg wash by adding one tablespoon of water to an egg and beating to combine and set aside.",
    "Clean and slice the mushroom in half along the long axis.  Then laying each mushroom half flat on the cutting board and slice it thinly.",
    "When the tenderloins have cooled preheat the oven to 450° F.",
    "Slice an 8-ounce square of puff pastry in half and with a rolling pin roll each half into 6-inch squares.  On the center of each square of puff pastry place at least 6 of the mushrooms; creating a bed on which to set the tenderloins.  Place the tenderloins on top of the mushrooms, making sure to keep the side on which you spread the horseradish to the top.  With a brush, brush with the egg wash all edges of the puff pastry around the tenderloin and mushrooms.",
    "Fold two of the opposite sides of the puff pastry up and over the tenderloin; press to seal.  Again, brush with egg wash the puff pastry now enclosing the tenderloin.  Fold the two remaining ends (now doubled over) of the puff pastry up and over the tenderloin; again press to seal.  Place the puff pastry enclosed tenderloins on a baking sheet, so that the folds are on the bottom.",
    "Bake the puff pastry encased tenderloins at 450° F. for 12 minutes for “rare”; or, for 15 minutes for “medium well”.  Remove the puff pastry encased tenderloins when done and allow them to rest for 15 minutes before bring them to the table, as they will continue to cook within the puff pastry pockets during this time.",
    "Remark:",
    "No mention was made of brushing the puff pastry with the remaining egg wash before placing the tenderloins in the oven.  However, I suspect they should be.",
    "Also, check to see how the puff pastry is doing after baking for about 7 to 8 minutes; to see if it’s browning too fast.  If they are browning too fast cover each with a segment of aluminum foil.  But, don’t panic; and do allow the tenderloins to cook for the full time recommended.",
    "The article which had this recipe suggested that grilled tomatoes were an excellent accompaniment.",
    "Yield:  Serves 2.",
    "Source:  Cheap Thrills by Lombardo and Bùi, Food Section,  Express-News, Wednesday, January 25, 2006."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "06 - Main Meals"
}