{
  "title": "Albondigas",
  "requires": "",
  "ingredients": [
    "1 pounds ground beef",
    "1 tablespoon rice",
    "6 tablespoons diced onion, used in two equal portions",
    "Bread crumbs (enough to get a good meat mixture, not too wet or too dry)",
    "1 egg",
    "1 8-ounce can of tomato sauce",
    "Salt and pepper, to taste",
    "¼ to ⅓ cup of Masaca (corn tortilla flour)"
  ],
  "instructions": [
    "In a mixing bowl mix together the ground beef, rice, 3 tablespoons of the diced onions, bread crumbs, egg, and the salt and pepper.  When well mixed take small portions and shape them into meatballs.  (It’s best if they come out smaller than one inch size.)",
    "Add a tablespoon of olive oil to a large cooking pot, set over medium heat, and bring the oil up to cooking temperature.  When the oil is hot add the remaining three tablespoons of onion and sauté it.  Once the onion becomes translucent pour in the tomato sauce and stir; then add about a cup of water.  There should be enough water so that all the meatballs are submerged in liquid as they cook; so add more water if necessary.",
    "Bring the contents to a boil then lower the temperature to keep the ingredients in a low simmer and continue cooking the meatballs for 30 to 40 minutes.  Stir occasionally to keep the meatballs from sticking.",
    "20 minutes before the end of the cooking time pour the Masaca (corn tortilla flour) into a mixing bowl then carefully add the water.  Using your fingers … mix.  Add additional water to the mixture until you get a workable masa.  (I’ve found it’s best to start with “too little” water and adding more water as required until you get the correct mixture!  Too much water gives you a mixture that is too “wet” and the dough will dissolve as it cooks; making a thick and heavy “mix” of the cooking liquids.  The dough should be about what you would use to make tortillas!)  Once you have a good dough mixture of the masa take small portions of the masa, roll it into small balls (somewhat smaller than the meatballs) and with your index finger make an indentation in the dough and drop it into the cooking liquid.  Do this until you’ve add all the masa to the cooking liquid of the meatballs.",
    "Increase the heat setting slightly and finish cooking.  It should take about 15 minutes for the masa to cook if you have the cooking temperature about right.  However, the remaining time for cooking should be enough time to cook the masa of the albondigas before serving."
  ],
  "remarks": "Your mom likes to use water, as noted in this recipe, however I like to use chicken stock instead of water.  I think the results are better!  Additionally, I’ve made this recipe with a diced garlic clove; added towards the end of the sautéing of the onion.  Again, your mom doesn’t add garlic.  As in all recipes one experiments! I also like to use a large package of ground beef (1½ pounds or so) and make the mixture in two stages.  Before I add the rice I take out enough of the mixed ground beef to make a couple of hamburger steaks.  After I take what I need for the hamburger steaks I add the rice and finish making the meatballs. Finally, my grandmother used to make the meatballs with a small piece of hardboiled egg in the center of the meatball.  Your mother’s mom used to use diced “Mexican Squash” (the small green squash) in the meatball mixture.  Your mom also said that her mother never made albondigas with the “shaped masa balls;” that she learned to make the shaped masa balls from my mother. Source:  Traditional Mexican Family Recipe.",
  "yield": "",
  "source": "",
  "category": "05 - Soups"
}