{
  "title": "Albóndigas Soup with Cilantro Pesto",
  "requires": "",
  "ingredients": [
    "For the Albóndigas –",
    "¾ cup short-grain white rice",
    "1½ cups water",
    "4 tablespoons vegetable oil",
    "2 white onion, diced",
    "½ pound ground pork",
    "½ pound ground beef",
    "1 egg",
    "1 teaspoon ground cumin",
    "1 teaspoon dried oregano",
    "1½ teaspoons salt",
    "1 teaspoon freshly ground pepper",
    "1 clove garlic, minced",
    "2 carrots, peeled and diced",
    "2 ripe tomatoes, peeled, seeded and diced",
    "6 cups chicken stock",
    "For the Pesto –",
    "½ cup coarsely chopped fresh cilantro",
    "1 fresh mint sprig, stemmed and chopped",
    "The juice of 2 limes",
    "2 tablespoons olive oil",
    "2 tablespoons water",
    "½ teaspoon salt"
  ],
  "instructions": [
    "Place the rice in a heatproof bowl.  Bring the water to a boil and pour it over the rice.  Let it soak for 40 minutes, then drain and set it aside.",
    "Meanwhile, in a frying pan over medium heat, warm 2 tablespoons of the vegetable oil.  Add 1 of the onions and sauté until soft, about 5 minutes.  Remove from the heat and let it cool.",
    "In a bowl, combine the pork, beef, cooled onion, soaked rice, egg, cumin, oregano, ¾ teaspoon of the salt, and ½ teaspoon of the pepper.  Using your hands, mix well and fashion the meatballs, approximately 1-inch in size.",
    "In a large soup pot over medium heat, arm the remaining 2 tablespoons of vegetable oil.  Add the remaining onion and sauté until soft, about 5 minutes.  Add the garlic, carrots, and tomatoes and cook, stirring, until fragrant, about 5 minutes.  Add the chicken stock, stir well and bring to a boil.  Carefully slip the meatballs into the pot, reduce the heat to low and simmer uncovered until the meatballs are fully cooked, about 45 minutes.  Stir in the remaining ¾ teaspoon salt and ½ teaspoon pepper.",
    "While the soup is simmering make the cilantro pesto.  In a food processor, or blender, combine the cilantro, mint, lime juice, olive oil, water, and salt.  Process to a paste.",
    "Ladle the soup into warmed soup bowls and top each serving with a dollop of cilantro pesto.",
    "Yield:  Serves 6 to 8.",
    "Source:  Cantina, The Best of Casual Mexican Cooking by Susan Feniger and Mary Sue Milliken, © 1996 by Weldon Owen Inc., published by Sunset Publishing Corp., Menlo Park, CA 94025.",
    "AlbÓndigas soup with cilantro pesto"
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "05 - Soups"
}