{
  "title": "Fresh Cream of Corn Soup (Sopa Milpera)",
  "requires": "",
  "ingredients": [
    "6 ears of tender corn",
    "4 poblano chiles",
    "4 tablespoons of butter",
    "1 cup whipping cream",
    "1 (eight ounces) package of cream cheese",
    "3 cups milk",
    "Salt and freshly ground black pepper, to taste"
  ],
  "instructions": [
    "Toast the chile poblanos on a comal.  Place them inside a plastic bag, seal it and allow them to steam as they cool to the point you can handle them.  When they have cooled peel them (use running water to help remove the blistered skin), slice them open and remove the seeds and veins.  Pat them dry with paper towels and slice them into ¼-inch wide strips.  Reserve about a quarter cup of the strips for a separate use.",
    "Cut off the corn kernels from the cobs into a bowl and use the backside of the knife to scrape the cob to remove any remaining corn kernel pulp and milk into the bowl.  Reserve about ½ cup of the corn kernels and all the released “milk”.  Cook the kernels (except the reserved ½ cup) in salted, boiling water for 3 minutes.  Remove for the heat and drain.",
    "In a small sauté pan, melt the butter over medium heat and cook the reserved corn kernels with the reserved chile strips for 5 minutes.",
    "Put the boiled corn, toasted chile strips, cream cheese, and about 1 cup milk into a blender and blend.  Pour the blended mixture into a large pot and add the sautéed vegetables.  Bring the mixture to a simmer over medium heat.  Turn down the heat and add the remainder of the milk.  Bring back to a simmer for 2 minutes.  Season the soup, to taste, with salt and pepper.  You may reheat the soup at a later time, being sure never to bring it to a boil, or the milk will curdle."
  ],
  "remarks": "This recipe is from Michoacán and is a signature dish at Fonda Las Mercedes inn.",
  "yield": "Serves 6.",
  "source": "A Cook’s Tour of Mexico by Nancy Zaslavsky, published by St. Martin’s Press, New York, New York, © 1995 by Nancy Zaslavsky.",
  "category": "05 - Soups"
}