{
  "title": "Potato and Meatball Soup (Sopa de Bolitas de Carne y Papas)",
  "requires": "",
  "ingredients": [
    "4 large russet potatoes, about 2 pounds total weight",
    "1 pound ground lean pork",
    "1 white onion, half minced and half coarsely chopped",
    "1 teaspoon salt, preferably sea salt, or to taste",
    "1 teaspoon freshly ground pepper",
    "½ teaspoon dried oregano",
    "2 eggs, lightly beaten",
    "2 tablespoons safflower or canola oil",
    "1 pound ripe tomatoes, chopped; or 1 can (14½-ounces) chopped tomatoes, drained",
    "4 cups chicken broth",
    "1 tablespoon all-purpose flour",
    "1 jalapeño chile, partially slit open",
    "1 fresh flat-leaf (Italian) parsley sprig, chopped",
    "¼ cup fresh cilantro leafs, chopped"
  ],
  "instructions": [
    "Peel the potatoes and grate them on the medium holes of a handheld grater.  Wrap the potatoes in a kitchen towel and squeeze out the excess liquid.  In a bowl, combine the potatoes and meat, tossing and blending them together with the minced onion, salt, pepper, and oregano.  When well mixed, add the eggs and mix again.  With your hands, roll the meat-and-potato mixture into 1-inch balls.",
    "Heat a large Dutch oven or other heavy pot over medium heat and add the oil.  When the oil is just starting to smoke, working in batches, gently drop in the meatballs and fry them until they are lightly browned on all sides, about 10 minutes.  Using a slotted spoon, transfer the meatballs to a plate and set them aside.",
    "While the meatballs are cooking, put the tomatoes and chopped onion in a blender.  Process the tomato and onions until the mixture is smooth, adding a little of the chicken broth, if needed, to facilitate the blending.",
    "When all the meatballs are done sprinkle the flour into the hot oil remaining in the Dutch oven and stir for several minutes over medium heat.  Slowly pour in the tomato-onion mixture into the Dutch oven, drop in the jalapeño chile, and add the Italian parsley.  Continue to cook, stirring occasionally, until the mixture thickens and darkens in color, about 3 minutes.  Add any remaining chicken broth and the meatballs and let the soup simmer, uncovered, for 10-15 minutes.  Remove the chile and discard.",
    "Taste and adjust the salt and seasoning of the soup.",
    "Ladle into warmed wide bowls and float the cilantro leaves on the surface of each bowl and serve."
  ],
  "remarks": "",
  "yield": "Serves 6.",
  "source": "Savoring Mexico:  Recipes and Reflections on Mexican Cooking, by Marilyn Tausend, published by Time Life Books, a division of Time Warner Inc., © 2001 Weldon Owen Inc.",
  "category": "05 - Soups"
}