{
  "title": "Classic Guacamole",
  "requires": "",
  "ingredients": [
    "Fresh hot green chiles, to taste (about 2 serranos or 1 jalapeño), stem removed",
    "½ medium white onion, finely chopped (approximately ⅓-cup), plus a little",
    "extra for garnish",
    "6 ounces (1 medium or 2 plum) tomatoes",
    "¼ cup coarsely chopped fresh cilantro, plus a little extra for garnish",
    "3 medium-large (about 1¼ pounds total) ripe avocados",
    "Salt",
    "1 to 2 tablespoons fresh lime juice",
    "A few slices of radish for garnish (optional)"
  ],
  "instructions": [
    "Lay the chiles in a small ungreased skillet set over medium heat.  Turn them every minute or so until they have softened (they will darken and scorch in spots), approximately 5 to 10 minutes.  Mash them into a coarse puree, using a mortar; or, finely chop them.  Place the chiles in a bowl.",
    "Scoop the chopped onion into a strainer and rinse under cold water; shake off excess water and add to the bowl with the chiles.  Chop the tomatoes into small bits – skin, seeds and all.  There should be about a cup.  Add the chopped tomatoes and cilantro to the bowl with the chiles and onion.",
    "To cut the avocado in half, you have to negotiate the large egg shaped pit in the middle.  Make a cut down the length of 1 avocado straight down the pit and continue cutting all the way around until you wind up where you started.  Twist the two halves in opposite directions and pull them apart.  Scoop out the pit with a spoon, then scoop out the avocado flesh from the skin and add to the bowl with the other ingredients.  Do the same with the remaining avocados.  Use either an old-fashioned potato masher or the back of a large spoon to mash the avocado flesh into a coarse pulp, mixing in the other ingredients as you go.",
    "Taste the guacamole and season it with salt.  Usually, a scant teaspoon is all that is needed for this amount.  Add the lime juice and taste again.  Continue seasoning with lime juice until the guacamole has enough “zip” for you.  Cover with plastic wrap, placing it directly on the surface of the guacamole to keep the air out, and refrigerate until you’re ready to serve it."
  ],
  "remarks": "Unless you’re serving guacamole dolloped on tacos or the like, the classic way to present it to your guests is in the Mexican lava-rock mortar, a “molcajete”, sprinkled with chopped onion, cilantro, and sliced radish.  To the Mexican eye, the red-white-green motif, is the patriotic way. Guacamole is good when freshly made, but, in my [Rick Bayless] opinion, it tastes even better when the flavors are allowed to mingle for about half and hour before serving.  If well chilled, it’ll keep for several hours.  After that, the flavors get out of balance and the avocado starts to brown. Yield:  Serves 6, as an appetizer, 8 to 10, as a nibble. Source:  Mexico One Plate at a Time by Rick Bayless, Scribner, 1230 Avenue of the Americas, New York, NY 10020, ©2000 by Rick Bayless.",
  "yield": "",
  "source": "",
  "category": "07 - Vegetables"
}