{
  "title": "Double-Crusted Onion Calzone: Scalcione di Cipolla Recipe copyright Mario Batali, 2002. All rights reserved. Dough:\n1/4 teaspoon dried yeast\n1/4 cup warm water (about 100 degrees F), plus 1 cup warm water\n4 cups flour, plus more for rolling out dough\n1/4 cup dry white wine\n1/4 cup extra-virgin olive oil\nSalt and pepper\n\nFilling:\n1/4 cup extra-virgin olive oil, plus more for the pan and drizzling the crust\n2 pounds leeks, very thinly sliced\n3 tablespoons milk\n1 teaspoon sugar\n6 anchovy fillets, rinsed, drained, and chopped\n1/2 cup pitted black olives, chopped\n1/4 cup finely chopped parsley\n1/2 cup canned tomatoes, coarsely chopped\n1/2 cup golden raisins, soaked in hot water to plump\n1 teaspoon sugar Sprinkle the dried yeast over 1/4 cup warm water in a small bowl. When it \"blooms\", add remaining water. In a larger bowl, mix flour with wine, olive oil, water, salt, and pepper. Stir in the yeast water and work it into the dough with your hands. Transfer to a lightly floured board and knead until it just loses its stickiness. Set aside, covered with a damp cloth. Warm 1/4 cup olive oil in a saute pan over medium-low heat. Add the leeks and cook gently 15 minutes, or until soft but not browned. Add the milk and cook 5 additional minutes. Stir in sugar and cook another 5 minutes. The leeks should be very soft. Add the anchovies, black olives, parsley, and tomatoes. Stir to mix well and continue cooking until the sauce is thick and liquid has evaporated. Remove from heat and stir in raisins. Lightly oil a 12-inch pizza pan. Divide the dough into two pieces, one slightly larger than the other. Roll the larger piece out to 1/8-inch thickness ad place on the pizza pan. Spread the filling evenly across this piece, leaving a 1-inch border around the edges. Roll out the other piece of dough and fit it on top of the first, and roll the edges of the two pieces of dough together. Brush the remaining oil over the top crust, sprinkle with sugar, prick in several places with a fork, and set aside for 30 minutes. Preheat the oven to 450 degrees F. Bake in the oven for 15 minutes, then turn the heat down to 350 degrees F and bake another 30 minutes. Serve hot or at room temperature. Yield: 6 to 8 servings\nPrep Time: 20 minutes\nCook Time: 1 hour\nDifficulty: Medium",
  "requires": "",
  "ingredients": [],
  "instructions": [],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "07 - Vegetables"
}