{
  "title": "Green Beans Burgos Style (Judias a la Burgalesa)",
  "requires": "",
  "ingredients": [
    "1½ pounds fresh green beans",
    "2 small onions",
    "2 garlic cloves",
    "¼ cup chopped cooked ham",
    "3 full strips of bacon, diced into small bits",
    "2 tablespoons olive oil",
    "½ cup dry white wine",
    "salt, pepper, and nutmeg to taste"
  ],
  "instructions": [
    "Plunge the green beans into a kettle of boiling salted water.  Let the water return to a boil over high heat and cook the beans, uncovered, for 3 minutes.  Drain the beans and put them under running cold water until they are cool.  Trim the ends and reserve the beans.",
    "In a large skillet sauté 2 small onions and 2 garlic cloves, both finely chopped, in 2 tablespoons of olive oil until the onions are soft and translucent.  Add ½ cup each of finely chopped bacon and cooked ham and sauté the mixture until the bacon is just crisp.  Remove the pan form the heat and add ½ cup dry white wine, the reserved green beans, the salt, pepper, and nutmeg.  Cook the mixture, covered, over moderately low heat for 10 to 15 minutes; or, until the beans are tender.  Transfer the bean mixture to a heated serving dish and garnish it with finely chopped parsley.",
    "Remarks:  I recommend that you revise the process in the second paragraph.  First, sauté the bacon until it is crisp, then in the bacon drippings add and sauté the onions. Then, once the onions are soft and translucent add the garlic and the cooked ham and sauté the mixture for 5 more minutes.  Continue with the recipe as written only after the ham is sautéed.  The reason is that with all the moisture the onions release the bacon won’t become crisp as it should be and you’ll run the risk of over cooking the onion while waiting for the bacon to become crisp.",
    "Yield:  Serves 8.",
    "Source:  You Asked For It, Gourmet Magazine, January 1973."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "07 - Vegetables"
}