{
  "title": "Indonesian Fried Rice (Nasi Goreng)",
  "requires": "",
  "ingredients": [
    "2 teaspoons vegetable oil",
    "3 eggs, beaten",
    "3 garlic cloves, minced",
    "2 teaspoons shrimp paste",
    "2 teaspoons dried red pepper flakes",
    "1 cup minced onion",
    "1 cup poached chicken breasts, cut into small cubes",
    "1 cup cooked medium shrimp",
    "3 cups, cold cooked white rice",
    "1 teaspoon ground turmeric (optional)",
    "1 tablespoon sweet soy sauce (ketjap manis)",
    "2 tablespoons chicken broth (or water)",
    "Salt to taste"
  ],
  "instructions": [
    "Saturate a piece of paper towel with some of the vegetable oil.  Heat a carbon-steel wok over medium heat until just smoking and wipe with the paper towel soaked in oil.  Pour a thin layer of the eggs into the wok and make a crepe-like thin omelet.  Transfer the omelet to a plate and repeat the process until all the eggs are used.  Roll up the egg crepes and cut them up into narrow ribbons.",
    "With a mortar and pestle, pound together the garlic, shrimp paste, red pepper flakes, and 2 tablespoons of the minced onion until you have a paste.  Alternatively, process the ingredients in a blender until they are pureed.",
    "In a carbon-steel wok, heat the remaining oil over medium-high heat until just smoking.  Add the remaining minced onion and the paste mixture, and fry for about 30 seconds, until aromatic.  Add the chicken and shrimp, and fry for 1 minute, stirring to mix; then add the rice, turmeric (if using), sweet soy sauce, and broth.  Cook until the rice is hot, tossing it to mix well.  Season to taste with salt and remove to a serving platter.  Scatter the egg ribbons over the top of the rice.",
    "Remarks:  This is fried rice with a twist.  I [Rosa Ross] use poached chicken and shrimp, and “fry” the rice in broth to reduce the fat in the recipe.  If you use raw chicken and raw shrimp, simply stir-fry them until they are done, before adding the other ingredients.  Finally, the turmeric will give the rice a “yellow” color, so it’s optional.",
    "Yield:  Serves 6.",
    "Source:  New Wok Cooking by Rosa Ross, Clarkson Potter/Publishers, New York, © 2000 by Rosa Ross."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "07 - Vegetables"
}