{
  "title": "Potato Fritters with Sausage (Bocadillos de Papa y Chorizo)",
  "requires": "",
  "ingredients": [
    "1 pound potatoes (Yukon Gold or another frying type)",
    "½ pound chorizo, casings removed",
    "½ medium white onion, finely chopped",
    "3 garlic cloves, finely chopped",
    "1 large egg, beaten",
    "½ cup flour",
    "Salt and fresh ground black pepper",
    "A pinch of freshly ground nutmeg",
    "¼ cup parsley leaves, finely chopped",
    "1 tablespoon thinly sliced fresh chives",
    "1 cup peanut or sunflower oil, for frying"
  ],
  "instructions": [
    "In a medium pot, boil the potatoes in their skins until soft, about 30 minutes then drain and let them cool.  When they are cool enough to handle, peel them and place them in a bowl.  Mash the potatoes using a potato masher.",
    "In a medium frying pan, fry the chorizo over medium heat until it is dry, about 10 minutes.  Add the onion and sauté over medium heat until the onion is translucent, about 5 minutes.  Lastly, add the garlic and continues sautéing for 5 minutes more, until it too is soft.  Remove from the heat, push the mixture to one side and tilt the pan so that all the oil drains into the empty side of the pan.  Leave the pan tilted to drain a good 15 minutes then spoon out the oil.  Now remove the chorizo to a bowl in which you have placed a couple of layers of paper towels.  With a third paper towel, folded, press the chorizo down to squeeze out as much of the oils as possible.  When finished set the chorizo aside.",
    "In a medium bowl, whisk the egg until frothy and then add the flour all at once while continuing to whisk.  When the mass get too thick to whisk, set the whisk aside, and continue mixing with your hands to incorporate the egg evenly with the flour until it is a sticky, paste like substance, about 5 minutes.  Add the mashed potatoes and the chorizo mixture and mix with your hands.  After a few seconds of mixing add the pepper, nutmeg, parsley, and chives and continue mixing until everything has been well incorporated but do not over mix or the resulting dough will become a sticky mess that you could use as wallpaper glue!  (While you’re mixing taste the mixture and add what salt you think is needed.)",
    "Heat the oil in a large frying pan or wok over high heat.",
    "Take 1½ tablespoons of the potato-chorizo mixture and roll it into a ball, then flatten the ball into a 2-inch round patty.   When the oil is hot fry one of the “bocadillo” for 2 to 3 minutes on each side, until it is golden, then remove it from the oil and let it drain well on paper towels and remove the frying pan from the heat.  When the “bocadillo” is cool enough taste it to make sure that the salt content is to your liking.  If the salt needs to be adjusted do it before you continue frying the other “bocadillos”.  Additionally, if the potato-chorizo mixture is too sticky, dredge each patty in flour before frying.  Return the frying pan, or wok, to the heat and continue to make and fry the little cakes, frying and draining them well on paper towels, until all the potato-chorizo mixture is used up.",
    "Serve them hot with a sopa de fideo.",
    "Remark:  You might wish to make the “bocadillos” ahead of time then reheat them in a 400° F. oven before serving.  This method also all the “bocadillos” to render more of the absorbed oil on paper towels.",
    "Yield:  Makes for 14 to 18 “bocadillos”.",
    "Source:  Seasons of My Heart, A Culinary Journey Through Oaxaca, Mexico by Susana Trilling, published by The Ballantine Publishing Group, © 1999 by Susana Trilling."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "07 - Vegetables"
}