{
  "title": "Spanish Rice",
  "requires": "",
  "ingredients": [
    "3 tablespoons vegetable oil or shortening",
    "1½ cups uncooked long-grain rice",
    "½ cup finely chopped onion",
    "¼ cup finely chopped celery",
    "¼ cup finely chopped green bell pepper",
    "1 teaspoon salt",
    "2 teaspoons ground cumin",
    "1½ teaspoons granulated garlic",
    "½ teaspoon black pepper",
    "3 cups Chicken Broth or water",
    "1 8-ounce can tomato sauce"
  ],
  "instructions": [
    "Heat the oil in a skillet over medium heat and when the oil is hot, not quite smoking, sauté the rice until it is golden brown.   Be patient, it will take awhile for the rice to begin turning color and at first it will clump together because the oil hasn’t been evenly distributed within the grains of rice.  However, have everything else on hand and ready because once the rice begins turning color it will cook quickly.",
    "Once the rice reaches the “golden brown” color you are looking for add the vegetables, garlic, and the seasonings and continue to cook 1 to 2 minutes longer.  Because the vegetables will begin to release their water the rice will stop browning but that’s as it should be.",
    "Add the tomato sauce and mix into the rice before adding the broth (or water) stir well and bring to a boil.  Once the mixture is boiling, reduce the heat to low and simmer, covered, for 15 minutes.  At this stage, don’t disturb the cooking process; don’t attempt to mix or blend the ingredients further.",
    "Remove from the heat and let the rice stand 3 to 4 minutes still covered in the hot skillet to finish absorbing all the liquid.",
    "Fluff the rice before serving."
  ],
  "remarks": "Don’t worry if you’ve added, or you think that you’ve added, too much oil or shortening.  At the point that you’ve finished browning the rice (it has reached the “golden brown” color you were seeking) remove the frying pan from the fire.  Tilt the frying pan and with the spoon you’re using push the rice to one side and allow the oil to drain down to the empty side.  Spoon out the excess oil and dispose of it.  (I generally use the empty 8-ounce can of tomato sauce to place all the excess oil in for disposing of later.)  Once you’ve spooned out the excess oil return the frying pan to the heat, add the vegetables and continue from there.  (However, the cooking time will be longer because you’ve lost heat while you were draining the oil.  Judge the cooking time by the appearance of the onion.  The onion should begin to approach the translucent state.  When you see this, continue by adding the tomato sauce and continuing with the recipe.) For more flavor, after you add the chicken broth (or water), add a heaping tablespoon of chopped fresh cilantro.  If, on the other hand you prefer the taste enhancement without the chopped cilantro mixed in the rice, add two or three whole fresh cilantro stems and fish them out just before fluffing and serving. Additionally, you may add 2 cups of any raw vegetable while bring the chicken broth to a boil.  I see fresh peas added to the rice this way. Dabble, and come up with the combinations of your own.  (My [Sergio Perales] grandmother [Elena Reygadas] used to add dried shrimp (still available in some markets in small cellophane packages where you find garlic, similarly packaged) to the rice while bringing the chicken broth to a boil.) Finally, some people prefer to have a more mild cumin flavor.  So, if you are one of these persons cut the quantity of ground cumin down to suit your preferences. This is the “old way” of cooking rice and, at first, it seems extremely laborious, but it’s the basic way. Yield:  Makes 4 to 6 servings. Source:  Matt Martinez’s Culinary Frontier:  A Real Texas Cookbook, by Matt Martinez, Jr., and Steve Pate, published by Doubleday, 1540 Broadway, New York, N.Y. 10036, © 1997 by Matt Martinez, Jr., and Steve Pate.",
  "yield": "",
  "source": "",
  "category": "07 - Vegetables"
}