{
  "title": "Swiss Potato Cake with Bacon (Rösti)",
  "requires": "",
  "ingredients": [
    "1¼ pounds boiling potatoes, scrubbed",
    "3 tablespoons minced green onions",
    "2 tablespoons minced fresh parsley leaves",
    "½ teaspoon dried basil",
    "1 garlic clove, crushed and minced",
    "2 tablespoons oil",
    "3 tablespoons butter",
    "½ cup grated Italian Fontina or Münster cheese",
    "2 slices of crisp cooked bacon",
    "salt and pepper"
  ],
  "instructions": [
    "In a saucepan put the scrubbed boiling potatoes and add enough cold water to cover them by 2-inches and bring them to a boil.  Simmer them, partially covered, for 30 minutes, or until they are just barely tender.  Drain the potatoes, let them cool, and chill them for at least 2 hours, or until they are cold.  Peel the potatoes, grate them coarsely (there should be about 4 cups when all are grated), and sprinkle them with salt and pepper.  In a small bowl combine 3 tablespoons minced green onions, 2 tablespoons minced fresh parsley leaves, ½ teaspoon dried basil, and 1 garlic clove, crushed and minced and set aside.",
    "In a 7-inch omelet pan or iron skillet heat 2 tablespoons unsalted butter and 1 tablespoon oil over moderately high heat until the mixture is hot and add the potatoes, spreading them evenly and tamping down with a metal spatula.  With the spatula tidy the potato cake from the edge all around, making the edge more compact.  Reduce the heat to moderate and sprinkle the onion mixture on the cake, stirring it in, but not disturbing the bottom crust that should have formed by this point.  Cook the cake an additional 7 minutes, or until the bottom is browned and crisp.  Invert the cake onto a plate, add 1 tablespoon each of butter and oil to the pan and heat until it is hot.  Slide the cake, uncooked side down, into the pan and cook it for 7 minutes, or until the bottom is browned and crisp.",
    "Turn the cake out onto a heated flameproof plate and sprinkle the top of the cake with the grated cheese, arrange to slices of crisp cooked bacon on top, crisscrossing them, and sprinkle more  of the grated cheese on top.  Put the plate under a preheated broiler about 3-inches form the heat for 10 seconds, or until the cheese is melted.  Garnish with more minced onion and parsley and serve.",
    "Yield:  Serves 2 or 3.",
    "Source:  Gastronomie Sans Argent:  Potatoes, Gourmet Magazine, January 1980.",
    "Swiss Potato Cake with Bacon",
    "(Rösti)"
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "07 - Vegetables"
}