{
  "title": "Abraham Lincoln’s Favorite Cake",
  "requires": "",
  "ingredients": [
    "1 cup butter",
    "2 cups sugar",
    "1 cup milk",
    "3 cups cake flour",
    "2 teaspoons double acting baking powder",
    "2 teaspoons vanilla",
    "1 cup chopped blanched almonds",
    "¼ teaspoons salt",
    "6 egg whites"
  ],
  "instructions": [
    "Position a rack in the lower third of the oven and preheat the oven to 350° F.  Butter and flour three 8- or 9-inch cake pans and set them aside.",
    "Sift the flour with the baking powder together onto a sheet of waxed paper and set aside.  Use a tablespoon of the sifted flour to coat the chopped blanched almonds and again set them aside.",
    "Put the butter into a bowl or a mixer fitted with the paddle attachment (or work with a hand held mixer) and beat at medium speed until smooth.  With the machine running, add the sugar in a steady stream.  Stop the machine and scrape down the paddle and sides of the bowl with a rubber spatula.  Continue to beat at medium speed until the mixture is very light and fluffy, about 4 to 5 minutes.",
    "Alternately, add portions of the flour mixture and the milk to the butter mixture.  After all the flour and milk has been mixed fold in the floured blanched almonds and vanilla.",
    "In a separate bowl whip the egg whites with the salt until they form stiff peaks.",
    "Lastly, fold in the stiff egg whites and divide the batter in the three cake pans.",
    "Bake in the preheated oven until a toothpick inserted in the middle of the cake comes out dry, approximately 25 minutes."
  ],
  "remarks": "It should be noted that the museum flyer made no mention of how long to bake the cake, only the oven temperature.  I tried to estimate the time on the basis of a similar recipe.  So, until I try making the cake and can revise these notes one should take care when baking. The frosting for the cake is similarly glossed over in the museum’s flyer.  It only makes note that chopped candied pineapple and cherries are added to the “boiled icing”.  I would recommend using a white icing into which chopped candied pineapple and cherries [and maybe chopped nuts?] have been added. Yield:  One three layer cake. Source:  Abraham Lincoln’s Favorite Cake, The Lincoln Museum, 200 E. Berry Street, Fort Wayne, IN, 46801-7838. Abraham Lincoln’s favorite cake",
  "yield": "",
  "source": "",
  "category": "08 - Desserts"
}