{
  "title": "Boca Negra",
  "requires": "",
  "ingredients": [
    "For the Cream –",
    "12 ounces white chocolate, finely chopped",
    "1 cup heavy cream (whipping cream)",
    "¼ cup bourbon, or more to taste",
    "For the Cake –",
    "12 ounces bittersweet chocolate, coarsely chopped",
    "1⅓ cups sugar",
    "½ cup bourbon",
    "2 sticks (8 ounces) unsalted butter, cut into 10 roughly equal pieces, at room temperature",
    "5 large eggs, at room temperature",
    "1½ tablespoons all-purpose flour"
  ],
  "instructions": [
    "Prepare the cream at least one day in advance.",
    "Put the white chocolate into a blender (or food processor fitted with a metal blade).  Heat the heavy cream in a small saucepan until small bubbles form around the edge of the pan.  Pour the cream over the chocolate and process it until completely smooth.  Add the bourbon, taste it, and then add a tablespoon more if you want.  Pour the cream into a container with a tight-fitting lid and chill it overnight.  The cream can be kept covered in the refrigerator for a week, or frozen for up to a month.  If you’ve frozen the cream, thaw it overnight in the refrigerator.",
    "Making the Cake –",
    "Lightly butter a 9-inch round cake pan and line the bottom with parchment or waxed paper cut to fit; then butter the paper also.  Put the cake pan in a shallow roasting pan and set aside until needed.",
    "Position a rack in the center of the oven and preheat the oven to 350° F.",
    "Put the chopped chocolate in a medium bowl and keep close at hand.  In a 2-quart saucepan, mix 1 cup of the sugar and the bourbon and cook over medium heat, stirring occasionally, until the sugar dissolves and the mixture comes to a full boil.  Immediately pour the hot syrup over the chocolate and stir with a rubber or plastic spatula until the chocolate is completely melted and the mixture is smooth.  Piece by piece, stir the butter into the chocolate mixture.  Make certain that each piece of butter is completely melted before you add another.",
    "Put the eggs and the remaining ⅓ cup sugar in a medium bowl and whisk until the eggs thicken slightly.  Beating with a whisk, add the eggs to the chocolate mixture and whisk until well blended.  Lastly, gently whisk in the flour.  (If you want to make the cake batter in a food processor, put the chocolate in the work bowl of the processor.  Bring all of the sugar and the bourbon to a full boil and pour the syrup into the work bowl; process until the mixture is completely blended, about 12 seconds.  With the machine running, add the butter in pieces, followed by the eggs, one at a time, and then the flour.  Process and additional 15 seconds before turning the batter into the prepared pan.)",
    "Pour and scrape the batter into the prepared pan, running your spatula over the top to smooth it out.  Pour enough hot water into the roasting pan to come about 1 inch up the sides of the cake pan.  Bake the cake for exactly 30 minutes, at which point the top will have a thin, dry crust.  Remove the cake pan from the water bath, wipe the pan dry, and cover the top of the cake with a sheet of plastic wrap.  Invert the cake onto a flat plate, peel off the parchment or waxed paper, and quickly but gently invert again onto a serving platter; remove the plastic.",
    "Serve the cake warm or at room temperature with the chilled white chocolate cream."
  ],
  "remarks": "Once cooled, the cake can be covered with plastic and kept at room temperature for 1 day or refrigerated for up to 3 days.  Bring to room temperature before serving. For longer storage, wrap the cake airtight, double wrapped with plastic wrap and freeze it.  It will keep for up to a month.  Thaw overnight, still wrapped, in the refrigerator. A “boca negra”, or black mouth, is what you’ll have after one bite of this intensely chocolate cake.  This cake calls for 12 ounces of bittersweet chocolate and you’ll taste ever ounce, so choose chocolate that you love, don’t skimp on buying the chocolate.  The cake is meant to be served warm or at room temperature, when it is as moist, dense, and dark as the chocolate you used to make it.  If you eat it chilled it will remind you of fudge. The white chocolate cream, is something you can use with other desserts. Yield:  Makes one cake (approximately 12 individual servings). Source:  Baking with Julia, Everyday Delights by Dorie Greenspan, William Morrow and Co., Inc., New York, © 1996 by A La Carte Communications, Inc. Boca Negra Cake with white chocolate cream",
  "yield": "",
  "source": "",
  "category": "08 - Desserts"
}