{
  "title": "Bourbon Apple Pie",
  "requires": "",
  "ingredients": [
    "¾ to 1 cup of sugar; or, to taste",
    "2 tablespoons flour; or, tapioca",
    "1 teaspoon cinnamon",
    "⅛ teaspoon nutmeg",
    "¼ teaspoon salt",
    "6 to 7 cups peeled, cored green apples, sliced ¼ inch thick",
    "1 lemon",
    "2 tablespoons bourbon",
    "½ cup toasted pecans",
    "½ cup raisins, plumped in additional bourbon",
    "2 teaspoons Apricot Glaze",
    "1 tablespoon butter",
    "Milk",
    "Sugar",
    "Pie dough for a 9-inch, two-crust pie"
  ],
  "instructions": [
    "Preheat the oven to 425° F.",
    "Combine the sugar, flour, cinnamon, nutmeg, and the salt and set aside.",
    "Set up a bowl of iced water and into it squeeze the lemon.  As you clean, peel, and cut the apples drop the apple slices into the bowl of iced water.  When done, pour off the water and pat dry the slices of apples with paper towels, and return them to a clean bowl.  Pour the bourbon onto the apples.  Pour the sugar and flour mixture in with the apples and mix well.  Set aside.",
    "Grease the pie plate you will be using with vegetable shortening.  Roll out the pastry dough and fit it into the pie plate; leaving a 1-inch overlap.  Working on the overlap, fold it under.  Paint the bottom and sides of the dough with Apricot Glaze.  Heap the apple mixture in the pastry, mounding them towards the center.  Dot the apple mixture with the butter.",
    "Roll out the remaining pastry dough for the top of the pie transfer it carefully onto the pie.  Use Apricot Glaze to bind the pastry dough together; using your fingers pinch the dough around the edge of the pie plate making a decorative edge and sealing the seam.  Cut vents on the top to allow the steam to escape.  Brush the top crush with milk and dust with sugar.",
    "Bake the pie in the lower third of the oven for 50 to 60 minutes; or, until the crust is browned and the apples are tender.  If the pie crust edges are browning too fast, use strips of aluminum foil (approximately 1¼ to 1½ wide) to cover the edges and slow down the browning."
  ],
  "remarks": "To plump the raisins place them in a small container and cover with bourbon.  One can substitute apple or orange juice.  Cover the container with plastic and allow it to stand for at least two hours; or, preferably over night. Yield:  One 9-inch pie; approximately 8 servings. Source:  The Pies Have It, by Rita Leinwand, Bon Appétit, September 1977.",
  "yield": "",
  "source": "",
  "category": "08 - Desserts"
}