{
  "title": "Chocolate Rum Squidgy Gateau Miller Howe",
  "requires": "",
  "ingredients": [
    "16 ounces semisweet chocolate",
    "½ cup plus 2 tablespoons dark rum",
    "8 eggs",
    "2 sticks (1 cup) butter, softened",
    "1½ cups powder sugar",
    "1 cup plus 3 tablespoons flour",
    "¾ cup ground almonds",
    "½ cup orange juice",
    "1 orange",
    "2 cups whipping cream"
  ],
  "instructions": [
    "In a small saucepan melt 8 ounces of semisweet chocolate with ½ cup dark rum over low heat, let the mixture cool, and beat in 6 egg yolks.  In a large bowl cream together 2 sticks (1 cup) butter, softened, and 1 cup of powder sugar until the mixture is light and fluffy.  Stir in the chocolate mixture, 1 cup plus 3 tablespoons flour, and ¾ cup of ground almonds and combine the mixture well.  In a bowl beat 6 egg whites until the hold stiff peaks and fold them gently but thoroughly into the chocolate mixture.  Pour the batter into a buttered and lightly floured 9-inch pan and bake it in a preheated moderate oven (350° F.) for 40 minutes, or until a cake tester inserted in the center comes out clean.  Let the cake cool in the pan for 5 minutes, remove the sides of the pan, and invert the cake onto a rack to cool completely.",
    "In a heavy saucepan melt 8 ounces semisweet chocolate in ½ cup orange juice, 2 tablespoons dark rum, and 1 teaspoon grated orange rind over low heat, then let the mixture cool before beating in 2 egg yolks.  In a chilled bowl beat 2 cups whipping cream with ½ cup powdered sugar until it holds stiff peaks and fold it into the chocolate mixture.  In a small bowl beat 2 egg whites until they hold stiff peaks and fold them gently but thoroughly into the mixture.",
    "Split the cake horizontally and spread the bottom layer with 1½ cups of the chocolate cream.  Top the cream with the second layer and spread the remaining chocolate cream over the top and sides of the cake.  Chill the cake for 2 hours before serving.",
    "Remarks:  An excellent, but rich cake.  Great taste, but one needs to make the chocolate cream frosting thicker (less runny).  Maybe by beating the whipping cream in a bath of ice water so that it turns out thicker.  (When I made this cake the filling got runny, even thought it was in the refrigerator, but the kids loved it in spite of the flaw.)  Another possibility is to place less of the frosting between the layers than called for.",
    "Yield:  One cake.",
    "Source:  You Asked For It, Gourmet Magazine, March 1979."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "08 - Desserts"
}