{
  "title": "Classic Apple Pie",
  "requires": "",
  "ingredients": [
    "Pie crust for an 9-inch, two crust pie",
    "1¼ to 1½ cups sugar",
    "⅛ teaspoon salt",
    "¾ teaspoon cinnamon",
    "½ teaspoon nutmeg",
    "2 tablespoons all-purpose flour",
    "6 to 8 tart apples (approximately 2 to 2½ pounds), peeled and sliced",
    "2 yellow lemons",
    "½ teaspoon lemon rind, grated",
    "1 to 2 tablespoons butter (leave the butter in the refrigerator until you are ready to use it)"
  ],
  "instructions": [
    "Mix all the dry ingredients; the sugar, salt, cinnamon, nutmeg, and flour, in a large bowl and set aside.",
    "In a small bowl mix one tablespoon of apricot preserve and one tablespoon of , or brandy.",
    "Using vegetable shortening, grease the bottom and sides of the 9-inch pie plate and set aside.",
    "In a large container add enough cold water to contain all the peeled and sliced apples.  Into the water squeeze the juices of one of the two lemons (you may also drop the squeezed lemon husks when done).",
    "Peel all the apples and as you finish each one drop them into the water with lemon juice.  When all the apples are peeled cut each into halves, then into fourths; then and cut out the seeds and both ends.  Drop each apple segment back into the lemon-water.  Again, once all of the quarter segments have been trimmed, begin slicing each quarter segment into at least four separate apple slices; dropping the slices back into the lemon-water as you do each quarter.  When all quarters are finished set the apple slices in the lemon-water aside until you’ve rolled out the pie crusts and you are ready to begin arranging the apples in the pie.",
    "Roll out one of the pie pastry crust for the bottom and transfer it (use the rolling pin) carefully to the pie plate.  Carefully, spread the rolled pie crust over the bottom, working it up the sides of the pie plate without leaving any air bubbles underneath, and allow a small overhang.  You may trim off any excess and use the excess to patch any breaks or tears.  Spread the apricot-Cognac mixture on the bottom and sides of the pie crust.  Reserve enough of the apricot-Cognac mixture to coat and seal the pie crusts together.  Cover with plastic wrap and place the pie plate with crust in the refrigerator.  Roll out the second pie crust between wax paper and leave it between the wax paper; but place it also in the refrigerator.",
    "Preheat the oven to 425° F.",
    "Grate the second lemon; cut it in half and remove the seeds.  Set the lemon rind and lemon halves aside where the pie will be assembled.",
    "Drain all the lemon-water from the sliced apples and arrange an assembly line to pat dry the apple slices (using paper towels), dropping them into the sugar-cinnamon mixture, coating all of them with sugar-cinnamon, and arranging them into the prepared pie plate.  Start by placing the slices first along the outside of the pie working towards the center; when the bottom is covered then begin a second and subsequent layers; mounding the apple slices toward the center of the pie.  When all the apple slices have been used pour any remaining sugar-cinnamon mixture evenly on top of the arranged apple slices.",
    "Squeeze lemon juice over the apples, spread the grated lemon rind and slice the butter and dot it evenly over the apple slices.",
    "Remove the top crust from the refrigerator and bring to the assembly area.  Using the remaining apricot-Cognac mixture spread it along the bottom half pie crust edge (where the two pie crusts with come together).  If necessary, you may add some water to the apricot-Cognac mixture to get a good wet bind between the two pie crusts.  Carefully, remove the wax paper from one side of the pie crust and with the rolling pin to assist spread the top half pie crust over the pie.  Use the tines of a fork to press and bind the two pie crusts together.  Trim off any excess crust; with two fingers of one hand and one finger of the other hand firmly flute the pie crust edges together.  Lastly, use a knife to remove a small circle of pie crust from the center of the pie and cut additional vents decoratively in the upper crust.",
    "Bake the pie on the center rack of the preheated oven for 50 to 60 minutes; or, until the apples are done and the pie crust is golden brown.  You should expect the pie to drip so make sure to arrange some heavy foil or pizza tray under the pie to catch any drippings.  Additionally, after 30 minutes in the oven check to see if pie crust is browning too fast (and you’re not going to get at least 50 minutes in the oven because the crust is in danger of burning).  Cut some strips of aluminum foil (4- to 6-inches wide) and arrange them over the edges of the pie crust where it’s browning too rapidly.",
    "When done remove the pie from the oven and allow it to cool before serving."
  ],
  "remarks": "Making this apple pie is time consuming and involves a great deal of work and effort.  However, this is by far the best apple pie recipe that I’ve made.",
  "yield": "Make one 9-inch pie.",
  "source": "The Williamsburg Cookbook, Traditional and Contemporary Recipes, Initially Compiled and Adapted by Letha Booth and the Staff of Colonial Williamsburg, Published by The Colonial Williamsburg Foundation, Williamsburg, Virginia, ©1971 by the Colonial Williamsburg Foundation, Updated and Enlarged in 1975.",
  "category": "08 - Desserts"
}