{
  "title": "Crêpes Suzette",
  "requires": "The recipe for “Orange Butter” is in the “Miscellaneous” < “Odds and Ends” folder and “Dessert Crêpes”, the recipe for which is in the “Breads, Cakes, and Cookies” folder.  If entertaining, it’s more attractive to use a shallow chafing dish.",
  "ingredients": [
    "1 recipe Orange Butter",
    "8 Dessert Crêpes",
    "Sugar to sprinkle",
    "About ¼ cup cognac",
    "About ¼ cup Grand Marnier"
  ],
  "instructions": [
    "Set the chafing dish, or a shallow skillet, over moderate heat and scrape in all the orange butter.  Heat for 4 to 5 minutes – longer if necessary – as the butter melts, boils and bubbles, and begins to thicken into a syrup.  Have your utensils (a long-handled serving fork and spoon, and a ladle for pouring on the liqueur) at hand and crêpes ready for dipping.",
    "Lower the heat so the sauce is bubbling slowly and lay the first crêpe into the pan, “best looking” side up, to moisten for an instant.  Turn it over quickly with the fork and spoon.  Fold it in half, then again into fourths.  Move the wedge-shape crêpe to the side of the pan and lay in the next one.",
    "Working quickly and steadily, bathe and fold the remaining crêpes and arrange them around the edge of the pan, overlapping as necessary, to leave an open space for moistening the last crêpe in the sauce.  Sprinkle a little sugar over them.",
    "Pour the cognac into the ladle and over the crêpes; rapidly do the same with the Grand Marnier.  Spoon the mixture over the crêpes, then tilt the pan ever so gently to pool the contents and carefully ignite them.  At this point, using the long-handled spoon begin spooning the flaming liqueurs mixture over the crêpes until the flames have subsided to a flicker.  Finally, place 2 crêpes per person on warm plates and spoon some of the sauce over them and serve immediately.",
    "Remarks:  I’ve always have had trouble igniting alcoholic mixtures until I read that it was fumes from the alcohol that one ignited, not the liquid.  The source said to place the alcoholic drink or liqueurs in a small pan and warm them up over low heat.  Once warm, to carefully tilt the small pan and the fumes would ignite readily.  I’ve used this method ever since I read the hint and it works better than pouring the alcoholic mixtures directly into the dish and trying to ignite them once they have been poured in.  So, I recommend that when making this dish pour the cognac and Grand Marnier into a small pan, heat the combination, ignite, then pour the flaming mixture into the pan containing the crêpes.",
    "Yield:  Serves 4.",
    "Source:  Julia and Jacques Cooking at Home by Julia Child and Jacques Pepin, published by Alfred A. Knopf, Inc., © 1999 by A La Carte Communications."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "08 - Desserts"
}