{
  "title": "Daiquiri Lime Pie",
  "requires": "",
  "ingredients": [
    "For the pie -",
    "18 Graham cracker squares; or, 1¼ cup Graham cracker crumbs",
    "6 tablespoons butter, melted and cooled",
    "1 (14-ounce) can sweetened condensed milk",
    "3 tablespoons Bacardi Light-Dry Rum",
    "1 tablespoon grated key lime zest",
    "3 tablespoons fresh key lime juice",
    "1 tablespoon fresh lemon juice",
    "¼ teaspoon salt",
    "½ cups heavy (whipping) cream",
    "For the garnish –",
    "1 cup whipping cream",
    "1 tablespoon Bacardi Light-Dry Rum",
    "1 tablespoon sugar"
  ],
  "instructions": [
    "Preheat the oven to 350° F.",
    "If you’re using Graham crackers crush them into crumbs; if you’re using Graham cracker crumbs measure out the correct amount.  In a small mixing bowl pour in the cracker crumbs and add the melted butter.  Stir and work the butter mixture into the cracker crumbs; and when all the butter has been absorbed pour the mixture into a 9-inch pie plate.  Spread the mixture evenly in the pie plate before you begin pressing the crumb mixture into the bottom and sides of the pie plate.  Bake the Graham cracker pie crust in the center rack of the preheated oven for 8 minutes; or, until there is a slight browning of the pie crust.  Don’t over cook.  Remove the pie crust from the oven and set on a metal grate to cool.",
    "In a medium size mixing bowl pour in the condensed milk, 3 tablespoons of rum, the key lime zest, the key lime juice, lemon juice, and the salt and with a beater, beat the mixture until all the ingredients are well combined.  Place the mixture in the refrigerator to chill (for at least 5 minutes); while you start beating a half cup of whipping cream.  When the whipping cream can hold soft peaks, take 2 to 3 tablespoons of the lime mixture and add them to the whipping cream.  Beat the mixture until the lime mixture is incorporated then gently fold all the cream back into the lime mixture.  Fold carefully to blend the two ingredients together then pour the mixture into the prepared pie crust and refrigerate the pie for at least 2 hours.",
    "Before serving, whip one cup of whipping cream until soft peaks form; then add the tablespoon of sugar and rum and continue whipping until you can form stiff peaks.  Spoon a dollop of this cream mixture on each slice of pie.",
    "Remarks:  For a Frozen Daiquiri Lime Pie place the pie in the freezer for at least 3 hours.",
    "Yield:  Makes 1 (9-inch) pie.",
    "Source:  Sublime Key Lime by Bonnie Walker, Express-News Staff Writer, Food Section, Recipe from Bacardi Rum,  Express-News, Wednesday, August 31, 2005."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "08 - Desserts"
}