{
  "title": "Flaky Pie Dough",
  "requires": "",
  "ingredients": [
    "5¼ cups all-purpose flour; or pastry flour",
    "1 tablespoon kosher salt",
    "1½ sticks (6 ounces) cold unsalted butter, cut into small pieces",
    "1¾ cups (11 ounces) solid vegetable shortening, chilled and cut into small pieces",
    "1 cup ice water"
  ],
  "instructions": [
    "Mix the flour and salt together in a large bowl.  Add the butter and, using a pastry blender (or your fingers if you prefer), cut into the flour until the mixture looks like coarse crumbs.  Be patient – this takes awhile.",
    "Break up the shortening and add it in bits to the bowl.  Still working with the pastry blender (or your fingers), cut in the shortening until the mixture has small clumps and curds.  (Keep in mind that it’s these “clumps” and “curds” that will make the pie crusts flaky.)  Switch to a wooden spoon and add the ice water, stirring to incorporate it.  Turn the dough out onto a work surface and fold the dough over itself a few times.  It’s important at this point not to get carried away.  The dough should be soft, but it will firm up sufficiently in the refrigerator.",
    "Wrap the dough in plastic and refrigerate for at least 2 hours or as long as 5 days."
  ],
  "remarks": "The dough can be kept in the refrigerator for 5 days or frozen for 1 month.  However, it’s a good idea to divide the dough into quarters for freezing since one quarter of the recipe is generally enough for one pie crust or tart shell.  Defrost the dough in the plastic wrap in the refrigerator. If you could have only one pie dough recipe in your repertoire it would have to be this one, the classic pie dough that has earned blue ribbons at country fairs and stars at esteemed pastry shops.  This mix of butter and shortening, guarantees that the resulting dough will be flaky, flavorful, and tender.  You can use this dough to make any kind of pie or tart, sweet or savory, plain or fancy.  It’s easy  to roll and crimp and is made quickly by hand.  This recipe is large but can be cut in half, or even quartered, but since the dough can by frozen for up to a month, it’s practical to make a full batch. You can also freeze the dough in disks, rolled out into circles; or already fitted into pie pans or tart molds, ready to go into the oven – without thawing – whenever you’re in a crunch for a crust. Yield:  Makes enough dough for four 9-inch tarts or open face pies; or, two double-crusted pies. Source:  Baking with Julia, Everyday Delights by Dorie Greenspan, William Morrow and Co., Inc., New York, © 1996 by A La Carte Communications, Inc.",
  "yield": "",
  "source": "",
  "category": "08 - Desserts"
}