{
  "title": "Kahlúa Chocolate Cake",
  "requires": "",
  "ingredients": [
    "For the cake -",
    "3 egg whites",
    "¾ cup granulated sugar",
    "½ cup shortening",
    "1 cup light brown sugar",
    "3 egg yolks",
    "2¼ cups flour",
    "½ cup unsweetened cocoa",
    "1½ teaspoons baking soda",
    "¾ cup strong cold unsweetened black coffee",
    "¾ cup Kahlúa",
    "For the frosting –",
    "6 tablespoons butter, softened to room temperature",
    "1 pound sifted powdered sugar",
    "3 tablespoons unsweetened cocoa",
    "3 tablespoons Kahlúa",
    "2 or 3 tablespoons unsweetened black coffee"
  ],
  "instructions": [
    "To make the cake:",
    "Grease and lightly flour two 9-inch cake pans and set them aside.",
    "Mix and sift the flour and cocoa together; also mix the cold coffee and Kahlúa together and set the two mixtures aside.",
    "Use an electric blender to beat the three egg whites until soft peaks form (the egg white peaks fold over) and then gradually begin adding the sugar.  When all of the sugar has been added beat the mixture until stiff peaks form (the egg white peaks remain straight up).  Set the beaten egg whites aside.",
    "Adjust the wire rack in to oven to cook the cake pans in the bottom third of the oven then pre-heat the oven to 350° F.",
    "Using the electric blender to cream the shortening and the light brown sugar until the mixture is creamy and fluffy.  (Don’t under estimate when the mixture is done; err on the side of over beating.)  Next, to the creamed shortening and sugar mixture, add one egg yolk at a time and beat well (until the glossy appearance disappears).  When all the egg yolks have been incorporated begin adding the cocoa/flour mixture one heaping tablespoon at a time followed by an equivalent amount of the coffee/ Kahlúa mixture.  Lastly, fold in the egg whites into the batter and pour it into the prepared cake pans.",
    "Place the cake pans in the center of the wire rack in the oven and bake for 30 to 35 minutes; or, until a toothpick comes out clean from the center of each cake round.  When done remove the cake pans from the oven and set them on wire racks to cool for 10 minutes.",
    "Turn the cake rounds out of the pans and allow them to cool completely on wire racks.",
    "Frost the cake and bring it to the table.",
    "To make the frosting:",
    "Using an electric blender cream the butter; then begin adding the powdered sugar and cocoa (alternatively) spoon full by spoon full until the mixture is creamy and fluffy.  (Don’t under estimate when the mixture is done; err on the side of over beating.)  Finally, with the blender running, add in the hot coffee and beat the mixture until the frosting is thick and smooth."
  ],
  "remarks": "",
  "yield": "One 9-inch cake",
  "source": "Kahlúa & Chocolate, Cuisine Magazine, March 1984.",
  "category": "08 - Desserts"
}