{
  "title": "Lemon Loaf Cake",
  "requires": "",
  "ingredients": [
    "4 large eggs, at room temperature",
    "1⅓ cups sugar",
    "Pinch of salt",
    "The grated zest of 3 large lemons",
    "1¾ cups cake flour",
    "½ teaspoon baking powder",
    "½ cup heavy cream (whipping cream), at room temperature",
    "5½ tablespoons unsalted butter, melted and cooled to room temperature"
  ],
  "instructions": [
    "Butter a 9- by 5-inch loaf pan and dust it with flour, shaking off any excess.",
    "Position a rack in the center of the oven and preheat the oven to 350° F.",
    "Working in a large bowl, whisk together the eggs, sugar, and salt for just a minute, until its foamy and smoothly blended; the mixture should not thicken.   When done whisk in the grated zest.",
    "Spoon in the flour and baking powder into a sifter and sift about a third of the dry ingredients over the foamy egg mixture.  Whisk the flour into the eggs, mixing lightly – there is no need to “beat”.  Sift the flour over the eggs in two more additions and whisk only until everything is incorporated.  Whisk the heavy cream into the mixture.  Lastly, switch to a rubber or plastic spatula and gently and quickly fold in the melted butter.",
    "Pour and scrape the batter into the prepared pan – it will level itself – and bake for 50 to 60 minutes, or until center of the cake crowns and cracks and a toothpick inserted in the center comes out clean.  Allow the cake to cool on a wire rack for 10 minutes before attempting to remove it from the loaf pan.  Cool to room temperature right side up on a wire rack."
  ],
  "remarks": "You can serve this cake as soon as it cools, although some believe that like a pound cake it needs a whole day for its flavor to “ripen”.  In any case, use a serrated knife to cut the cake and cut the slices thin.  The “proper serving” is two thin slices per guest’s plate. Once cooled, the cake should be wrapped tightly in plastic wrap.  It will keep at room temperature for 3 to 4 days or, if double wrapped, it can be frozen for up to a month. If frozen, all the cake to thaw still wrapped, at room temperature. Yield:  One cake loaf; will serve 12 to 15 in thin slices. Source:  Baking with Julia, Everyday Delights by Dorie Greenspan, William Morrow and Co., Inc., New York, © 1996 by A La Carte Communications, Inc.",
  "yield": "",
  "source": "",
  "category": "08 - Desserts"
}