{
  "title": "Lemon Meringue Pie Ballymaloe House",
  "requires": "",
  "ingredients": [
    "For the shell:",
    "2 cups all-purpose flour",
    "1½ sticks ( ¾ cup) cold, unsalted butter, cut into bits",
    "1 tablespoon sugar",
    "1 large egg yolk, beaten lightly",
    "about 3 to 4 tablespoon ice water",
    "raw rice for weighing the shell",
    "For the filling:",
    "½ cup sugar",
    "½ stick (¼  cup) unsalted butter, melted and cooled",
    "½ cup fresh lemon juice",
    "tablespoon grated lemon rind",
    "2 large whole eggs",
    "1 large egg yolk, beaten lightly",
    "For the meringue:",
    "2 large egg whites at room temperature",
    "a pinch of cream of tartar",
    "½ cup sugar"
  ],
  "instructions": [
    "Make the shell first.  In a bowl blend the flour, the butter, the sugar, and a pinch of salt until the mixture resembles corn meal.  Add the egg yolk and the ice water, adding more ice water if necessary to form the mixture into a dough, and form the dough into a ball.  Flatten the ball slightly, dust it with flour, and chill it, wrapped in wax paper, for 1 hour.  Remove the dough from the refrigerator and roll it into a 14-inch round on a floured surface and fit it into a 12-inch pie plate.  Crimp the edge decoratively and prick the bottom of the shell with a fork.  Line the shell with wax paper and fill the cavity with the rice.  Bake the pie shell in the lower third of a preheated hot oven (425° F.) for 10 minutes.  Remove the rice and paper carefully and finish baking the shell for an additional 10 to 15 minutes more, or until it is lightly golden.  Let the shell cool.",
    "Make the filling next.  In a heavy stainless steel or enameled saucepan combine well the sugar, the butter, the lemon juice and the lemon rind, and stir in the beaten egg mixture.  Cook the mixture over moderately low heat, stirring constantly, until it is thick enough to coat the back of the spoon, but do not let it boil.  Transfer the filling to a bowl and let it cool, covered with a buttered wax paper.  When cool spread the filling in the pie shell.",
    "Lastly, make the meringue.  In a bowl beat the egg whites with the cream of tarter and a pinch of salt until they are frothy beat in the sugar, a little at a time, and beat the meringue until it holds stiff peaks.  Spread the meringue gently over the filling and bake the pie in the upper third of a preheated slow oven (300° F.) for 30 minutes, or until the top is browned lightly.",
    "Let the pie cool completely before serving."
  ],
  "remarks": "",
  "yield": "1 pie.",
  "source": "You Asked For It, Gourmet Magazine, June 1982.",
  "category": "08 - Desserts"
}