{
  "title": "Lemon Meringue Pie",
  "requires": "One 9-inch piecrust, the recipe for which is in the “Desserts and Pastries” < “Pies” folder.",
  "ingredients": [
    "1¾ cups sugar, divided as indicated in the instructions",
    "½ cup cornstarch",
    "½ teaspoon salt, divided as indicated in the instructions",
    "3 eggs, yolks and white separated",
    "⅓ cup lemon juice",
    "5 teaspoons lemon rind, grated",
    "2 tablespoons butter"
  ],
  "instructions": [
    "Make the pie shell first.  After you’ve fitted the piecrust to the pie plate crimp the edges decoratively and prick the bottom of the pie shell with a fork.  Line the pie shell with wax paper and fill the cavity with rice.  Bake the pie shell in the lower third of a preheated hot oven (425° F.) for 10 minutes.  After ten minutes pull the pie shell from the oven and remove the wax paper and rice then finish baking the pie shell for an additional 10 to 15 minutes, or until the piecrust is lightly golden.  Let it pie shell cool.",
    "When you’re ready to make the pie preheat the oven to 350° F.",
    "Measure out the sugar.  Remove and reserve 6 tablespoons of the sugar for the meringue.  Place the remaining amount of sugar in a saucepan and add to it the cornstarch, ¼ teaspoons of salt, and 1½ cups of water.  Stir to dissolve the cornstarch and sugar completely.  When dissolved cook the mixture over medium heat, stirring constantly, until the mixture is smooth and almost transparent, about 3 minutes.",
    "Have ready the egg yolks mixture to add to the sugar and cornstarch mixture.  Beat the egg yolks and lemon juice together.",
    "Once the sugar and cornstarch mixture has cooked to the point where it’s smooth and almost transparent pour about ½ cup of it into the egg yolks and lemon mixture.  Stir to mix well.  (By pouring a small amount of the hot sugar mixture into the egg yolks you eliminate the chance of them curdling when you pour them into the hot sugar mixture.)",
    "Add the egg yolk mixture in a steady stream to the cornstarch mixture, stirring constantly, until the contents become thick, about 3 to 4 minutes.  At this point add the lemon rind and butter.   Remove from the heat, and continue stirring, until the butter is dissolved and the mixture is thick and appears ready to set, like a pudding.  Place a piece of plastic wrap directly onto the surface of the lemon filling (press it down) and set it aside to cool completely.  (The plastic wrap will keep the lemon filling from forming layer of dried filling on its surface.)",
    "When the lemon filling is cold, spoon it into the cooled pie shell.",
    "Make the meringue by beating the egg whites with ¼ teaspoon of salt until soft peaks begin to form.  At this point gradually add the 6 tablespoons of reserved sugar to the egg whites and continue beating at high speed until firm and glossy peaks are formed.",
    "Pile the meringue on top of the lemon filling and spread it.  Take care to spread the meringue to the edges of the piecrust to seal and prevent shrinking.",
    "Bake at 350° F. for 12 to 15 minutes, or until the meringue is delicately browned.  Allow the pie to cool on a rack for at least 2 hours before cutting.",
    "Remarks:  Next time I make this pie I intend to make the meringue with at least 4 egg whites, instead of the three that the recipe calls for.  When I made this recipe I felt, when I was spreading the meringue, that there just wasn’t enough for mounding it adequately in the center of the pie.",
    "Yield:  Makes one lemon pie.",
    "Source:  The Williamsburg Cookbook, Updated 1975 Edition, Published by The Colonial Williamsburg Foundation, Williamsburg, Virginia."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "08 - Desserts"
}