{
  "title": "Low Fat Lemon Pound Cake",
  "requires": "",
  "ingredients": [
    "½ cup (1 stick) unsalted butter",
    "2¼ cups sugar, divided in use",
    "5 teaspoons grated lemon zest (about 3 lemons), divided in use",
    "1½ cups egg substitute",
    "1 teaspoon vanilla extract",
    "1 teaspoon lemon extract",
    "3½ cups unbleached all-purpose flour, sifted",
    "1 teaspoon baking soda",
    "¼ teaspoon salt",
    "1 cup low-fat lemon yogurt",
    "½ cup fresh lemon juice"
  ],
  "instructions": [
    "Prepare a 10-inch (12 cup) Bundt pan by spraying the insides with nonstick spray and lightly flouring it, then set it aside.  Preheat the oven to 300° F.",
    "In bowl, sift together the flour, baking soda, and salt and set aside.",
    "In a large bowl, combine the butter and 1¾ cups of sugar.  Beat the mixture well to combine the sugar and butter.  It should look “fluffy” and “light” when you’re done.  Add 1 tablespoon lemon zest and beat well before adding the egg substitute, a little at a time, beating well after each addition.  After the last addition of egg substitute, and after beating, add the vanilla and lemon extract and beat to mix.",
    "Add a portion of the flour mixture to the butter and egg mixture and beat until the flour is incorporated.  Follow the addition of a portion of the flour by adding a portion of the yogurt and beating until it too has been incorporated.  Continue adding alternately, the flour and yogurt, until all the flour and yogurt have been added; however, make sure you start by adding flour and end the process by adding the last of the flour.  Also, you should take care not to over beat the batter during this process.",
    "Pour the batter in the prepared Bundt pan and smooth out the top with a rubber spatula.  Place in the center of the preheated oven and bake for 1 hour and 15 minutes, or until a sharp knife inserted into the center of the cake comes out clean.",
    "Remove the cake, when done, from the oven and place on a wire rack.  Let the cake cool for 15 minutes.  Turn the cake out onto a serving plate and let it continue to cool.",
    "Place the remaining ½ cup sugar, ½ cup lemon juice, and the remaining lemon zest (about 2 teaspoons) in a small sauce pan and bring to a boil over medium-high heat, stirring until the sugar is dissolved.  Pour this syrup onto the top of the cake.  Try to moisten every part of the top and sides by spooning slowly and accurately.  Do not just pour the syrup over the cake quickly, as the syrup will just flow to the bottom, and make the cake wet and soggy at the bottom.  You want to try to moisten the cake carefully so that it is uniformly moist."
  ],
  "remarks": "This version of pound cake contains (approximately):  360 calories, 22 mg of cholesterol, 8 grams of fat, 154 mg of sodium, 6 grams of protein, and 66 grams of carbohydrate per serving.  The “normal” version of the pound cake (6 large eggs, 1 cup whole milk, instead of the egg substitute and yogurt) would have (approximately):  521 calories, 158 mg cholesterol, 26 grams fat, 107 mg sodium, 7 grams protein, and 66 grams carbohydrate.",
  "yield": "Make 12 servings.",
  "source": "Jeanne Jones:  Cook It Light, San Antonio Express, Wednesday, February 27, 2002.",
  "category": "08 - Desserts"
}