{
  "title": "Low-Fat Coffee Cake",
  "requires": "",
  "ingredients": [
    "For the Cake –",
    "1½ cups all-purpose unbleached flour",
    "1 teaspoon baking powder",
    "1 teaspoon baking soda",
    "¼ teaspoon salt",
    "¾ cup sugar",
    "2 tablespoons cold butter",
    "1 egg, beaten",
    "½ cup applesauce",
    "½ cup fat-free sour cream or plain yogurt",
    "¼ cup fat-free milk",
    "1 teaspoon vanilla extract",
    "For the Streusel Filling",
    "⅓ cup light brown sugar",
    "2 teaspoon cinnamon",
    "¼ cup chopped nuts, toasted",
    "¼ cup oatmeal"
  ],
  "instructions": [
    "Spray an 8-by-8-inch baking pan with nonstick cooking spray and set it aside.",
    "Prepare the Streusel filling and set it aside.",
    "Preheat the oven to 375° F.",
    "Sift together the flour, baking powder, baking soda, salt, and the sugar into a mixing bowl.  Cut the cold butter into small bits dropping them into the flour mixture; work the butter into the flour mixture using your fingertips until all the butter has been incorporated into the flour mixture.  When done set the mixing bowl aside.",
    "In a separate bowl, add the egg and whip it with a fork until it’s well beaten.  Add the applesauce, sour cream (or yogurt), the milk, and the vanilla and whip the mixture with the fork until all the ingredients are well blended.",
    "Add the egg mixture to the flour mixture and with a whisk mix the ingredients together to make the batter, taking care to not over-mix.",
    "Spread half of the batter in the bottom of the prepared baking pan.  Sprinkle half of the Streusel filling over the batter.  Using a large spoon drop the remaining batter, in dollops, all over the Streusel filling then carefully spread the dollops as evenly as possible.  Finally, spread the remaining Streusel filling on top of the cake.",
    "Place the cake in the center rack of the preheated oven and bake for 25 minutes; or, until a sharp knife comes out clean when inserted into the center of the cake."
  ],
  "remarks": "",
  "yield": "Make on 8-by-8-inch Coffee cake.",
  "source": "Less Sugar, Fat-Free Sour Cream Coffee Cake, Cook It Light by Jeanne Jones, Taste Section of the  Express-News, Wednesday, June 21, 2006.",
  "category": "08 - Desserts"
}