{
  "title": "Mango and Peach Ice Cream",
  "requires": "",
  "ingredients": [
    "4 cups whipping cream",
    "3 cups half-and-half",
    "8 egg yolks",
    "1½ cups sugar",
    "1½ teaspoons vanilla extract",
    "2 pounds ripe peaches",
    "4 ripe medium size mangos",
    "¼ cup Ameretto",
    "2 tablespoons fresh lemon juice"
  ],
  "instructions": [
    "In a large heavy saucepan over medium heat, combine the whipping cream and the half-and-half.  Bring this mixture to a boil.",
    "Meanwhile, in a large bowl, whisk the egg yolks.  When well mixed, whisk in 1 cup of sugar.  When the sugar is blended slowly dribble the hot cream into the egg mixture, whisking constantly (one needs to preclude the egg mixture setting as a result of the hot cream mixture).  When all the cream has been blended into the eggs, return the mixture to the heavy saucepan and set it over low heat.  Cook, stirring constantly with a wooden spoon, until the mixture thickens sufficiently to heavily coat the back of the wooden spoon and it leaves “a track” when you draw a finger across the back of the spoon.  This should occur in 4 to 5 minutes on the correct heat.  Do not allow the mixture to boil.  Transfer this custard to a large bowl, add the vanilla extract and stir to mix it, then allow the custard to cool to room temperature.  (Place the bowl on a wire rack to cool more efficiently; or, if you are pressed for time place the bowl in a cold-water bath.)",
    "While the custard is cooling prepare the peaches and mangos.",
    "Bring a medium pan of water to a boil.  One or two at a time, lower the peaches into the boiling water, wait 30 seconds, then with a slotted spoon, transfer the peaches to a large bowl of cold water (you may add ice is you wish) and stop the cooking quickly.  Peel the peaches (the skins will now slip off easily), pit them, cut them into pieces and place them in a large bowl that will contain them, the mango purée, and the custard that should be cooling.  Using a potato masher, mash the peaches leaving them in a coarsely blend.  (You want to remember that the state of the peaches, after you mash them, will determine the texture of the pieces of peach in your ice cream.)  Next, peel and pit the mangoes.  Place the pieces of mango in a blender and purée them.  Lastly, combine the mango purée with the mashed peaches and add the remaining ½ cup of sugar, the Amaretto, and the lemon juice.  If the custard had cooled to room temperature then proceed otherwise cover the peach and mango mixture with plastic and wait until the custard has cooled down to room temperature.",
    "Stir in the cooled custard mixture into the peach and mango mixture mixing well.  When well mixed, cover with a piece of plastic wrap, pressing the plastic down onto the surface of the custard and refrigerate until it’s well cooled (cold), preferably overnight.",
    "In the canister of an ice-cream maker, churn the ice cream according to the manufacturer’s directions.",
    "Spoon out the finished ice cream into a container (or containers), cover tightly, and store it in the freezer.  Before serving, allow the ice cream to soften slightly by removing it from the freezer and allowing it to rest in the refrigerator for a half hour of more.",
    "Yield:  Makes about 1 galleon.",
    "Source:  The El Paso Chile Company’s Texas Border Cookbook, by W. Park Kerr and Norma Kerr, published by William Morrow and Co., Inc., New York, © 1992 by W. Park Kerr and Norma Kerr and Michael McLaughlin."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "08 - Desserts"
}