{
  "title": "Oak Hills Country Club Pecan Pie",
  "requires": "This recipe requires one baked, 9-inch pie crust; either homemade or purchased.",
  "ingredients": [
    "1 cup light corn syrup",
    "1 cup sugar",
    "3 tablespoons butter, melted",
    "1 tablespoons half-and-half cream",
    "3 whole eggs",
    "1 teaspoon vanilla",
    "1 cup whole pecans",
    "Whipped cream of vanilla ice cream, for serving (optional)"
  ],
  "instructions": [
    "I you are making the pie crust make sure to prick the bottom of the pie shell with a fork.  After the pie shell is cooked allow it to cool on a wire rack to room temperature.",
    "Preheat the oven to a temperature of 275° to 285° F.",
    "In a large bowl, combine the corn syrup, sugar, melted butter, and the half-and-half.  In a separate bowl, lightly beat the eggs with the vanilla.  Pour the egg mixture into the sugar mixture and combine everything well.",
    "Arrange the pecans in the pastry shell.  Pour the egg and sugar mixture slowly and carefully into the pie shell; trying not to disturb the arranged pecans as you pour the mixture.",
    "Bake the pie on the middle rack of the preheated oven for 1 hour and 10 minutes; or, until it is puffed and the mixture has set.  Remove the pie from the oven and allow it to cool on a wire rack.  Serve the pie while it’s still “just” warm; or, at room temperature.  (If the edges of the pie crust start to become over cooked take a square piece of foil large enough to cover the pie; fold it in half then in fourths.  Then with scissors cut to remove the center and trim the “peaks” to get a rough circle with a hole in the center.  Place this foil on the pie to cover the pie crust edge and continue cooking the pie for the full time called for.)",
    "A dollop of whipped cream or vanilla ice cream completes this elegant dessert."
  ],
  "remarks": "I wonder if a small piece, 4- by 4-inch square, of wax paper or foil laid on top off the arranged pecans, would help when pouring the egg and sugar mixture into the pie shell.  It can easily be removed afterwards, drained and discarded before placing the pie in the oven.",
  "yield": "Make one 9-inch pie.",
  "source": "Chefs’ Secrets by Pat Mozersky, Food Section,  Express-News, Wednesday, August 31, 2005.",
  "category": "08 - Desserts"
}