{
  "title": "Perfect Pie Crust",
  "requires": "",
  "ingredients": [
    "1½ cups Wondra flour",
    "¼ cup chilled unsalted butter, cut into 1-inch cubes",
    "¼ cup chilled solid vegetable shortening",
    "¼ teaspoon salt",
    "¼ cup cold liquid; water, orange or lemon juice combined with water",
    "All purpose flour for dusting the work surface"
  ],
  "instructions": [
    "In a blender or food processor blend the Wondra flour, butter, shortening and salt until the mixture is crumbly and pieces are the size of small peas.",
    "Add the liquid and mix until the dough comes clean from the sides of the bowl and forms a ball.",
    "Flatten the dough into an 8-inch circle; wrap it in plastic wrap and place it in the refrigerator for 30 minutes.",
    "Preheat the oven to 400° F.",
    "Place the dough on a lightly floured surface and roll it in a 12-inch circle and dust it lightly with flour.  Place the rolling pin at the circle of the dough, and roll it over the rolling pin.  Gently unroll the dough onto a greased pie pan.  Without forcing or stretching the dough, press it into the pie pan.  Be careful that the dough is not too thick where the bottom and sides meet.",
    "Allow 1-inch of dough to hang over the edge of the pie pan; and trim off the excess.  Turn the 1-inch excess underneath the pie pan side to form a narrow rolled rim.  Pinch the rim, alternating all along the pie pan to form an attractive edge.",
    "Prick the dough, sides and bottom of the pie shell, with a fork before baking.  Set a piece of waxed paper on the dough; and fill the pie pan with either rice or beans to prevent it from shrinking or rising in the bottom of the pie pan.",
    "Bake the pie crust in the middle of the oven for 25 minutes.  Remove the pie crust from the oven and remove the rice (or beans) and waxed paper and return it to the oven to continue baking until the pastry is lightly browned, approximately 5 minutes.",
    "Note:",
    "If the pie recipe calls for an unbaked shell, which will be filled before baking, do not prick the dough.",
    "For a two-crust pie, simply double the recipe."
  ],
  "remarks": "",
  "yield": "Makes one 8-, 9-, or 10-inch pastry shell.",
  "source": "The Pies Have It, by Rita Leinwand, Bon Appétit, September 1977.",
  "category": "08 - Desserts"
}