{
  "title": "Reduced-Fat Pineapple Upside-Down Cake",
  "requires": "",
  "ingredients": [
    "2 tablespoons butter",
    "¼ cup brown sugar",
    "1 (20-ounce) can pineapple in juice, drained (rings, chunks, or crushed)",
    "2 cups all-purpose, unbleached flour",
    "1 teaspoon baking soda",
    "¼ cup (½-stick) less two tablespoon butter softened to room temperature",
    "1¼ cups sugar",
    "½ cup liquid egg substitute; or, 4 egg whites",
    "2 teaspoons vanilla extract",
    "1 cup low-fat buttermilk"
  ],
  "instructions": [
    "Combine the flour and baking soda in a small bowl, stir to mix, and set it aside.  Place the butter, less two tablespoons, in a large mixing bowl and allow the butter to soften and come to room temperature.",
    "After the butter has softened preheat the oven to 350º F. and spray a 9-by-13-inch pan with nonstick spray.",
    "Place 2 tablespoons of the butter in a pan and put it in the oven to melt.  As soon as the butter is melted remove the pan from the oven and sprinkle the brown sugar evenly over the bottom of the pan.  Evenly distribute the drained pineapple over the brown sugar mixture and set the pan aside.",
    "Add the sugar to the softened butter and beat with a blender until the mixture is smooth.  Add the egg substitute (or egg whites) a little at a time beating for 30 seconds after each addition.  After all of the egg substitute has been incorporated add the vanilla extract and mix the batter well.  Add half of the flour mixture and incorporate it with the blender, then add half of the buttermilk and incorporate it with the blender.  Repeat with the second half of the flour mixture and buttermilk.  Beat until you have a smooth batter.  Spoon the batter over the pineapple-brown sugar in the baking pan and smooth the top without disturbing the bottom of the pan.",
    "Bake in the center of the hot oven for 40 minutes; or, until a sharp knife inserted into the center comes out clean.  Allow the cake to cool for 5 to 10 minutes then turn the cake upside down onto a serving platter.  Carefully remove any of the pineapple and brown sugar that sticks in the pan and place it on the cake."
  ],
  "remarks": "Avoid the temptation of leaving the cake in its pan as the sugar and pineapple need to be exposed to the air to avoid “sweating” into the cake.",
  "yield": "The cake should yield about 16 individual servings.",
  "source": "Turn Fat Content Upside Down, Dining Section,  Express-News, Wednesday, February 14, 2007.",
  "category": "08 - Desserts"
}