{
  "title": "San Franciscan Apple Pie",
  "requires": "",
  "ingredients": [
    "1 stick (½ cup) unsalted butter",
    "6 large, peeled and sliced Pippin or Green apples",
    "¼ cup sugar",
    "¼ cup apricot preserves",
    "1 tablespoon finely grated lemon rind",
    "¼ cup dark rum",
    "2 cups sour cream",
    "½ cup firmly packed light brown sugar",
    "2 tablespoons flour; or, tapioca",
    "¼ teaspoon salt",
    "2 teaspoons vanilla",
    "2 eggs",
    "1 teaspoon cinnamon",
    "1 10-inch baked pastry shell",
    "2 teaspoons Apricot Glaze",
    "½ cup shredded coconut",
    "½ cup chopped walnuts or pecans"
  ],
  "instructions": [
    "Melt the butter in a large skillet set over medium-low heat.  When the melted butter comes up to cooking temperature add the apples and the sugar.  Stir to mix well; cover and allow the apples to cook for 10 minutes (stir once or twice as the apples cook).  Uncover, and continue cooking until the apples are softened, but not “falling apart soft.”",
    "Uncover and stir the apricot preserves and lemon rind.  Turn up the heat and cook this mixture over brisk heat for no more than two minutes then remove the skillet from the heat.",
    "In a small pan or metal ladle, heat then ignite the rum.  Pour the flaming rum over the apple mixture stir until the alcohol is burned off then set the apple mixture aside to cool.",
    "Preheat the oven to 375° F.",
    "In a separate bowl beat together the sour cream, brown sugar, flour, salt, vanilla, eggs, and cinnamon.  Add half of this mixture to the cooked apples; stir, and taste to determine if the sugar and lemon balance is to your liking.  If it isn’t then this is the time to correct it.",
    "Pant the insides of the pastry shell with the Apricot Glaze then pour in the apple mixture.  Pour, on top of the apples, the remaining sour cream mixture.  Lastly, spread the chopped pecans (or walnuts) and shredded coconut over the pie.",
    "Bake in the upper third of the preheated oven.  Bake only until the coconut and the nuts are toasted.",
    "Serve slightly warm."
  ],
  "remarks": "",
  "yield": "One 10-inch pie; approximately 8 servings.",
  "source": "The Pies Have It, by Rita Leinwand, Bon Appétit, September 1977.",
  "category": "08 - Desserts"
}