{
  "title": "Strawberries and Peaches with Balsamic Zabaglione",
  "requires": "",
  "ingredients": [
    "For the Zabaglione –",
    "1 cup heavy (whipping) cream",
    "4 egg yolks",
    "¼ cup sugar",
    "¼ cup “vin santo”",
    "1 tablespoon aged balsamic vinegar",
    "For the Fruit –",
    "1 pint ripe strawberries, cleaned and cut into halves",
    "2 ripe peaches, pitted and cut into ¼-inch slices",
    "½ cup “vin santo”",
    "½ cup honey",
    "2 tablespoons sugar"
  ],
  "instructions": [
    "To make the zabaglione use a medium bowl.  Whip the heavy cream to stiff peaks then cover and refrigerate.",
    "In a stainless-steel bowl, whisk the egg yolks with the sugar, “vin santo”, and balsamic vinegar.  Place the bowl over a saucepan of simmering water or transfer to the top part of a double boiler and whisk vigorously, using a balloon whisk.  Continue whisking over the simmering water until the mixture is thick and foamy.  Remove the bowl from the heat and continue whisking until the zabaglione is completely cool.  Take the whipped cream out of the refrigerator and gently fold the zabaglione into it.  Cover again and chill for 30 minutes.",
    "While the zabaglione is chilling, place the cleaned and cut strawberries and peaches in a large bowl.  In a small saucepan, combine the “vin santo”, honey, and sugar and bring to a boil.  Stir to completely dissolve the sugar, and then cook the mixture until reduced slightly.  Pour the hot syrup over the fruit and toss to coat it all.  Spoon the fruit into dessert dishes or wine glasses and top with a dollop of the zabaglione.",
    "Remarks:  This quick little pan roast really captures the spirit of Italian food culture although I’ve [Mario Batali] never seen anything quite like it in .  The balsamic-flavored zabaglione is a nod to the classis Modenese osteria dessert of raw strawberries with balsamic vinegar and black pepper."
  ],
  "remarks": "",
  "yield": "Serves 6 to 8.",
  "source": "The Babbo Cookbook by Mario Batali, published by Clarkson Potter/Publishers, , © 2002 by Mario Batali.",
  "category": "08 - Desserts"
}