{
  "title": "Apple Friters with Ice Cream: Fritelle di Mele con Gelato Recipe copyright 2001, Mario Batali. All rights reserved. 2 quarts canola oil, for frying\n2 large eggs\n1/4 cup milk\n1 cup flour\n1/4 cup sugar\n2 tablespoons kirsch\n6 green apples, peeled, cored and sliced into 1/2-inch thick rounds\n2 cups vanilla gelato, recipe follows \nCinnamon, to dust fritters In a tall-sided pot, heat the oil to 375 degrees F. In a medium mixing bowl, whisk together the eggs and milk. Slowly add flour to the mixture, 3 tablespoons at a time, until it is all incorporated. Stir in the sugar and kirsch and allow the mixture to stand for 10 minutes. Dip each slice into batter and cook in the hot oil, 3 or 4 at a time. Cook until golden brown, then remove with a slotted spoon or tongs to a plate lined with paper towels to drain. Continue until all are done. Place 5 slices on each of four plates, in an overlapping circle. Place 1 scoop vanilla gelato in the center of each circle of fritters, sprinkle with cinnamon, and serve immediately. Vanilla Gelato:\n3 cups milk\n1 cup heavy cream\n14 egg yolks\n1 cup sugar, divide into half-cups\n1 vanilla bean, split and scraped In a heavy-bottomed saucepan, combine the cream, half-cup sugar and vanilla bean and bring just to a boil. Meanwhile, in a large bowl, combine the yolks and 1/2-cup sugar and whisk well until the yolks are pale yellow. Remove the milk from the heat and slowly whisk about 1/3 of the milk into the yolk mixture. Stir well and return the whole lot to the pan and return the pan to the heat. Cook over medium heat, whisking constantly, until the mixture begins to thicken, after which time you should switch to a wooden spoon and cook for an additional two minutes. Remove from the heat and strain into a clean, cool container that has been set in an ice bath. Stir to facilitate cooling. Run the cooled mixture through an ice cream machine according to the manufacturers’ instructions and freeze. Yield: 4 servings\nPrep Time: 20 minutes\nCook Time: 20 minutes",
  "requires": "",
  "ingredients": [],
  "instructions": [],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "09 - Desserts"
}