{
  "title": "Black Forest Cake",
  "requires": "",
  "ingredients": [
    "3 large eggs",
    "¾ cup superfine sugar",
    "1¼ cups unbleached flour",
    "¼ cup cocoa",
    "1 teaspoon baking powder",
    "5 tablespoons hot water",
    "2½ cups heavy cream",
    "4 to 5 tablespoons Kirsch",
    "4 oz semi-sweet chocolate curls",
    "¾ lb canned black cherries, pitted and well drained"
  ],
  "instructions": [
    "Lightly butter and flour three 8-inch cake pans, line the bottom with a piece of wax paper cut to size and set aside.",
    "Preheat the oven to 375° F.",
    "Place the eggs and sugar in the top of a double boiler over simmering water.  Beat until the mixture is a pale and thick and just holds the trail of the beaters.  Remove from the heat and beat for 2 minutes more.  Sift the flour, cocoa, and baking powder onto a plate.  Carefully fold it into the egg mixture, cutting through with a metal spoon and evenly mixed.  Gently stir in the hot water.",
    "Spoon the mixture into the cake pans.  Bake for 10 to 12 minutes, or until firm to the touch.  Turn out, remove the paper and cool on a wire rack.",
    "Whip the cream until stiff and place one-third into a bag fitted with a star tip.",
    "Place the bottom layer of the cake on a cake plate and sprinkle it with a little kirsch and pipe a band of cream around the edge.  Reserve 8 to 10 cherries for decoration of the top layer and place the remainder inside the cream and fill the top of the bottom layer with the cream/cherry mix.  Place another cake on top of the bottom layer and sprinkle with kirsch.  Spread the cake with cream, and cherry/cream mix just as you did the bottom layer.  Sprinkle the bottom layer of the top cake with the remaining kirsch and invert onto the cream layer.",
    "Cover the top and sides of the cake with cream, decorate with the reserved cherries and sprinkle with the chocolate curls.  Pipe cream around the top edge and chill.",
    "Remarks:  This chocolate and cherry cake is a very popular dessert.",
    "Yield:  One cake that serves 8-10.",
    "Source:  Harrods Cookery Book by Marilyn Aslani, Arbor House, New York, © 1985 by Marilyn Aslani and the National Magazine Co. Ltd."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "09 - Desserts"
}