{
  "title": "Coconut Cake with Lemon Filling",
  "requires": "Grated fresh coconut (the recipe is in the Miscellaneous folder)",
  "ingredients": [
    "For the cake layers:",
    "6 large egg yolks",
    "1 cup sugar",
    "1 tablespoon grated orange rind",
    "2 teaspoons grated lemon rind",
    "2 teaspoons orange juice",
    "2 teaspoons fresh lemon juice",
    "6 large egg whites, at room temperature",
    "¼ teaspoon cream of tartar",
    "1 cup all-purpose flour sifted",
    "½ teaspoons double-acting baking powder",
    "¼ teaspoon salt",
    "For the filling:",
    "4 large egg yolks",
    "⅓ cup sugar",
    "½ stick (¼ cup) unsalted butter, cut into pieces",
    "½ cup fresh lemon juice",
    "2 teaspoons grated lemon rind",
    "For the frosting:",
    "¾ cup sugar",
    "4 large egg whites at room temperature",
    "a pinch of cream of tartar",
    "1 tablespoon fresh lemon juice",
    "1 tablespoon grated orange rind",
    "2 teaspoon grated lemon rind",
    "1 teaspoon vanilla",
    "2 cups grated fresh coconut, or to taste"
  ],
  "instructions": [
    "The cake layers:  Line 3 buttered 8-inch round cake pans with wax paper, butter the paper, and dust the pans with flour.  In a large bowl with an electric mixer beat the egg yolks with ½ cup of the sugar until the mixture is lemon colored and ribbons when the beater is lifted and stir in the orange juice, and the lemon juice.  In a bowl beat the egg whites with the cream of tarter and a pinch of salt until they hold soft peaks, add the remaining ½ cup of sugar, a little at a time, beating, and beat the meringue until it hold stiff peaks.  Fold the meringue into the yolk mixture alternately with the flour mixture.  Divide the mixture among the pans and bake the layers in the middle of a preheated moderate oven (350° F.) for 25 minutes, or until a cake tester inserted in the centers comes out clean.  Let the layers cool in the pans on racks for 5 minutes, invert them onto the racks, and let them cool completely.\tThe filling:  In a heavy stainless steel or enameled saucepan combine the egg yolks, the sugar, the butter, and the lemon juice and cook the mixture over moderate heat, whisking vigorously, until it thickens, but do not let it boil.  Stir in the lemon rind, transfer the mixture to a bowl, and let it cool.  Chill the filling, covered with a buttered piece of wax paper, for at least 1 hour.",
    "The frosting:  In a small heavy saucepan combine the sugar with ¼ cup water, bring the mixture to a boil, and boil it over moderate heat, stirring and washing down any sugar crystals clinging to the sides with a brush dipped in cold water, until it reaches the soft-ball stage; or a candy thermometer registers 234° F.  In a bowl with an electric mixer beat the egg whites with the cream of tarter and a pinch of salt until they hold soft peaks, with the mixer running add the hot syrup in a stream, and beat the meringue until it is completely cool.  Beat the lemon juice, the orange rind, the lemon rind, and the vanilla.",
    "Completion:  Arrange 1 cake layer on a cake plate, spread it with half the filling, and top it with a second cake layer.  Spread the second layer with the remaining filling and top it with the remaining, cake layer.  Spread the frosting on the top and sides of the cake and coat it with the grated coconut.  Garnish the cake plate with orange slices.",
    "Yield:  One festive cake.",
    "Source:  Gourmet’s Menus:  A Southern Thanksgiving, Gourmet Magazine, November 1982."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "09 - Desserts"
}