{
  "title": "Dessert Crêpes",
  "requires": "",
  "ingredients": [
    "1 cup all-purpose flour",
    "2 large eggs",
    "1 egg yolk",
    "¾ cup milk",
    "⅓ cup melted butter",
    "2 tablespoons sugar",
    "A large pinch of salt",
    "¾ cup water"
  ],
  "instructions": [
    "If using a blender, put the flour in the jar, then add the eggs and egg yolk, milk, melted butter, sugar, and salt.  Blend for 5 to 10 seconds to make a thick, lump-free batter.  Add the water and blend until smooth.  Refrigerate the batter for at least an hour, or even overnight.",
    "To make the batter by hand, whisk the flour, the eggs and egg yolk, milk, melted butter, sugar, and salt together, to make a very thick, smooth batter, then whisk in the water.  Refrigerate the batter for at least an hour, or even overnight.",
    "Remove the batter from the refrigerator and whisk the batter well.  Set you pan over moderate heat for a minute or two.  When hot, brush the bottom with a very thin coat of melted butter.  Ladle up to 3 or 4 tablespoons of batter and pour onto one side of the bottom of the pan.  (If you have to, use a measuring cup to obtain a consistent (equal) quantities of batter in the pan for each crêpe.)",
    "Immediately tilt and rotate the pan to spread the batter all over the pan bottom as quickly as possible.  Shake the pan to keep the last of the batter flowing until you cover the entire bottom.  If the batter doesn’t cover the entire bottom, drizzle a few more drops of batter onto the bare spots and tilt and spread it in a thin, even layer.",
    "Cook over medium to high heat for about 45 seconds to 1 full minute, until the edges are cooked and the bottom is lightly browned.  The first cooked side – the side that is the presentable side for appearance sake – should be distinctly colored, with dark streaks and swirls.  If it is still pale after 45 seconds, then raise the heat slightly and cook a little longer; if too brown, lower the heat.",
    "To loosen the crêpe from the pan, bang the bottom of the pan on towel you’ve folded and set on the side of the stove; or, smack the side of the pan with your hand (use a towel or pot holder).  Then toss the pan to flip it over.  Or, lift one edge of the crêpe with a fork or spatula, then pick it up with your fingers and turn it over rapidly.",
    "Cook the crêpe on its second side about 30 to 45 seconds – it doesn’t need as much color – and slide it onto a plate or wire rack to cool, first side up.  Wipe the pan clean of any crumbs or cooked bits of batter and remaining butter and repeat the process until the batter is all used up.  (If you are using a non-stick pan, you may not need to coat it with melted butter each time – but brush it again whenever the crêpes begin to stick.)  Stack the crêpe on top of each other as they come out of the pan, or cool them first on wire racks if you wish.",
    "After the crêpes are cool, stack them and wrap them in plastic wrap.  Store in the refrigerator for a couple of days, or keep them frozen up to a month.",
    "Remarks:  In the beginning, you may be a bit wasteful, using 4 tablespoons of batter for each crêpe, before you get the hang of coating the pan with half that amount.  And remember too that the first couple of crêpes may stick and fall apart.  Jacques Pepin says, “The pan must get in the mood.”",
    "Yield:    Makes twelve to fifteen 7-inch crêpes.",
    "Source:  Julia and Jacques Cooking at Home by Julia Child and Jacques Pepin, published by Alfred A. Knopf, Inc., © 1999 by A La Carte Communications."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "09 - Desserts"
}