{
  "title": "Dorothy Zehnder’s Apple Kuchen",
  "requires": "",
  "ingredients": [
    "½ cup butter or margarine",
    "Two ¼-cup measures of sugar",
    "¼ teaspoon vanilla, plus an additional ½ teaspoon",
    "1¼ cups all-purpose flour, plus an additional ⅓ cup",
    "6 ounces cream cheese, softened",
    "¼ cup sugar",
    "1 egg",
    "1½ cups peeled and chopped apples",
    "1½ cups peeled and sliced apples",
    "2 tablespoons apple juice",
    "2 tablespoons brown sugar, plus and additional ⅓ cup packed",
    "1 teaspoons ground cinnamon",
    "½ teaspoon lemon juice",
    "½ cup rolled oats",
    "¼ cup butter or margarine"
  ],
  "instructions": [
    "In a bowl place the cream cheese at least an hour before starting and allow it come to room temperature and soften.",
    "Preheat the oven to 350° F.",
    "In a separate bowl combine ½ cup butter, ¼ cup sugar, and ¼ teaspoon vanilla.  Gradually beat in 1¼ cups of all-purpose flour.  The mixture will turn out crumbly.  Press this crumbly mixture into the bottom, and up the sides, of a 9-inch pie plate.  (Make sure that you spread it as evenly as possible before you start pressing it to conform to the bottom of the pie plate. Otherwise, the piecrust will vary in thickness and it’s very difficult to re-distribute the mixture once you’ve begun pressing it into the pie plate.)  Bake in the oven for 5 minutes.  Remove the pie plate with the crust from the oven and allow it to cool.",
    "Beat the cream cheese, ¼ cup sugar, and ½ teaspoon vanilla until everything is well combined.  Beat in the egg and when well blended pour this mixture into the pie crust.",
    "Mix the apples, apple juice, the remaining ¼ cup sugar, 2 tablespoons brown sugar, cinnamon, and lemon juice.  Spoon this mixture on top of the cream cheese in the pie plate and bake the pie for 45 minutes.",
    "Combine the oats with ⅓ cup brown sugar.  Cut in ¼ cup butter using a piecrust tool until the mixture resembles coarse crumbs.  After the pie has baked for 45 minutes remove it from the oven and sprinkle this oat mixture on top of it.  Return the pie to the oven and bake it for an additional 15 to 20 minutes.",
    "Yield:  Makes 1 pie.",
    "Source:  Recipe is from the Bavarian Inn, Frakenmuth, MI., featured on Food Network’s “The Best Of”, Episode #: BESP12, November 2001."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "09 - Desserts"
}