{
  "title": "Eagle Brand Key Lime Pie",
  "requires": "This recipe requires one unbaked, 9-inch pie crust; either homemade or purchased.",
  "ingredients": [
    "3 eggs, yolk and whites separated",
    "1 (14-ounce) can Eagle Brand Sweetened Condensed Milk",
    "½ cup key lime juice",
    "2-3 drops green food coloring (optional)",
    "1 (9-inch) unbaked pie crust",
    "¼ teaspoon cream of tartar",
    "⅓ cup sugar",
    "Instruction:",
    "Preheat the oven to 325° F.",
    "In a medium bowl, beat the egg yolks on low speed; gradually beat in the condensed milk and the lime juice until the mixture is smooth.  Stir in the food coloring, if you intend to use some.  Pour this mixture into the unbaked pie crust.",
    "Bake in the center rack of the preheated oven for 30 minutes.  After 30 minutes remove the pie from the oven and set it on a wire rack for the moment.  Increase the oven temperature to 350° F.",
    "In a large bowl add the egg whites and the cream of tartar and beat the mixture with the beater set on “high” until soft peaks form.  Reduce the speed setting of the beater to medium and gradually add the sugar, one tablespoon at a time, to the egg whites and beat.  When all the sugar has been incorporated, beat for at least 4 minutes longer; until all the sugar is clearly dissolved and stiff peaks form in the meringue.  The meringue should have a “glossy” appearance.",
    "Immediately spread the meringue over the hot pie.  Carefully seal the meringue to the edges of the pie crust to prevent it from breaking from the edges and shrinking when you place it in the oven.  Place the pie on the center rack of the heated oven and bake it for 15 minutes; or, until it take on a nice golden color.",
    "Remove the pie from the oven and allow it to cool for at least 1 hour.  Chill the pie in the refrigerator for at least 3 hours before bringing it to the table.  Store any leftovers, covered, in the refrigerator.",
    "Yield:  Makes 1 (9-inch) pie.",
    "Source:  Sublime Key Lime by Bonnie Walker, Express-News Staff Writer, Food Section, Recipe from Eagle Brand,  Express-News, Wednesday, August 31, 2005."
  ],
  "instructions": [],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "09 - Desserts"
}