{
  "title": "French Strawberry Cake",
  "requires": "The “Perfect Génoise Batter” for one 8-inch cake; the recipe for which is in the “Breads, Cakes, and Cookies” folder.",
  "ingredients": [
    "For the Cake –",
    "2 pints ripe fresh strawberries, hulled and sliced",
    "¼ to ⅓ cup sugar (depending on the sweetness of the strawberries)",
    "For the Cream –",
    "1¼ cups cold heavy cream (whipping cream)",
    "2 tablespoons sour cream",
    "2 tablespoons sugar",
    "1 teaspoon pure vanilla extract",
    "For the Garnish –",
    "5 large strawberries"
  ],
  "instructions": [
    "Position a rack in the lower third of the oven and preheat the oven to 350° F.  Grease the bottom and sides of an 8-inch round cake pan with solid shortening, dust with flour, and tap out the excess.  Insert into the bottom of the cake pan a cut round of waxed paper and apply vegetable shortening to it also.",
    "Make the Génoise Batter according to the instructions of the recipe and carefully pour the batter into the prepared pan, smoothing the top with a rubber spatula, working from the center outwards and creating a slightly raised ridge around the sides.  Bake for 25 to 27 minutes, or until the top springs back when lightly prodded and the cake starts to come away from the sides of the pan.  Transfer the cake to a rack and let rest for 5 to 10 minutes.",
    "To remove the cake from the pan, first test its readiness.  Tilt and rotate the pan, then gently tap it on the counter.  If it doesn’t seem as if the cake is releasing for the pan, or you are the cautious type, run a thin blade between the cake and the sides of the pan, freeing the sides and letting a little air get under the cake.  Invert the cake onto a rack and remove the pan.  Slowly peel off the waxed paper liner, turn the paper over, and put it back on the cake.  Cover the cake with another rack and invert it again.  Remove the top rack and let the cake cool completely right side up.",
    "The cake can remain uncovered at room temperature for a day, but it should be wrapped in plastic if you won’t be using it within 2 days.  For longer storage, wrap it well and freeze it for up to 10 days.  Thaw, still wrapped, at room temperature.",
    "Toss the sliced strawberries with the sugar in a large bowl and leave them, uncovered, at room temperature for at least 2 hours.",
    "Coarsely mash the strawberries with the tines of a fork and toss them again; let them stand for one hour longer.  You can do this the day before, but the strawberries should be refrigerated after they are mashed.",
    "Using a mixer fitted with the whisk attachment or a hand-held mixer, whip the heavy cream, sour cream, sugar, and vanilla together until the mixture forms soft peaks.  The cream is the proper consistency when the tracks made by the whisk close slowly and almost disappear.  Cover and refrigerate the cream until you’re ready to frost the cake.  Just before using the cream, give it a turn or two by hand with a whisk to bring the mixture together again.",
    "Using a serrated knife and a gentle sawing motion, cut the cake horizontally into 3 layers.  Place the bottom layer cut side up on a cardboard round or the removable bottom of a tart pan.  Lifting the berries form the bowl with a slotted spoon so that most of the liquid drains off, spoon half of the mashed strawberries over the cake layer, then spread a thin layer of the whipped cream over the berries.  Top with the middle cake layer, spoon on the rest of the strawberries, and spread another thin layer of cream over the strawberries.  Center the top layer over the filling.",
    "Working with a flexible metal spatula, frost the top and sides of the cake with whipped cream, leaving about ½ cup of the cream for decoration.  Spoon the remaining whipped cream into a pastry bag fitted with a ¼-inch star tip and pipe 10 rosettes around the top of the cake, positioning the rosettes about an inch in from the edge and leaving an inch between each rosette.",
    "Slice each of the five strawberries you’ve selected for the garnish in half.  Prop a strawberry half, cut side down, on top of each rosette and refrigerate the cake for at least an hour before serving.",
    "Remark:",
    "This is the French version of the American “Strawberry Shortcake”.",
    "The strawberries and cream mixture can be used with Vanilla Pound Cake the recipe for which is in the “Breads, Cakes, and Cookies” folder.",
    "The cake can be refrigerated for several hours before serving.  Keep it away from any foods in the refrigerator with strong odors.  Cream picks up odors from the refrigerator quickly.  It would be ideal if you could store the cake in a box.",
    "Yield:  One 8-inch, three layer cake (makes about 8 to 10 individual servings).",
    "Source:  Baking with Julia, Everyday Delights by Dorie Greenspan, William Morrow and Co., Inc., New York, © 1996 by A La Carte Communications, Inc."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "09 - Desserts"
}