{
  "title": "German Cinnamon Coffee Cake",
  "requires": "",
  "ingredients": [
    "4 cups all-purpose flour",
    "1 package dry yeast",
    "1 cup milk",
    "½ cup shortening",
    "¼ cup sugar",
    "1 teaspoon salt",
    "2 eggs",
    "1 cup packed light brown sugar",
    "½ cup whipping cream",
    "1 teaspoon ground cinnamon"
  ],
  "instructions": [
    "In a large mixing bowl, combine 2 cups of the flour and the yeast.  In a sauce pan heat the milk with the sugar, shortening, and the salt until it’s just warm (115° to 120° F.), stir occasionally until the shortening has melted and the sugar and salt are blended in.  Add the milk mixture and the eggs to the flour and yeast mixture and beat with a blender set at low speed for about ½ minute, scrapping the sides of the bowl constantly.  Turn the speed of the blender to high and beat the mixture for 3 minutes.  Next, by hand, stir in the remaining flour but do not knead.",
    "Grease or butter the insides of the mixing bowl and place the dough in the bowl and turn the dough around inside the bowl to coat the dough with the shortening (or butter); cover with plastic wrap and place the bowl in the refrigerator.  (The dough may be used as soon as it is thoroughly chilled; or, it may be kept in the refrigerator overnight; or, kept up to several days in the refrigerator before using.)",
    "On the day you will be making the coffee cake prepare (grease or butter) two 8- by 8- by 2-inch baking pans ahead of time and set aside.",
    "Divide the dough in half and place each half in one of the prepared baking pans.  Press the dough into the baking pans by hand making sure it’s pressed into the corner of the pans.  Cover the pans and set them in a warm place to let the dough rise.  Let the dough rise to double in size; about 45 minutes to one hour.",
    "Combine the brown sugar, the cream, and the cinnamon and mix well.",
    "When the dough has risen remove the plastic from each of the pans and with your index finger punch holes in the dough at least ½ apart, almost to the bottom of the dough in the pan.  Pour the brown sugar mixture into the depressions and bake in the preheated oven at 400° F. for about 20 minutes.  Allow the pans to cool for 10 minutes before removing the loaves from their pans.  Cool the loaves on wire racks.  When ready to serve cut the loaves into slices and serve warm.",
    "Yield:  Make two loaves.",
    "Source:  Magazine clipping in Abby’s collection."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "09 - Desserts"
}