{
  "title": "Heirloom Key Lime Pie",
  "requires": "",
  "ingredients": [
    "For the crust -",
    "1¼ cups graham crackers, crushed to crumbs",
    "½ cup sifted powdered sugar",
    "6 tablespoons unsalted butter, melted and cooled",
    "For the filling –",
    "4 egg yolks",
    "1 (14-ounce) can sweetened condensed milk",
    "½ cup key lime juice, divided use",
    "½ teaspoon cream of tartar",
    "For the topping –",
    "4 egg whites",
    "¼ cup sugar"
  ],
  "instructions": [
    "Making the crust –",
    "Preheat the oven to 350° F.",
    "In a bowl, combine the graham cracker crumbs, powdered sugar, and the melted butter.  Pour the mixture into a 10-inch pie plate and spread and press the mixture to form the crust.  Place in the center rack of the preheated oven and bake for 10 minutes; or, until it’s lightly browned.",
    "Making the filling –",
    "Reduce the heat of the oven to 325° F.",
    "Beat the egg yolks until light in color then stir in the sweetened condensed milk, ¼ cup of the key lime juice, and the cream of tartar.  Mix well then add the remaining ¼ cup of key lime juice and mix.  Spoon the mixture into the prepared pie crust and place on the center rack of the oven and bake until the mixture sets; about 10 to 15 minutes.",
    "Remove the pie from the oven and allow it to cool to room temperature then place the pie in the freezer.  Freeze the pie for at least 3 hours.",
    "Making the topping –",
    "Preheat the oven to 450° F.",
    "Beat the egg whites with the sugar until stiff peaks form.  Spread the meringue over the pie, making sure that the edges are well sealed with the meringue and bake until the meringue is golden brown.",
    "Yield:  Makes one 10-pie.",
    "Source:  Sublime Key Lime by Bonnie Walker, Express-News Staff Writer, Recipe from ‘The Key West Cookbook’ (1949), www.homecooking.about.com , Food Section, San Antonio Express-News, Wednesday, August 31, 2005."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "09 - Desserts"
}