{
  "title": "Mocha Pie",
  "requires": "",
  "ingredients": [
    "1⅓ cups fine chocolate wafer crumbs (about 18 2¾-inch wafers)",
    "3 tablespoons soft unsalted butter, softened to room temperature",
    "1 cup milk",
    "3 tablespoons instant coffee granules",
    "32 marshmallows",
    "2 egg yolks",
    "2 cups whipping cream",
    "Garnish your own way; candy coffee beans or shaved chocolate leaves (see remarks)"
  ],
  "instructions": [
    "Preheat the oven to 375° F.",
    "Crush or pulse to crush in a blender the chocolate wafers.  Blend the softened butter into the cookie crumbs and press onto the bottom and sides of an 8-inch pie pan.  Bake for 8 minutes then remove and set aside to cool.",
    "Over medium heat, combine the milk and the coffee granules in a 3-quart saucepan.  Stir to dissolve.  When dissolved add the marshmallows; and heat until all of the marshmallows are melted and completely incorporated.  You will need to stir constantly as you melt the marshmallows.",
    "Beat the egg yolks until light in color; add a few tablespoons of the marshmallow mixture to the yolks, and stir.  Add the tempered egg yolk mixture to the marshmallow mixture in the pan and continue cooking for 1 minute, stirring constantly.  Pour into a 3-quart bowl and refrigerate until it thickens but has not yet set.",
    "Whip the whipping cream and fold half of the cream into the marshmallow mixture and pour into the prepared pie crust.  Chill until the marshmallow and cream mixture is set and firm.  Use the remaining whipping cream for garnishing the pie."
  ],
  "remarks": "To make “chocolate leaves” melt 1 ounce of unsweetened chocolate, and using a brush, brush the undersides of mint leaves.  Place the brushed leaves in the freezer.  When frozen simple peel off the mint leaf from the chocolate.  The chocolate will take on the texture of the mint leaf.  Use the chocolate leaves to garnish the pie. Yield:  One 8-inch pie; approximately 6 servings. Source:  The Pies Have It, by Rita Leinwand, Bon Appétit, September 1977. Mocha pie",
  "yield": "",
  "source": "",
  "category": "09 - Desserts"
}