{
  "title": "Orange Swirl Coffee Cake",
  "requires": "",
  "ingredients": [
    "For the cake –",
    "1 package (¼-ounce) active dry yeast",
    "¼ cup warm water (110º to 115º F.)",
    "1 cup sugar, divided as explained in the recipe",
    "2 eggs",
    "½ cup sour cream",
    "9 tablespoons butter or margarine, softened to room temperature and divided into 6,",
    "1 and 2 tablespoons portions",
    "1 teaspoon salt",
    "3¼ to 3½ cups all-purpose flour",
    "¾ cups flaked coconut, toasted",
    "2 tablespoons grated orange peel",
    "For the glaze –",
    "6 tablespoons",
    "1½ teaspoons cornstarch",
    "¼ cup sour cream",
    "2 tablespoons butter or margarine",
    "1 tablespoon orange juice",
    "¼ cup flaked coconut, toasted"
  ],
  "instructions": [
    "In a mixing bowl dissolve yeast in warm water.  When the yeast has dissolved add ¼ cup sugar, 2 eggs, ½ cup of sour cream, 6 tablespoons of butter, 1 teaspoon salt and mix everything well.  Add enough of the flour to form a soft dough; it should take most of the measured flour.  Turn out the soft dough onto a floured work surface and knead until the dough is smooth and elastic, about 6 to 8 minutes.  Using the 1 tablespoon portion of softened butter coat the insides of a bowl and into this bowl place the worked dough.  Turn the dough around in the bowl once, to coat it, and then set it in a warm place, covered, to rise until the dough has doubled in size, about 1 hour.",
    "Combine the coconut, orange peel, and remaining sugar and set the mixture aside.",
    "Once the dough has risen, punch it down and turn it out onto a floured work surface.  Roll it into roughly a18-inch by 10-inch rectangle.  Melt the remaining 2 tablespoons of butter and brush it over the rectangle of dough.  Spread the coconut and orange peel mixture over the buttered dough and roll it up, jelly-roll style.  Pinch the seams sides to seal them then set the rolled dough, seam side down, in the bottom and center of a buttered 10-inch tube pan; lastly pinch the two ends together.  Cover and again let the dough rise in a warm place until it again has doubled in size, again about 1 hour.",
    "Bake at 350º F. for 30 minutes; or, until it is golden brown.  Remove the baked cake from the oven and allow it to cool for 10 minutes on a wire rack before turning it upside down and removing it from the tube pan.  Place the cake on its serving platter and allow it to cool on the wire rack while you make the orange glaze.",
    "Combine the sugar, cornstarch, sour cream, butter, and orange juice in a saucepan.  Bring the mixture to a boil over medium heat and allow it to boil for 2 minutes.  Remove the pan from the heat and spoon, or brush, the glaze over the warm coffee cake.",
    "Sprinkle the toasted coconut flakes over the cake and serve.",
    "Yield:  15 to 20 normal servings.",
    "Source:  A Taste of the Country, Recipe by Barbara Daniel, , Country Magazine, October/November 2000.",
    "swirl coffee cake"
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "09 - Desserts"
}