{
  "title": "Peach Crostata with Honey Butter",
  "requires": "This recipe requires the making of a batch of “Tart Dough”, several recipe for which are found in the “Desserts and Pastries” < “Pie” folder, including Mario Batali’s.",
  "ingredients": [
    "For the filling –",
    "1½ cups blanched, sliced almonds",
    "½ cup (1 stick) unsalted butter",
    "1 cup sifted confectioner’s sugar",
    "1 egg",
    "For the streusel -",
    "6 tablespoons unsalted butter",
    "1¼ cups all-purpose flour",
    "½ cup blanched, sliced almonds",
    "¾ cups sugar",
    "¼ teaspoon kosher salt",
    "6 medium ripe peaches",
    "1 tablespoons fresh lemon juice",
    "2 tablespoons all-purpose flour",
    "½ cup sugar",
    "For the honey butter –",
    "1 cup honey",
    "½ vanilla bean, split lengthwise",
    "¼ cup (½-stick) unsalted butter, softened to room temperature"
  ],
  "instructions": [
    "Preheat the oven to 350º F.",
    "Roll out the chilled Tart Dough into a 12-inch circle, large enough to line the bottom and sides of a 10-inch tart pan with a removable bottom.  Press the dough into the sides and trim off the top so that the dough is flush with the tart pan.  Place the pastry shell in the refrigerator and chill until it is completely firm, about 30 minutes.",
    "To make the filling spread the almonds evenly on a baking sheet and toast them in the oven until they are light golden brown; about 5 to 6 minutes.  After you remove them from the oven allow them to cool completely, and then place them in a food processor and pulse until they are finely chopped but not powdery.",
    "In the bowl of an electric mixer, cream the butter and the confectioner’s sugar until it’s very smooth and creamy.  Beat in the egg followed by the vanilla and salt.  Scrape down the sides of the bowl.  Thoroughly beat in the ground almonds and set aside.",
    "To make the streusel melt the butter in a small pan and set it aside to cool.  Place the flour, almonds, sugar, and the salt in the bowl of a food processor and pulse to combine.  Add the melted butter and pulse to form “pea-size” crumbs.  Spread the streusel out onto a cookie sheet and chill briefly.",
    "Peel the peaches and cut into ¼-inch wedges.  In a large bowl, toss the peach wedges with the lemon juice, vanilla, flour, and sugar.",
    "Spread enough of the almond filling on the bottom of the tart to completely cover it.  Arrange the peach slices densely on top of the almond filling.  Sprinkle the streusel crumbs over the tart.  Place the tart on a baking sheet to catch any juices and bake for 45 to 50 minutes or until the crust and the streusel are nicely browned and the juices are bubbling.  Remove from the oven and allow it to cool completely before removing the tart from the pan.",
    "To make the honey butter pour the honey into a small sauce pan and add to it the insides of a split vanilla bean.  Bring the mixture to a boil then lower the heat and simmer for 10 minutes, or until the honey is reduced by two thirds.  Whisk in the butter until it is completely incorporated.",
    "Serve the Peach Crostata with a scoop of vanilla ice cream and drizzle with the honey butter.",
    "Yield:  Should serve 8 to 10 persons.",
    "Source:  The Babbo Cookbook by Mario Batali, published by Clarkson Potter/Publishers, , © 2002 by Mario Batali."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "09 - Desserts"
}