{
  "title": "Perfect Génoise Batter",
  "requires": "",
  "ingredients": [
    "2 tablespoons unsalted butter, melted",
    "1 cup sifted cake flour",
    "½ cup sugar",
    "⅛ teaspoon salt",
    "4 large eggs, at room temperature",
    "1 teaspoon pure vanilla extract"
  ],
  "instructions": [
    "Position a rack in the lower third of the oven and preheat the oven to 350° F.  Grease the bottom and sides of an 8-inch round cake pan with solid shortening, dust with flour, and tap out the excess.  Insert into the bottom of the cake pan a cut round of waxed paper and apply vegetable shortening to it also.",
    "Pour the melted butter into a 1-quart bowl and set it aside.",
    "Return the sifted cake flour to the sifter or sieve and add 1 tablespoon of sugar and the salt and sift it onto a piece of waxed paper and set it aside.",
    "Put the eggs and the remaining sugar into the bowl into the bowl of a heavy-duty mixer (or work with a hand-held mixer).  Using the whisk attachment from the mixer, by hand, beat the mixture to blend the ingredients before turning on the power.  When blended, using the whisk attachment, whip the mixture in the bowl on medium speed until it is airy, pale, and triple in volume, like soft whipped cream; about 4 to 5 minutes with a heavy-duty mixer.  You’ll know that the eggs are properly whipped when you lift the whisk and the mixture falls back into the bowl in a ribbon that rests on the surface of the batter in the bowl for about 10 seconds before blending in.  If the ribbon falling from the whisk blends and sinks into the mixture in less than 10 seconds continue whipping for a few more minutes.  When you finally achieve the results pour in the vanilla extract during the last moments of whipping.",
    "Detach the bowl from the heavy-duty mixer (if you’re using one) and sprinkle about one third of the sifted flour mixture over the batter.  Fold in the flour with a rubber, or plastic, spatula, stopping as soon as the flour is incorporated.  Fold in the rest of the flour in two more additions.  (Do not pour all the flour at once into the batter.)",
    "Gently spoon about 1 cup of the batter into the 1-quart bowl, which you set aside with the melted butter in it, and fold the butter into the batter with the spatula.  Then, fold this mixture into the batter in the mixer bowl.  (This is the point at which the batter is at its most fragile state, so fold gingerly.)  (Stop folding as the last speck of flour has disappeared.)",
    "The batter should be poured into a prepared pan and baked immediately.",
    "Bake for 25 to 27 minutes, or until the top springs back when lightly prodded and the cake starts to come away from the sides of the pan.  Transfer the cake to a rack and let rest for 5 to 10 minutes.",
    "To remove the cake from the pan, first test its readiness.  Tilt and rotate the pan, then gently tap it on the counter.  If it doesn’t seem as if the cake is releasing for the pan, or you are the cautious type, run a thin blade between the cake and the sides of the pan, freeing the sides and letting a little air get under the cake.  Invert the cake onto a rack and remove the pan.  Slowly peel off the waxed paper liner, turn the paper over, and put it back on the cake.  Cover the cake with another rack and invert it again.  Remove the top rack and let the cake cool completely right side up.",
    "The cake can remain uncovered at room temperature for a day, but it should be wrapped in plastic if you won’t be using it within 2 days.  For longer storage, wrap it well and freeze it for up to 10 days.  Thaw, still wrapped, at room temperature."
  ],
  "remarks": "The génoise is to the French baker what the sponge cake is to the American baker, a vital “basic cake” and a building block for many, more complicate deserts.  It is drier than most American cakes and, for that reason, not every American’s favorite, but its dryness is considered an asset by the French, who soak their génoise with liqueurs and syrups of every conceivable flavor. For those who don’t know the cake, the process of making a génoise can seem intimidating.  It shouldn’t.  It may look as if disaster will strike at every turn, but it rarely happens, because at heart, the génoise is a very well behaved cake.  Follow the directions, and it will do just what it’s supposed to do – even when you think it won’t. Yield:  One 8-inch round cake. Source:  Baking with Julia, Everyday Delights by Dorie Greenspan, William Morrow and Co., Inc., New York, © 1996 by A La Carte Communications, Inc.",
  "yield": "",
  "source": "",
  "category": "09 - Desserts"
}