{
  "title": "Pie Maker’s Reminder List A 9-inch pie requires approximately 4 coups of fruit for filling.  For more flavor and a better texture use instant tapioca instead of flour or cornstarch as a thickener.  Bake all your pies in the lower third of your oven; but pastry pie shell bake in the middle of your oven. 2.  The use of Wondra flour for pie dough produces a flakier crust. 3. To prevent soggy crusts, waterproof all your pie shells with slightly beaten egg whites or an apricot glaze. 4. Use a pastry sleeve on your rolling pin.  It’s washable, requires less flour for rolling and makes flakier crust. 5. Never over-flour the work surface. 6. An excellent surface for rolling is an approximately 2-foot square of Formica-covered wood.  Go to a cabinet maker.  The section they cut out of the counters where the kitchen sink fits in is usually discarded.  They might even give you one! 7. Grease all pie pans with a solid vegetable shortening before lining them with pastry dough. 8. It’s better to use an electric mixer or food processor rather than finger to mix pie dough.  Hand heat warms the shortening.  Always press the dough into a flat 8-inch circle, wrap it in plastic wrap and refrigerate for at least 30 minutes.  It chills faster than if left in a ball, and is easier to roll out. 9. If chilled dough is too stiff to roll, allow it to stand at room temperature until it becomes more pliable. 10. To prevent shrinking when baking an unfilled pie shell, prick the sides and the bottom of the pastry with a fork; line with wax paper (not foil as it does not breathe and pastry will not brown); weigh the wax paper down with enough rice or lima beans to cover the bottom of the pastry. 11. When making a meringue, for every 3 egg whites, use ⅛ teaspoon salt, ⅛ teaspoon cream of tarter, and 6 tablespoons of superfine sugar (2 tablespoons sugar per egg white).  One large egg white equals 1 ounce.  Superfine sugar dissolves faster than granulated. 12. To prevent “weeping” after a meringue is baked:  when bating egg whites add sugar 1 tablespoon at a time; cover warm, not chilled, filling with meringue; meringue should be ¾ to 1 inch thick; push meringue against all sides of the crust. 13. Do not over bake meringue; at 425° F. bake 6 minutes; 400° F. bake 8 minutes; 350° F. 15 to 18 minutes. 14. Paint top crust of fruit pies with milk or cream and dust with granulated sugar for a delicious glaze. 15. Cut four steam vents in top crust of fruit pie to prevent fruit from bubbling over. 16. To give a glisten to fruits atop open tarts: paint red fruits like strawberries or plums with currant glaze and yellow fruits like peaches, apricots or bananas with apricot glaze. 17. A good pastry brush is a 2-inch white bristle paint brush available in hardware or paint stores.",
  "requires": "",
  "ingredients": [],
  "instructions": [],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "09 - Desserts"
}