{
  "title": "Sour Cream-Walnut Breakfast Cake",
  "requires": "",
  "ingredients": [
    "For the cake –",
    "2 cups all-purpose flour",
    "1 cup whole wheat flour; preferably “whole wheat pastry” flour",
    "¾ teaspoon baking soda",
    "1 tablespoon baking powder",
    "½ teaspoon salt",
    "¾ cup butter, softened",
    "1 cup sugar",
    "½ cup firmly packed light brown sugar",
    "1 teaspoon vanilla extract",
    "3 eggs",
    "1½ cups regular sour cream",
    "Cinnamon-Walnut Filling",
    "2 tablespoons cold butter, cut into small bits",
    "Powdered sugar",
    "For the filling –",
    "½ cup sugar",
    "1½ teaspoons ground cinnamon",
    "½ cup finely chopped walnuts"
  ],
  "instructions": [
    "Several hours before you begin unwrap and place the butter in a large mixing bowl and let it come to room temperature; also, take the eggs out of the refrigerator and let them come to room temperature as well.",
    "In a medium size bowl, stir together the flours, baking soda, baking powder, and salt and set it aside.  Similarly, but in a smaller bowl, mix together the filling ingredients (sugar, cinnamon, and walnuts) together and set it aside as well.",
    "Butter (or grease) and lightly flour a 10-inch Bundt pan, or other tube pan with a 10 to 12 cup capacity, and set it aside.",
    "When ready to begin start by preheating the oven to 350° F.",
    "Cream the butter with the sugars (both white and brown) until the mixture is light and fluffy.  When the mixture is well creamed (light and fluffy) add the vanilla and beat until it too is well incorporated into the mixture.  Next add the eggs, one at a time to the butter and sugar mixture and beat the mixture well until it looses its glossy texture before adding the next egg.  Once the eggs are well blended in the sugar and butter mixture you will be adding the flour and sour cream alternatively.  Make it three portions of flour to two of sour cream.  Start with a flour portion and blend it into the mixture well before adding the sour cream portion.  Repeat the process until all the flour and sour cream has been incorporated and well blended.",
    "Spoon in; at the bottom of the prepared Bundt pan, about two tablespoons of the Cinnamon-Walnut Filling then on top pour half of the batter.  Sprinkle half of the remaining Cinnamon-Walnut Filling onto the batter and dot with half (one tablespoon) of the cold butter bits.  Onto this pour the remaining batter; and like before, sprinkle the remaining Cinnamon-Walnut Filling and dot with the remaining (one tablespoon) cold butter bits.",
    "Bake the cake in the center rack of the preheated oven until the cake tests as “done” when tested at the thickest part with a toothpick (or skewer).  This should be about 45 to 50 minutes in the preheated oven.",
    "Remove the cake from the oven when done and allow it to stand on a wire rack for 10 minutes before inverting the Bundt cake pan to release the cake within.  Dust the top of the cake with the powdered sugar before bring to the table.",
    "Remarks:  I think I’ll try this recipe with raisins in the Cinnamon-Walnut Filling and pecan instead of walnuts.",
    "Yield:  Make one cake approximately 10 to 12 individual servings.",
    "Source:  Coffee Cake Make Breakfast a Delight by Annette Gooch, Universal Press Syndicate, published in the Food Section, San Antonio Express-News, Wednesday, July 20, 2005."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "09 - Desserts"
}