{
  "title": "Toasted Coconut Cream Pie",
  "requires": "",
  "ingredients": [
    "4 eggs, separated",
    "5 tablespoons sugar",
    "⅓ cup milk",
    "1 cup envelope unflavored gelatin",
    "2 teaspoons vanilla",
    "⅛ teaspoon salt",
    "⅛ teaspoon cream of tartar",
    "3 tablespoons sugar",
    "2 cups whipping cream",
    "4 tablespoons",
    "1 baked 10-inch pie crust",
    "2 teaspoons Apricot Glaze",
    "1¾ cups finely shredded fresh coconut"
  ],
  "instructions": [
    "Place the egg yolks and sugar in top of a double boiler.  Beat with electric hand mixer or whisk until it becomes lemon colored.  Set it over simmering water.  To avoid curdled yolks, the water should not touch the upper section of the double boiler.  Cook for 5 minutes, stirring constantly.",
    "Add the milk and gelatin, and continue stirring until the gelatin is completely dissolved.  Remove from the heat and pour it into a large bowl, add the vanilla and allow it to cool.",
    "Beat the egg whites until foamy, add the salt and cream of tartar, and continue beating until soft peaks form.  Add the sugar, one tablespoon at a time, and continue beating until peaks are stiff and shiny.  Fold this into the yolk mixture.",
    "Whip the whipping cream until soft peaks form, add the  and continue beating until stiff.  Fold this into the egg mixture.",
    "After painting the pastry shell with the Apricot Glaze, spoon in the filling and refrigerate until firm.",
    "Preheat the oven to 350° F.",
    "Spread the coconut on a cookie sheet, place the cookie sheet in the middle rack of the oven and bake for 5 to 6 minutes; or, until the coconut is lightly browned.  As the coconut is baking open the oven door and stir the shredded coconut often to prevent uneven browning.",
    "Spread the toasted coconut over the pie and serve cold.",
    "Yield:  On 10-inch pie; approximately 8 servings.",
    "Source:  The Pies Have It, by Rita Leinwand, Bon Appétit, September 1977.",
    "Toasted Coconut Cream Pie"
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "09 - Desserts"
}