{
  "title": "Vanilla Pound Cake",
  "requires": "",
  "ingredients": [
    "3 cups all-purpose flour",
    "2 teaspoons baking powder",
    "½ teaspoon salt",
    "2 sticks (8 ounces) unsalted butter, at room temperature",
    "2 cups sugar",
    "3 large eggs, at room temperature, whisked to blend",
    "1 cup milk, at room temperature",
    "2 teaspoons pure vanilla extract"
  ],
  "instructions": [
    "Position a rack in the lower third of the oven and preheat the oven to 350° F.  Butter and flour a 10-inch tube pan, or any other 12-cup decorative pan with a center tube.",
    "Sift the flour with the baking powder and salt together onto a sheet of waxed paper and set aside.",
    "Put the butter into a bowl or a mixer fitted with the paddle attachment (or work with a hand held mixer) and beat at medium speed until smooth.  With the machine running, add the sugar in a steady stream.  Stop the machine and scrape down the paddle and sides of the bowl with a rubber spatula.  Continue to beat at medium speed until the mixture is very light and fluffy, about 4 to 5 minutes.",
    "With the mixer still at medium speed, begin to add the eggs in small additions, about a tablespoon at a time.  If the mixture becomes watery or shiny, stop adding the eggs and beat at an increased speed just until it smoothes out.  When the batter has come together again, decrease the speed to medium and continue adding the eggs, scraping down the paddle and sides of the bowl form time to time; it will take 3 to 4 minutes to incorporate the eggs.  The mixture is properly combined when it appears white, fluffy, and increased in volume.",
    "Reduce the mixer speed to low and add the flour mixture and the milk alternately – 4 additions of flour, 3 of milk – scraping the paddle and bowl frequently and mixing until the batter is smooth after each addition.  Add the vanilla and mix just to blend.",
    "Spoon the batter into the prepared pan and smooth the top with a spatula.  Bake for 55 to 65 minutes, or until a wooden toothpick inserted in the center of the cake comes out clean.  Transfer the cake to a cooling rack and allow it to cool in the pan for 10 minutes.  Invert the cake onto a rack, remove the pan, and cool to room temperature.  The cake is best served in very thin slices."
  ],
  "remarks": "The pound cake is called, “pound cake” because its original recipe proportions were:  a pound of flour, a pound of butter, a pound of sugar, and a pound of eggs. The cake can be kept covered at room temperature for about 3 days or wrapped airtight and frozen for a month.  Keep in mind that the stale pound cake is excellent lightly toasted and used as the base for ice cream sundaes. Yield:  One pound cake will be approximately 16 to 20 individual servings. Source:  Baking with Julia, Everyday Delights by Dorie Greenspan, William Morrow and Co., Inc., New York, © 1996 by A La Carte Communications, Inc.",
  "yield": "",
  "source": "",
  "category": "09 - Desserts"
}