{
  "title": "Viennese Breakfast Cake",
  "requires": "",
  "ingredients": [
    "For the dough -",
    "½ cup warm water (use a thermometer to have the water between 105° to 115° F.)",
    "1 package active dry yeast",
    "¼ cup granulated sugar",
    "1 teaspoon salt",
    "1 teaspoon grated lemon peel",
    "1 cup butter, or margarine, softened",
    "6 eggs",
    "4½ cups sifted all-purpose flour (sift before measuring)",
    "For the filling –",
    "3 tablespoons butter or margarine, softened",
    "⅔ cup light-brown sugar, packed",
    "2 egg yolks",
    "2 tablespoons milk",
    "¼ teaspoon vanilla extract",
    "2 cups finely chopped walnuts or pecans",
    "For brushing –",
    "¼ cup butter or margarine, melted",
    "For decoration –",
    "Confectioner’s sugar"
  ],
  "instructions": [
    "One day ahead, make the dough.  If possible, check temperature of the water with a thermometer.  Sprinkle the yeast over water in large bowl of electric mixture; stir until dissolved.  Add the granulated sugar, salt, grated lemon peel, 1 cup butter, 6 eggs, and 3 cups of flour.  At medium speed, beat 4 minutes.",
    "Add remaining flour and at low speed, beat until smooth – about 2 minutes.  Cover the bowl with wax paper (spray Pam© on the side of the wax paper that will be towards the dough) then with a damp towel, let the dough rise in a warm place (at least 85° F.), free from drafts, until its double in bulk – about 1½ to 2 hours.  Remove from where you are letting it rise, cover with foil and put in the refrigerator overnight, until the next day.",
    "Before you take the dough out of the refrigerator begin preparing the filling.  Let 3 tablespoons of butter soften in a medium bowl.  With a wooden spoon mix in the brown sugar and the egg yolks.  Add the milk and vanilla and finish mixing it before you add the pecans or walnuts.  Mix thoroughly.",
    "Next grease or butter two bread loaf pans (9-by-5-by-3-inch) and set aside.  Melt the ¼ cup of butter that you’ll use to brush on the dough.",
    "Only after you’ve made the filling, prepared the pans, and melted the butter remove the dough from the refrigerator.  Punch down the dough and turn it out on a floured surface and roll it into one large ball.  With a knife divide it into two equal portions and put one back in the bowl and keep it in the refrigerator until you’re ready to work on the second loaf.  Working quickly, roll out half the dough into a rectangle, 14- by 9-inches.  Make sure its not sticking to the work surface then brush the top half with the melted butter and then spread half the prepared filling to within ½-inch of the edges.  From each of the long sides of the “rectangle” roll up the dough, jelly-roll fashion, towards the center.  Lift carefully and place in one of the prepared pans, smooth side up.  Lightly brush the top with the melted butter.  Only after you’ve finished with the first loaf retrieve the dough for the second loaf from the refrigerator and repeat the process to fashion the second loaf.  Place both loafs in a warm place, covered with sprayed wax paper, as described above, and let rise for 1½-hours.",
    "Preheat oven to 350° F. and bake for 35 minutes, or until the loafs are golden-brown.  When you remove the loafs from the oven set on a wire rack and allow them to cool for 15 minutes.  After they have cooled 15 minutes turn the pans upside down and shake the loaf loose.  Allow the loafs to cool completely and sprinkle the tops with confectioners’ sugar."
  ],
  "remarks": "This is a soft dough and if you attempt to work with it at room temperature it will stick to everything and be difficult to work.  This is why when you remove it from the refrigerator you want to have everything ready.  As long as the dough is cold it’s easy to work but if you’re slow it will become difficult and sticky. I didn’t use a pastry cloth and as long as the dough is cold it was easy to roll and work.  However, as it warmed up it became very difficult to handle, to lift and place in the prepared pans. Yield:  Makes two loafs. Source:  McCall’s Cooking School, Number 7, Viennese Breakfast Cake, © 1979, 1980 by the McCall Publishing Company, 230 Park Avenue, New York, N.Y. 10169. Viennese Breakfast Cake",
  "yield": "",
  "source": "",
  "category": "09 - Desserts"
}