{
  "title": "Chipotle  Sauce (Enchipolado)",
  "requires": "",
  "ingredients": [
    "½ ounce (about 6) chipotle chiles (dried, not in adobo)",
    "8 ripe tomatoes (about 2 pounds)",
    "2 white onions, chopped",
    "8 bay leaves",
    "½ teaspoon thyme",
    "1 entire head of garlic, cloves peeled",
    "2 tablespoons water",
    "3 tablespoons vegetable oil",
    "2 teaspoons freshly ground black pepper",
    "1 tablespoon sugar"
  ],
  "instructions": [
    "In a medium capacity pot, set over high heat, bring 1 quart of water to a boil with the chipotle chiles.  Once the water comes to a full boil allow the chiles to tenderize in the boiling water for a full 15 minutes.  Remove the pot from the heat and drain the water.  When the chiles are cool enough to handle remove the stems, open the pods and remove the seeds, then aside until needed.",
    "In a large pot bring enough salted water to a rolling boil to be able to float the tomatoes, four at a time.  Once the water reaches a rolling boil place half of the tomatoes in the water and allow them to remain in the boiling water for 1 minute.  Remove them from the water and place them in cold water.  Repeat, with the remaining tomatoes.  When the tomatoes are cool enough to handle peel them, slice them in quarters, remove the stem end, and place them in a large bowl until needed.",
    "Peel and chop the two onions and set aside until needed.  Similarly, peel the individual garlic cloves and set them aside until needed.",
    "Put the tomatoes, chopped onion, garlic, bay leaves, and thyme in a blender; add 2 tablespoons of water and purée.  Add the softened chiles and purée again.  Scrape down the blender’s sides and purée one more time.  Repeat the puréeing process until the chiles have been well processed and puréed.",
    "Set a deep pot over medium heat and heat the 3 tablespoons of vegetable oil.  When the oil is hot carefully add the blender mixture (it will sizzle and splatter!).  Turn the heat down to maintain a bare simmer and add the black pepper and the sugar and stir well.  Simmer the sauce, uncovered, for 30 minutes.  Taste the sauce for acidity and add more sugar if it remains too acidic.",
    "Use the sauce to make Camarones Enchipolados or Puerco Enchipolado."
  ],
  "remarks": "The sauce may be made ahead and refrigerated for a week or more.",
  "yield": "Makes about a quart.",
  "source": "A Cook’s Tour of Mexico by Nancy Zaslavsky, published by St. Martin’s Press, New York, New York, © 1995 by Nancy Zaslavsky.",
  "category": "04 - Sauces, Stock, and Dressings"
}