{
  "title": "Dad’s Salsa",
  "requires": "",
  "ingredients": [
    "2 (28-ounce) cans of small dice tomatoes",
    "1 (14.5-ounce) can of fire roasted diced tomatoes",
    "1 (8-ounce) can tomato paste",
    "16 or jalapeños, seeded and diced",
    "2 or more habaneros, cut in half (seeded or not depending on how hot you want the sauce)",
    "1 large onion, diced",
    "6 garlic cloves, diced",
    "1 tablespoon vegetable oil",
    "¼ cup cider vinegar",
    "2 to 3 tablespoons light brown sugar",
    "1 can chicken or beef broth (use beef broth if you prefer a stronger flavor)",
    "1 tablespoon dried Oregano",
    "Salt to  taste",
    "1 cup cilantro, stems removed and minced",
    "1 tablespoon corn starch dissolved in ¼ cup water"
  ],
  "instructions": [
    "Start by rinsing, seeding, and dicing the jalapeños and setting the final product aside.  Cut the habanero peppers in half, seeding them if you don’t want your sauce too hot otherwise just cut them with seeds; again set aside until needed.  Peel and dice the onion.",
    "In a large sauce cooking pot or Dutch oven, set over medium-high heat, bring the oil to cooking temperature and when it’s hot add the diced onion.  Sauté the onion in the oil until its translucent then add the diced garlic and continue cooking for two more minutes.  Add the diced jalapeño and the habaneros stir and mix well then add the 28-ounce and 14.5-ounce cans of tomato.  (I’ve made this recipe with whole tomatoes and other style of canned tomatoes but the best is a small dice cut.)  Add the vinegar, the broth, brown sugar, oregano, and the salt and stir to mix the ingredients well.  Lastly, add the tomato paste and stir to dilute and blend it into the sauce.  Bring the mixture to a boil then lower the heat to keep the sauce at a simmer and cook the sauce for an hour.  Remember to periodically stir the ingredient so that they won’t settle and begin burning on the bottom of the cooking pot.  Now comes the most important step!  Taste the hot sauce and adjust the sweetness, saltiness, and oregano if necessary.  Additionally, gauge how “spicy hot” your hot sauce has turned out.  (From experience, I found that the sauce tends to “taste” a little “hotter” than it will be in a day or so.)  If the sauce is “spicy hot” to your satisfaction then remove and discard the habanero peppers; otherwise, leave them in.",
    "Pour in the corn starch dissolved in water and increase the heat to bring the sauce to a boil again.  Continue cooking the sauce until it reaches the degree of thickness that you want in your sauce then turn off the heat and allow the sauce to cool.",
    "Rinse and drain the cilantro.  Mince the cilantro leaves and set aside until the hot sauce is just warm.  When the hot sauce has cooled to warm (not hot), add the minced cilantro and stir to mix all the ingredients well and divide the hot sauce in Mason jars.  (If you are keeping the habanero peppers make sure you distribute them evenly in the Mason jars to have uniform results.)",
    "Yield:  Makes about 2 quarts.",
    "Source:  The personal recipe of Sergio R. Perales."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "04 - Sauces, Stock, and Dressings"
}