{
  "title": "Pineapple & Apple Vinegar (Vinagre de Piña y Manzana)",
  "requires": "",
  "ingredients": [
    "1 quart apple cider vinegar",
    "2 small sour apples, such as pippin",
    "1 small pineapple, the rind scrubbed clean and thoroughly rinsed (organic, if possible)",
    "6 ounces of piloncillo or 6 ounces of dark brown sugar"
  ],
  "instructions": [
    "Wash and cut the apples into halves.  Remove the pineapple top without cutting into the rind, then scrub and rinse it well.  Cut the top and bottom of the pineapple with a sharp knife.  Setting the pineapple on one of its cut surfaces, slice down removing its rind, segment by segment, until the rind has been removed all around.  Lay the pineapple on its side and cut it into slices.  Store the slices in a container in the refrigerator and use for a separate purpose.  (Remove the center cores of the slices they are excellent in a pineapple upside down cake!)",
    "Place the piloncillo (or dark brown sugar) in glass crock, or jar (nonaluminum), add the pineapple rind, the apple halves, then pour in the cider vinegar.  Stir with a wooden spoon to mix the ingredients.  (If your crock isn’t large enough to contain all of the pineapple skin slices you’ll have to just use what you can make fit.)",
    "Cover and allow the mixture to ferment for 15 days (or two weeks) before passing the liquid through a fine sieve (use folded cheesecloth in your sieve) and store the vinegar in glass bottles with screw tops.  (If using Mason jars to store the vinegar place a piece of wax paper over the top of each jar before screwing on the lid.)",
    "The vinegar may be stored with all your other vinegars (it does not need to be refrigerated)."
  ],
  "remarks": "Last time I made this vinegar I used a whole galleon of cider vinegar; kept the number of apples and pineapple the same but doubled the piloncillo in the recipe.  It came out really good! This is also the best vinegar for making “Fruta en vinagre.” Yield:  About 1 quart. Source:  A Cook’s Tour of Mexico by Nancy Zaslavsky, published by St. Martin’s Press, New York, New York, © 1995 by Nancy Zaslavsky.",
  "yield": "",
  "source": "",
  "category": "04 - Sauces, Stock, and Dressings"
}