{
  "title": "Beef Soup (Caldo de Res)",
  "requires": "",
  "ingredients": [
    "For the Stock –",
    "3 pounds beef, cut into bite size cubes",
    "1 soup bone",
    "1 onion, peeled and quartered",
    "2 whole tomatoes cut in half",
    "4 to 6 sprigs of cilantro",
    "2 cloves garlic, peeled",
    "2 whole Serrano chilies",
    "1 teaspoon salt; or, to taste",
    "For the Soup –",
    "3 cloves garlic, peeled",
    "A pinch of cumin",
    "¼ teaspoon pepper; or, 6 whole pepper corns",
    "3 tomatoes, peeled and seeded",
    "Soup Vegetables –",
    "3 whole Serrano chilies",
    "4 carrots, chopped into ¼-inch thick rounds",
    "3 ribs celery, chopped into ¼-inch thick segments",
    "12 to 15 new potatoes, peeled and cut into bite size segments",
    "½ head, small cabbage, chopped",
    "3 ears fresh corn, cut into 3 pieces each; or, frozen corn on the cob halves"
  ],
  "instructions": [
    "In a large stock pot (6 quarts) place the stock items:  the beef bone, onion, tomatoes, garlic, chilies, and salt.  Pour in water until all the items are underneath the water.  Place the pot over medium heat and bring to a boil.  Once the water reaches a boil reduce the heat to low and simmer the stock, covered but with a slight crack to allow the steam to escape, for 1½ hours.  Remove the pot from the heat, skim off any foam off the surface, and allow the stock to cool enough for you to be able to work with out fear of burning yourself.",
    "Remove the soup bone, if there is any meat on the bone remove it and cut it into bite size pieces then add them, and the bone, back into the stock.  Remove and discard all the cilantro, onion, chilies, garlic, and tomatoes.",
    "If you have a “Molcajete”, or a mortar and pestle, grind the garlic with the cumin and the pepper then add the paste to the stock pot.  Use some liquid from the stock pot to wash out all the paste into the stock pot.  (If you don’t have either, chop the garlic into bits and add it to tomato when you blend it.)  In a blender, puree the peeled and seeded tomato, using a little beef broth facilitate the blending.  Add the puree to the stock pot.  Again, use some of the liquid from the pot, to wash all the puree from the blender into the stock pot.",
    "Return the pot to the stove over medium heat and stir to mix all the flavors together.  Taste the liquid stock to judge the balance of salt and other spices.   Use judgment here; judge from the amount of liquid you have remaining in the stock pot and the amount of vegetables you will be adding.  When you add the vegetables you may need to add more water to cover the contents, and so the stock, when you taste it, should be on the salty side.  On the other hand, if you don’t think you’ll need to add more water because the quantity of vegetables and remaining stock appear to be adequate to have the vegetables covered with liquid, then the contents of the stock, when you taste it, should be about as salty as you want it to be when you serve it.  If you need to adjust the salt level do so.",
    "Add all the fresh vegetables to the stock pot and, if necessary, add enough water to cover all the ingredients in the pot.  Bring the contents to a boil again then lower the heat to low, cover as before, and simmer for another 20 to 30 minutes; or, until the vegetables are done.  This last cooking time will vary depending on how thick you chopped the vegetables that you’ve added.  Remember, the meat is already cooked; you only need to finish cooking the vegetables."
  ],
  "remarks": "Above, I’ve modified the recipe for “Caldo de Res” in Melissa Guerra’s book, The Texas Provincial Kitchen to be what I grew up calling, “Clean the Refrigerator Soup”.  While there are some differences I think this combination captures the essence of my mother’s soup.   From the name, “Clean the Refrigerator Soup”, you might have guessed that what vegetables you add may vary each time you make this recipe.  Feel free to add some cut fresh green beans, chopped zucchini, chopped sweet potatoes, chopped turnips, etc.  However, in our house the normal vegetables my mother used were:  carrots, potatoes, celery, corn, and cabbage. This is an excellent cold weather soup.  In fact, this is one of the three basic dishes that I used to make on weekends when I was living on my own.  During the week days I simply heated up a portion of the soup in the evenings for myself.  With tortillas, it was an excellent and healthy element of my diet and very easy to do when one doesn’t wish to spend too much time cooking during work days. Yield:  Serves 12. Source:  Adapted from The Texas Provincial Kitchen by Melissa Guerra, © 1997 by Melissa Guerra, to the recipe that I called, “Clean the Refrigerator Soup”, my mother’s [Helen Perales] soup.",
  "yield": "",
  "source": "",
  "category": "05 - Soups"
}