{
  "title": "Creole Onion Soup Requires:  This recipe calls for the French bread to be spread with “Creole Butter.”  The recipe for which is in the “Miscellaneous > Odds and Ends” folder.  However, consider this as optional although it’s a nice touch.",
  "requires": "",
  "ingredients": [
    "¼ cup smoked ham drippings; or, bacon drippings",
    "3 tablespoons unsalted butter",
    "1 pound onions, thinly sliced",
    "¼ cup all-purpose flour",
    "7½ ounces smoked ham, trimmed and coarsely chopped (approximately 1½ cups)",
    "2 tablespoons fresh lemon juice",
    "1 tablespoon firmly packed light brown sugar",
    "1½ teaspoons Hungarian sweet paprika",
    "½ teaspoon freshly ground pepper",
    "½ teaspoon dried thyme leaves, crumbled",
    "¼ teaspoon cayenne pepper",
    "¼ teaspoon ground allspice",
    "¼ teaspoon ground cloves",
    "¼ teaspoon ground mace",
    "¼ teaspoon hot pepper sauce",
    "5 cups rich beef broth",
    "1 cup dry white wine",
    "2 cups whipping cream",
    "3 tablespoons Cognac",
    "Salt",
    "Oven-toasted French bread cut in slices"
  ],
  "instructions": [
    "Melt the ham, or bacon, drippings with the butter in a heavy large pot over medium-low heat.  Add the onions and cook until its golden, stirring occasionally, about 30 minutes.",
    "Reduce the heat to low.  Stir in the flour and cook for 5 minutes but do not let it brown.  Add the ham, lemon juice, sugar, paprika, pepper, thyme, cayenne, allspice, cloves, mace, and hot pepper sauce and cook for 5 minutes to blend the flavors, stirring occasionally.  Pour in the broth and wine.  Now increase the heat and bring the mixture to a simmer.  Cover partially (leave the cover slightly skewed) and simmer for 45 minutes.",
    "Remove the soup from the heat and allow it to cool enough to work with.  Purée in a food processor or blender in batches, pulsing to obtain a slightly grainy texture.  Return the purée to the same pot, blend in the cream and cook over medium-low heat until thick, about 20 minutes.",
    "Add the Cognac and cook for 5 minutes.  Adjust the seasoning with salt and hot pepper sauce to taste.  Spread the toasted French bread with the Creole Butter.  Ladle the soup into bowls, top each bowl with a slice of French bread and serve.",
    "Yield:  Serves 6.",
    "Source:  An Onion Sampler by Edena Sheldon, Bon Appétit, January 1985."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "05 - Soups"
}