{
  "title": "German Style Onion Goulash Soup Requires:  The original recipe calls for Rye Croutons, although any good quality crouton should do well.  However, if you intend to make the Rye Croutons the recipe is in the “Miscellaneous > Odds and Ends” folder.",
  "requires": "",
  "ingredients": [
    "½ pound piece (slab) smoked bacon, cut into ½-inch dice",
    "2 tablespoons solid vegetable shortening",
    "2 pounds beef rump roast, cut into ½-inch dice, at room temperature",
    "¾ pound onions cut into ½-inch dice",
    "3 medium red bell peppers cut into ½-inch dice",
    "3 medium garlic cloves, pressed",
    "¼ cup Hungarian sweet paprika",
    "2 tablespoons light brown sugar",
    "2 teaspoons salt",
    "1½ teaspoons caraway seeds, crushed",
    "1 teaspoon dried marjoram, crumbled",
    "Freshly ground pepper",
    "1 6-ounce can of tomato paste",
    "2 pounds fresh sauerkraut, rinsed and pressed dry with paper towels",
    "2 quarts beef broth",
    "1 12-ounce bottle of German dark beer, poured into a wide bowl and left to stand 1 hour",
    "1¼ pounds boiling potatoes, peeled and cut into ½-inch pieces",
    "2 bay leaves",
    "1½ cups sour cream",
    "⅓ cup snipped fresh chives",
    "Rye Croutons"
  ],
  "instructions": [
    "Cook the diced bacon in a heavy large pot over medium heat until its translucent, about 10 minutes.  Pour off the drippings, reserving 2 tablespoons if you are going to make Rye Croutons.  Add the shortening to the pot and melt it.  Increase the heat to medium-high and add the diced beef.  Brown the beef on all sides, working in batches to not crowd the beef in the pot, remove the browned pieces to a bowl and hold until all the beef has been browned.  Return all the beef to the pot when it’s all done.",
    "Reduce the heat to medium-low and add the onions and bell peppers and cook them until they are softened, stirring occasionally, about 10 minutes.  Add the garlic, paprika, sugar, salt, caraway seeds, marjoram, and pepper and stir the mixture until the meat is well coated with the spices.  Add the tomato paste and cook for 5 minutes.",
    "Add the sauerkraut, broth, and beer and bring it all to a simmer.  Cover, partially, and continue simmering for 1½ hours.  Add the potatoes and bay leaves and simmer uncovered until the soup has thickened to a chowderlike consistency, and additional 1½ to 2 hours.  Adjust the seasoning.",
    "To serve, ladle out the soup into bowls and top with a dollop of sour cream, croutons, and chives.",
    "Remarks:  I’d might cut the amount of sauerkraut called for; but the first time I make it I’d try the recipe as is and check it out.",
    "Yield:  Serves 6 to 8 persons.",
    "Source:  An Onion Sampler by Edena Sheldon, Bon Appétit, January 1985."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "05 - Soups"
}