{
  "title": "Sopa de Fideos Stilo Taxco",
  "requires": "",
  "ingredients": [
    "4 tablespoons vegetable oil, for the fideo",
    "2 tablespoons vegetable oil, for the vegetables",
    "4 ounces fideo pasta",
    "1 small white onion, finely chopped",
    "2 garlic cloves, put through a garlic press or very finely minced",
    "4 tomatoes, toasted on a comal, skins removed and chopped",
    "8 cups chicken broth",
    "2 fresh jalapeño chiles; slit down one side, seed intact",
    "8 cilantro sprigs",
    "Salt and pepper, to taste"
  ],
  "instructions": [
    "In a skillet, set over medium heat, heat the 4 tablespoons of vegetable oil.  When the oil is hot and just starting to smoke break the fideo twists into the hot oil and brown it until its golden brown; about 5 minutes, if everything is about right.  When the fideo is golden brown remove it to paper towels, using a slotted spoon, and allow the fideo to drain and the paper towels to absorb as much oil as possible.",
    "In a large pot heat the two tablespoons of vegetable oil over medium heat.  Again, when the oil is hot and just starting to smoke, add the onion and sauté them until its just starting to become translucent.  At this point add the garlic and tomatoes and continue sautéing for no more than 2 more minutes.  Pour in the chicken broth and stir to mix.  Add the jalapeño chiles, the cilantro, and the fideo and bring the soup to a boil.  Immediately after the mixture reaches a boil lower the heat setting to maintain a simmer.  Simmer the soup for 20 minutes.",
    "Lastly, remove the jalapeños, add salt and pepper, to taste, and stir to dissolve the salt in the soup.",
    "Ladle into large, soup bowls.",
    "Remarks:  The fideo soup may be served with grated hard cheese and accompanied with French rolls.",
    "Yield:  Makes 6 servings.",
    "Source:  A Cook’s Tour of Mexico by Nancy Zaslavsky, published by St. Martin’s Press, New York, New York, © 1995 by Nancy Zaslavsky."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "05 - Soups"
}