{
  "title": "Basic Steamed Rice",
  "requires": "",
  "ingredients": [
    "3 cups rice, long grain or medium grain, or quantity needed"
  ],
  "instructions": [
    "In a strainer rinse the rice in cold running water several times until the water runs almost clear.  Let it drain.",
    "Place the rice in a saucepan or pot that will hold twice the amount of the raw rice.  Add cold water to cover the rice by about 1 inch, measured from the top of the rice to the first joint of your middle finger; or add enough water to cover your hand when laid flat over the top of the rice.",
    "Place the pot over high heat and bring the water to a boil and cook, uncovered, at high heat until the water is almost completely absorbed and small “chimneys” form on the surface of the rice.  At this point the grains of rice will be hard and raw at the center.",
    "Immediately reduce the heat to low, cover the pot, and steam the rice for about 10 minutes, or until each grain is completely cooked through.  Hold over low heat until ready to serve.  (The rice will not burn, but a hard crust will form and brown the longer it sits over low heat.  This crust, called “fan chui,” which means “crisp rice” in Cantonese, is a popular home-style treat.  Usually, cold tea is poured over the “fan chui” to loosen it, and it is eaten with the tea as a choice treat.)"
  ],
  "remarks": "This recipe uses the traditional Chinese method for measuring the water and is foolproof, whether you are cooking 1 cup of rice or 10 pounds.  You need only be concerned that the pot will hold the rice, which should double in volume once it is cooked. Whether the rice comes out dry with separated grains or sticky depends on the length of the grains of rice.  Long-grain rice contains less starch and will be drier.  For sushi or Japanese-style rice, use medium-grain rice, and for creamy dishes, such as puddings and risottos, use short-grain rice. Yield:  3 cups of rice will serve 4 to 6. Source:  New Wok Cooking by Rosa Ross, Clarkson Potter/Publishers, New York, © 2000 by Rosa Ross.",
  "yield": "",
  "source": "",
  "category": "07 - Vegetables"
}