{
  "title": "Basque Potatoes in Salsa Verde (Patatas en Salsa Verde)",
  "requires": "",
  "ingredients": [
    "2 pounds medium-size all-purpose boiling potatoes, peeled",
    "5 tablespoons “fragrant” extra-virgin olive oil",
    "4 large garlic cloves, minced",
    "5 tablespoons minced, fresh flat-leaf (Italian) parsley",
    "1 tablespoon all-purpose flour",
    "¼ cup dry white wine",
    "3 cups chicken stock or chicken broth",
    "Coarse salt (kosher or sea) and freshly ground black pepper",
    "Crusty bread, when served"
  ],
  "instructions": [
    "Cut the potatoes in half, and then slice each half into 4 to 6 wedges.  Pat the wedges dry with paper towels so that they won’t stick together when cooked.",
    "Heat the olive oil in a heavy 3-quart saucepan over medium heat.  Add the potatoes when the oil is hot and cook them until they begin to soften and take on some color, about 5 to 7 minutes, stirring often sot that they won’t stick to the saucepan bottom.  Transfer the potatoes to a bowl, using a slotted spoon, when they begin to show browning.",
    "If there seems to be too much oil in the pan when you’ve finished cooking the potatoes, pour off all but about 2 tablespoons.  Reduce the heat setting to low and add the garlic with 1 tablespoon of the minced parsley, and cook until the garlic is very fragrant but not browned, about 1 minute.  Add the flour and cook, stirring, to form a paste, about 30 seconds; if done correctly.  Gradually add the wine and 1 cup of the chicken stock before increasing the heat to medium.  Continue stirring until the mixture thickens.  Once the mixture thickens, slowly add the remaining two cups of chicken stock, stirring, and bring the mixture to a simmer.",
    "Return the potatoes to the saucepan and season with salt and pepper, to taste.  Cover the saucepan and reduce the heat to low.  Simmer, stirring and occasionally scrape the bottom of the pot, until the potatoes are extremely tender and are beginning to fall apart, about 25 to 30 minutes.  At this point stir in the remaining 4 tablespoons of parsley and continue cooking for one minute longer.  Turn off the heat and taste for seasoning, adding more salt and black pepper as necessary.",
    "Serve in soup bowls, accompanied with crusty bread."
  ],
  "remarks": "",
  "yield": "Serves 4 to 6.",
  "source": "The New Spanish Table by Anya von Bremzen, published by Workman Publishing Co. Inc., New York, www.workman.com, © 2005 by Anya von Bremzen.",
  "category": "07 - Vegetables"
}