{
  "title": "Buttermilk Battered Bake Onion Rings",
  "requires": "",
  "ingredients": [
    "2 large sweet onions, peeled",
    "½ cup buttermilk",
    "2 tablespoons olive oil",
    "1 large egg white",
    "⅔ cup flour",
    "½ teaspoon coarse-grained salt",
    "¼ teaspoon cracked black pepper",
    "¼ teaspoon paprika",
    "For Dipping and Dredging:",
    "1 cup buttermilk",
    "1 cup flour",
    "Coarse-grained salt (optional)"
  ],
  "instructions": [
    "Preheat the oven to 450° F. and oil a baking sheet.",
    "Cut the onions crosswise into ¾-inch-thick slices and separate them into onion rings, reserving the smaller pieces for another use.",
    "Prepare the batter in a small bowl by whisking together the buttermilk, olive oil, egg white, flour, salt, pepper, and paprika.  Stir the mixture until everything is completely combined.",
    "Set up the “Dipping and Dredging” by pouring the buttermilk into a shallow dish.  In a separate shallow dish place the flour.  Dredge the onion rings, one at a time.  First dredge them in the buttermilk, then in the flour, and finally in the batter.  As you finish dredging each onion ring place it on a nonstick baking sheet and bake them for 8 minutes, turning them once, at the halfway point.",
    "Season with coarse-grained salt (if necessary) and serve immediately."
  ],
  "remarks": "This sound like it’s an excellent alternative to “fried” onion rings. Author’s comment:  When the onion rings are done, eat them.  Don’t wait.  They’re not good cold.  If you’re serving them as a side dish for dinner, the entrée should be done before the onion rings come out of the oven.  For this reason, you should limit serving onion rings with simple-to-get-on-the-table entrées such as grilled chicken, hamburgers, etc. My first experience at making these onion rings, I quickly ran out of the batter.  I had intended to make two large onions (small, tight, inner rings removed) and ran out of batter after around 6 rings.  Next time I will make twice the amount of batter. The second thing I intend to do the next time I try this recipe is to place the onion rings in the oven; and after a minute, take them out and turn them over.  The way explained allowed all the batter to run down, off the onion ring.  I want to try turning them over so as to allow the batter to cook on the onion ring and not on the pan. I used parchment paper on a cookie pan, then sprayed Pam© on the parchment paper.  The onion rings came off very nicely. Lastly, the timing is off.  It took around 15 minutes total time to bake. Yield:  Serves 4. Source:  Cooking Thin with Chef Kathleen, by Kathleen Daelemans, Houghton Mifflin Co., , © 2002 by Kathleen Daelemans.",
  "yield": "",
  "source": "",
  "category": "07 - Vegetables"
}