{
  "title": "Crisp Potatoes with Spicy Tomato Sauce (Patatas Bravas)",
  "requires": "",
  "ingredients": [
    "For the potatoes –",
    "16 small red potatoes",
    "3 to 4 tablespoons extra-virgin olives oil",
    "Coarse salt (kosher or sea)",
    "For the spicy tomato sauce –",
    "4½ teaspoons olive oil",
    "1 small onion, minced",
    "3 garlic cloves, chopped",
    "¾ teaspoon smoked sweet Spanish paprika",
    "¼ teaspoon ground cumin",
    "1 medium-size pinch of crushed red pepper flakes",
    "1 can (15 ounces) peeled plum tomatoes, chopped, with their liquid (about 1½ cups)",
    "2 teaspoons distilled white vinegar",
    "1 large pinch of sugar",
    "Coarse salt (kosher or sea)"
  ],
  "instructions": [
    "For the potatoes –",
    "Place the potatoes in a large saucepan and add enough cold water to cover them by about 2 inches.  Bring the water to a boil over medium-high heat.  Once the water reaches a rolling boil reduce the heat to medium and continue cooking the potatoes, partially covered, until they are completely tender when you test them by piercing them with a toothpick.  This should take about 20 minutes; however, be careful to not over cook the potatoes because they will disintegrate when being tossed with oil and salt, below.",
    "Preheat the oven to 450º F.",
    "Remove the saucepan from the heat, drain the water, then set the saucepan aside to cool.  When the potatoes are cool enough to handle, cut them in quarters.",
    "Place the olive oil in a large mixing bowl with some salt then add the quartered potatoes and toss to coat the potatoes evenly in oil and salt; add more oil and salt if needed.  However, be careful not to crush the potatoes.  Spread the coated potatoes in a single layer on a large rimmed baking sheet and bake them, turning them once, until they are crisp and browned, about 45 minutes.",
    "For the spicy tomato sauce –",
    "Heat the olive oil in a heavy medium-size saucepan over medium-low heat.  Add the onion and garlic and cook until limp but not browned, 3 to 5 minutes.  Add the paprika, cumin, and the red pepper flakes and stir for a few seconds.  Add the tomatoes with their liquid and ½ cup water and bring to a simmer.  Cover the saucepan and simmer until the tomatoes have cooked down to a puree, 15 to 20 minutes, stirring occasionally and adding a little more water if the sauce seems too thick.",
    "Add the vinegar and sugar and stir to mix; then season the sauce with salt and the  sauce to taste and remove it from the heat.  Let the sauce cool for a few minutes and puree it in a blender.  Let the sauce cool to room temperature, taste it again, and add more salt and/or  as necessary.  Makes about 1¾ cups of sauce."
  ],
  "remarks": "The sauce may be stored in a clean jar if you pour a light film of olive oil on top of the sauce in the jar.  The sauce can be refrigerated in this manner for up to week.  Allow the sauce to return to room temperature before using. To serve, arrange the potatoes on a serving platter and drizzle a generous amount of the spicy tomato sauce around the potatoes.  The Spaniards also include a portion of “allioli,” a garlic mayonnaise in the serving of “Patatas Bravas.” Yield:  As an appetizer it will serve 4 to 6 persons. Source:  The New Spanish Table by Anya von Bremzen, published by Workman Publishing Co. Inc., New York, www.workman.com, © 2005 by Anya von Bremzen. Crisp Potatoes with spicy tomato sauce",
  "yield": "",
  "source": "",
  "category": "07 - Vegetables"
}