{
  "title": "French Fried Potatoes in Olive Oil",
  "requires": "",
  "ingredients": [
    "2 pounds russet potatoes",
    "4 cups extra-virgin olive oil",
    "Sea salt"
  ],
  "instructions": [
    "You will need a thermometer to follow this recipe.",
    "Prepare and have ready a large bowl of water with several ice cubes in it.  Peel the potatoes and cut them with a knife into French fries, that is, about ⅜-inch thick, and put them in the bowl of icy water to soak for 20 to 30 minutes.",
    "Heat the oil in a deep saucepan to 320° F.",
    "Drain the potatoes and dry them thoroughly, wrapping them tightly in several layers of paper towels or dish towels to get them very dry.  (Remember, any remaining water will cause the hot oil to splatter.)  Drop the dried potatoes into the hot oil carefully.  Work in batches so as not to cool the oil too much; cook each batch of potatoes for 3 minutes.  (The potatoes will not be fully cooked or browned.)  Remove them from the oil after 3 minutes and set them in a colander, or a rack, covered with paper towels to drain.  Process all the remaining potatoes in similar manner.",
    "You can proceed immediately to the next step or, if it’s more convenient, you can wait a couple of hours before continuing.  You can even refrigerate the half-fried potatoes if you wish.",
    "When you’re ready to continue, heat the oil to 360° F.  (If you’re working without a thermometer a way of measuring if the temperature of the oil is at 360° F. is to use a small cube of bread.  Drop the cube of bread into the hot oil, when you think the oil is ready.  If the oil is at the right temperature the bread should turn golden and crisp – “rapidly.”)  Again, working in batches, drop the potatoes into the hot oil carefully.  This time the potatoes will brown and become crisp very quickly; in about 1 minute.  Remove them as they brown and set them on paper towels to drain.  It’s best to sprinkle salt on the potatoes immediately after they are removed from the oil.",
    "Serve them immediately."
  ],
  "remarks": "",
  "yield": "Serves 4 to 6.",
  "source": "The Essentials Mediterranean by Nancy Harmon Jenkins, Harper Collins Publishers, Inc., , ©2003 by Nancy Harmon Jenkins.",
  "category": "07 - Vegetables"
}