{
  "title": "Fried Onion Loaf",
  "requires": "",
  "ingredients": [
    "⅔ cup flat beer",
    "1 egg",
    "1 teaspoon salt",
    "1 cup, less 2 tablespoons all-purpose flour",
    "Large pinch of ground cayenne pepper",
    "1 large “sweet” onion (about 12 ounces) cut crosswise into ½-inch wide slices, separated into",
    "the individual rings",
    "Coarse salt",
    "Vegetable oil for deep frying"
  ],
  "instructions": [
    "An hour or so before starting open the beer drink a third and pour the remainder into a glass and leave it sitting to go flat.",
    "In a mixing bowl whisk together the beer, egg, salt, and the cayenne pepper.  If the beer is still not flat the mixture will foam up; be that as it may, add the flour and fold the flour into the mixture with the whisk.  When the flour is “just” incorporated stop and let the batter stand, covered, at room temperature at least 1 hour, up to a maximum of 3 hours.  (You should note that it’s important not to over work the batter when folding in the flour.)",
    "Thirty minutes before serving pour enough vegetable oil into a deep fryer (with basket) set over medium-high heat until the level of the oil is above the basket.   Use a thermometer to gauge the temperature and bring the oil temperature to 380° F.  (Adjust the heat setting if necessary.)  While the oil is heating leave the basket immersed in the oil.",
    "When the oil is ready, stir the batter with the whisk and pour all of the onion rings into the bowl and toss them with hands until they are evenly coated with the batter.  (Work carefully from this point!)  Raise the frying basket from the oil, holding it steady over the fryer to catch drips, and as quickly as possible transfer the onion rings, by handfuls, to the basket stacking them loosely within the basket.  When all the onions have been placed in the basket gradually lower the basket into the hot oil.  If the oil threatens to overflow, lift the basket until the foaming subsides, then immerse again.  Do this until you can leave the basket immersed in the oil.  Fry the “onion loaf” until it’s a rich golden brown, about 8 minutes.",
    "When golden brown lift the basket from the oil and invert the basket onto a baking sheet lined with paper towel to catch and absorb any excess oil.  Working with a fork and knife, or other kitchen implements, loosen the “onion loaf” from the basket by scraping and cutting at areas where the batter has adhered to the basket.  When you have successfully removed the “onion loaf” from the basket set the loaf on paper towels to drain; and with paper towels blot the top and sides to absorb as much of the excess oil as possible.",
    "Sprinkle with the coarse salt and serve as soon as possible (before the onions start to go soft)."
  ],
  "remarks": "This recipe is the author’s answer to Chili’s Awesome Blossom. Secondly, the batter can be made up to 36 hours in advance.  If you are working up to a day ahead leave the batter, covered, in the refrigerator. Yield:  Serves 4 to 6 persons. Source:  The Classic Rib Tickler by Christopher Styler, Cuisine Magazine, January 1984.",
  "yield": "",
  "source": "",
  "category": "07 - Vegetables"
}