{
  "title": "Gratin of Baked Onions",
  "requires": "",
  "ingredients": [
    "6 tablespoons (¾ stick) unsalted butter",
    "3 pounds white onion, cut into ½-inch-thick rounds (do not separate rings)",
    "Salt",
    "¼ pound thick-cut smoked bacon, coarsely diced",
    "1½ pounds smoked pork loin chops, boned and cut into ½-inch pieces",
    "2 pounds Swiss chard, stemmed, dried, and coarsely chopped",
    "2 large garlic cloves, pressed",
    "2 teaspoons fennel seeds, crushed",
    "Freshly ground black pepper",
    "½ cup whipping cream",
    "1 tablespoon grated lemon peel",
    "11 ounces Fontina cheese, cut into ½-inch cubes",
    "¼ cup freshly grated Parmesan cheese",
    "3 tablespoons well-chilled butter, cut into pieces"
  ],
  "instructions": [
    "Melt the butter in a heavy, large, skillet over medium-low heat.  Add the onions and cook until its softened and just golden, stirring occasionally, about 15 minutes.  Remove with slotted spatula and season with salt.  Increase the heat to medium-high, add the bacon to the skillet and cook until its translucent and the edges begin to crisp, about 5 minutes.  Add pork and sauté until lightly browned, about 5 minutes.  Gradually stir in the chard and sauté until just wilted then add the garlic and stir all together for 3 minutes.  Add the fennel seeds and pepper.  Remove from the heat and cool to room temperature and pour off any liquid that might have accumulated in the skillet.",
    "Preheat the oven to 350° F.",
    "Butter a large oval gratin dish or ovenproof baking dish.  Stir the cream and lemon peel into the chard mixture.  Spread half of the onions in the dish.  Cover with the chard mixture.  Top with the remaining onions.  Press the Fontina cheese bits into the onion, leaving the top edges exposed.  Sprinkle with Parmesan cheese and then dot with the remaining 3 tablespoons of cold butter and bake until the cheese has melted and the top is golden brown, approximately 45 to 50 minutes.",
    "Let stand for 15 minutes before serving.",
    "Remarks:  I’m not sure about the Swiss chard, but try it once with it, then modify the recipe to your personal desires.",
    "Yield:  Serves 4.",
    "Source:  An Onion Sampler by Edena Sheldon, Bon Appétit, January 1985."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "07 - Vegetables"
}