{
  "title": "Mexican Rice Cooked the Mexican Way",
  "requires": "",
  "ingredients": [
    "1½ cups “Mexican-milled” white rice",
    "3½ cups chicken broth",
    "Salt",
    "1 cup vegetable oil",
    "1 small white onion, chopped",
    "3 tablespoons, roughly chopped fresh flat-leaf parsley"
  ],
  "instructions": [
    "Place the rice in a medium-mesh strainer and wash it under cold running water until the water runs clear.  Scoop it into a bowl, cover with cold water and let stand 20 minutes, then pour into the strainer and let it drain for 15 minutes.",
    "Heat the broth in a small saucepan until it’s steaming (you may choose to do this in your microwave) then; if using unsalted broth, stir in 1½ teaspoon of salt, or ¾ teaspoons of salt if the broth is salted.",
    "In a medium saucepan (approximately of 3-quarts size), heat the oil over medium heat.  When hot, add the rice (remember it will sputter due to the water remaining) and stir almost constantly for a minute or so, until the rice floats freely, no longer clumping.  Continue to fry the rice, stirring occasionally, until it has turned milky-white, 7 to 8 minutes.  Pour the rice into a strainer set over a heatproof bowl and let the rice drain for 5 minutes.  Do not wash the pan.  The oil can be refrigerated and used again later.",
    "In the still oily pan, fry the onion over medium heat until it’s translucent, approximately 3 to 4 minutes.  Add the garlic and stir for a few second until the mixture is aromatic, then add the rice and then the broth.",
    "Simmer briskly, uncovered, stirring every once in a while, for 7 to 10 minutes, until the liquid drops below the surface of the rice.  At this point you will begin to see small steam holes develop in the rice.  Turn the heat to low and cook, without stirring, until you no longer hear the gurgling liquid, about 8 minutes.  Remove the pan from the heat and cover the pan with a folded kitchen towel to trap the steam.  Let the rice rest for 20 minutes.",
    "Fluff the rice with a fork to release trapped steam and stop the cooking.  Stir in the chopped parsley and it’s ready."
  ],
  "remarks": "",
  "yield": "Serves 5 to 6.",
  "source": "Mexico One Plate at a Time by Rick Bayless, Scribner, 1230 Avenue of the Americas, New York, NY 10020, ©2000 by Rick Bayless.",
  "category": "07 - Vegetables"
}