{
  "title": "Pesto Potato Salad (Pestokartoffelsalat zum Alde Gott)",
  "requires": "",
  "ingredients": [
    "3 pounds thin-skinned boiling potatoes (about 8) unpeeled",
    "1 tablespoon salt",
    "10 caraway seeds",
    "For the pesto –",
    "16 fresh, large basil leaves, washed well and dried",
    "½ cup packed fresh parsley leave, washed well and dried",
    "1 large garlic clove, peeled and quartered",
    "2 tablespoons pine nuts, toasted until golden",
    "1 tablespoon freshly grated Parmesan cheese",
    "1 tablespoon balsamic vinegar",
    "½ teaspoon salt",
    "⅓ cup olive oil (preferably extra-virgin)",
    "For the onion mixture –",
    "1 medium yellow onion, finely chopped",
    "6 tablespoons vegetable oil (preferably sunflower oil)",
    "¼ cup red-wine vinegar",
    "¼ cup chicken broth",
    "1 tablespoon  mustard",
    "½ teaspoon salt",
    "¼ teaspoon freshly ground black pepper"
  ],
  "instructions": [
    "Bring to a boil the water in a kettle (filled two thirds full).  When the water is boiling add the tablespoon of salt, the caraway seeds, and the potatoes.  Cook the potatoes for 45 minutes; or, until they are just done (test with a toothpick).",
    "In a food processor, or blender, process all of the pesto ingredients, except the oil, until the basil and parsley leaves are finely chopped (scraping down the sides).  When the leaves are done, with the blender running, add the oil in a slow and steady stream and process until the pesto is smooth.  Set aside.",
    "Chop up the onion.  Use a non-reactive saucepan to bring the oil, vinegar, and broth to a boil.  Add the other ingredients to the boiling liquid and mix well.  Finally, add the onion, mix well, turn off the heat and return your attention to the potatoes.",
    "Drain the potatoes and discard the caraway seeds.  When the potatoes are cool enough to handle, peel and cut them up into ¼ to ⅓-inch round slices; transferring the slices to a large heatproof bowl.",
    "Add the onion mixture to the potatoes and toss the mixture.  Use a colander to drain the liquid from the potatoes; discard the liquid.  In the colander add the pesto and toss gently.",
    "Transfer the potatoes to a serving dish and bring to the table.  (The potatoes should be warm or at room temperature when served.)",
    "Yield:  Serves 6 to 8.",
    "Source:   and , What’s Cooking Along the Rhine, by Jean Anderson, Gourmet Magazine, November, 1995."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "07 - Vegetables"
}