{
  "title": "Red Tomato Rice (Arroz Rojo)",
  "requires": "",
  "ingredients": [
    "12 ounces approximately 4 to 6 plum tomatoes, peeled, seeded and roughly chopped; or,",
    "one 15-ounce can whole tomatoes in their juice, drained, and roughly chopped",
    "½ small white onion, roughly chopped",
    "2 garlic cloves, peeled, and halved",
    "2 small carrots, peeled and chopped into ¼-inch cubes",
    "1¾ cups chicken broth",
    "Salt",
    "1½ tablespoons vegetable oil",
    "1½ cups white rice, preferably medium-grain",
    "Fresh hot green chiles to taste (roughly 3 serranos or 2 jalapeños), a slit down the length",
    "of each one",
    "¼ cup coarsely chopped fresh flat-leaf parsley"
  ],
  "instructions": [
    "In a blender or food processor, combine the tomatoes (raw or drained, if canned) with the onion and garlic.  Blend to a smooth puree; you should have a generous cup.",
    "In a small saucepan or in a microwave oven, heat the broth or water until steaming; stir in about ¾ teaspoon salt if you are using salted broth; or 1½ teaspoons of salt, if you are using unsalted broth.  Cover and keep the broth warm.",
    "In a medium, at least a 3-quart saucepan (one that is about 8-inches in diameter is perfect for even cooking) with a tight-fitting lid, heat the oil over medium heat.  When the oil is hot, add the raw rice and stir regularly until the grains have turned from translucent to milky-white, about 5 to 6 minutes – it’s fine if some of the grains of rice begin to turn brown.  Add the tomato mixture and carrots and stir around a couple of times, then let the rice cook until any liquid is reduced until the mixture is somewhat “dry-looking”, about 2 to 3 minutes.",
    "Add the warm broth, chiles, and parsley.  Stir thoroughly and scrape down any rice grains clinging to the side of the pan.  Cover and cook over the lowest heat possible for 15 minutes – the temperature should be low enough that only the slightest hint of steam escapes from the lid.",
    "Remove the pan from the heat and let it stand for 5 minutes.  Uncover and test a grain of rice.  If the rice is still a little hard, re-cover the pan and set over low heat again for 5 more minutes.  However, if the rice has absorbed all the liquid and is completely dry, sprinkle it with 2 tablespoons of water before returning the pan to low heat.",
    "As soon as it is done, gently fluff the rice to release the steam and stop the cooking, then turn it into a warm bowl and it’s ready to serve.  You can remove the chiles if you wish, or pull them out to use as decoration on top of the bowl of rice.",
    "Remarks:  This recipe actually works very well when cooked ahead and reheated.  Try this, if you are cooking it ahead.  When the rice is cooked, turn it out onto a baking sheet in a shallow layer to cool; once cool enough to handle spoon it into a container with a top and refrigerate it.  It will keep very well for up to 3 days this way.  You can also reheat the rice on a baking sheet, covered with foil, in a 325° F. oven, for about 15 minutes.",
    "Yield:  Serves 6 to 8.",
    "Source:  Mexico One Plate at a Time by Rick Bayless, Scribner, 1230 Avenue of the Americas, New York, NY 10020, ©2000 by Rick Bayless."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "07 - Vegetables"
}