{
  "title": "Roasted Onions Stuffed with Cheese",
  "requires": "",
  "ingredients": [
    "4 medium-large yellow sweet onions, unpeeled",
    "1 tablespoon cumin seeds",
    "½ cup grated asadero, Manchego, Monterey Jack, or other good melting cheese",
    "1 cup grated Cotija, Romano, or other aged cheese",
    "3 tablespoons sour cream",
    "1 tablespoon balsamic vinegar",
    "3 dashes of hot-pepper sauce such as Tabasco",
    "½ teaspoon salt",
    "½ teaspoon freshly ground pepper"
  ],
  "instructions": [
    "Preheat a broiler and palace the unpeeled onions in a small baking pan and cover with aluminum foil.  Place them in the broiler, about 5 inches from the heat source and broil, turning every 5 to 10 minutes, until the onions are charred on the outside and soft all the way through, about 1 hour.  Remove them from the broiler and set aside to cool.",
    "Preheat the oven at 375° F.",
    "Peel the onions carefully, keeping them intact and discarding the outer charred skin.  With a sharp knife cut the onions in half, crosswise, and using a finger, remove the centers, forming “cups” within which to place the cheese filling.  Try to keep the “walls” of the cups about ¾ inch thick.  Reserve the centers.",
    "Line the inside bottom of each “onion cup” with a piece of the removed roasted centers to prevent the filling from leaking out and place them on a baking sheet.",
    "In a small frying pan over medium heat, toast the cumin seeds, shaking the pan frequently, until lightly browned and fragrant, about 2 to 3 minutes.  Transfer the seeds to a cutting board and chop coarsely.  Chop the remaining removed onion pulp and place in a small bowl.  Add both cheeses, sour cream, cumin seeds, vinegar, hot sauce, salt and pepper and stir to mix well.  Divide the cheese mixture among the onion cups and bake them until browned and bubbling, about 15 to 20 minutes."
  ],
  "remarks": "",
  "yield": "Serves 4 to 8, depending on portions.",
  "source": "Cantina, The Best of Casual Mexican Cooking by Susan Feniger and Mary Sue Milliken, © 1996 by Weldon Owen Inc., published by Sunset Publishing Corp., Menlo Park, CA 94025.",
  "category": "07 - Vegetables"
}