{
  "title": "Rosa Würz’s Green Beans (Grüne Bohnen von Rosa Würz)",
  "requires": "",
  "ingredients": [
    "¼ pound sliced “double smoked” bacon, snipped crosswise into ¼-inch strips",
    "(about 1 cup bacon strips)",
    "1 large yellow onion, peeled and chopped moderately coarsely",
    "1 medium-size bay leaf, crumbled",
    "1 teaspoon dried leaf marjoram, crumbled",
    "¼ teaspoon dried leaf thyme, crumbled",
    "1¾ pounds vine-ripe tomatoes, peeled, cored, seeded, and coarsely chopped",
    "½ cup rich beef broth (preferably homemade)",
    "1 to 2 teaspoons sugar, depending on the tartness of the tomatoes",
    "½ teaspoon salt",
    "¼ teaspoon freshly ground black pepper",
    "1¼ pounds tender young green beans, tipped and snapped in half",
    "3 tablespoons moderately coarsely chopped flat-leaf parsley"
  ],
  "instructions": [
    "Sauté the bacon in a heavy 12-inch skillet over moderate heat for 3 to 4 minutes, stirring occasionally, until all the drippings are cooked out and only crisp brown bits remain.  With a slotted spoon remove the bacon bits to a paper towel and allow them to drain.",
    "Pour out all the bacon drippings from the skillet; measure out 2 tablespoons and return only that quantity back to the skillet.  Lower the heat to low.  Return the skillet to the heat and add the onion and sauté it for 8 to 10 minutes, stirring frequently, until it is golden brown.  Mix in the bay leaf, marjoram, and thyme and allow the mixture to mellow over low heat for 1 minute.  Mix in the tomatoes, broth, one teaspoon of the sugar, the salt, and the pepper.  Cover and simmer for 10 minutes over low heat.  Uncover and stir everything well.  Raise the heat to moderately high, and allow the mixture to reach a boil uncovered, for 5 minutes, stirring frequently.",
    "Lay the green beans on top – do not stir – then adjust the heat so that the tomato mixture bubbles gently.  Cover and simmer for 15 to 20 minutes, until the beans are crisp-tender.",
    "Taste for sugar, salt and pepper and adjust as needed.  Sprinkle with the parsley and reserved bacon bits, toss lightly, and serve.",
    "Remarks:  These beans are equally delicious with pork, ham, beef, veal, lamb, and chicken.",
    "Yield:  Makes 6 servings.",
    "Source:  The New German Cookbook by Jean Anderson and Hedy Würz published by Harper Collins Publishers, © 1993 by Jean Anderson and Hedy Würz."
  ],
  "remarks": "",
  "yield": "",
  "source": "",
  "category": "07 - Vegetables"
}