{
  "title": "Skillet Potatoes",
  "requires": "",
  "ingredients": [
    "3 pounds potatoes, unpeeled",
    "2 tablespoons olive oil",
    "1 onion, in ¼-inch thick slices",
    "Pinch of sugar",
    "3 strips thick smoky bacon",
    "2 tablespoons butter",
    "Pinch of salt, coarsely ground black pepper, and sugar",
    "2 teaspoons chopped garlic",
    "2 tablespoons thinly sliced green onion (scallions)"
  ],
  "instructions": [
    "Cook the potatoes in boiling salted water.  When done drain them and refrigerate them for about 2 hours (or until they’re cool if your in a hurry).   After cooling the potatoes peel them and slice them into ¼- to ½-inch thick round thick slices.",
    "Heat the oil in a small skillet over medium heat.  When the oil is hot, just starting to smoke, add the onions.  Sauté the onions, stirring constantly, until they begin to brown then add a pinch of salt, the black pepper, and sugar.  Cook the onions until they are well browned and are caramelized.  Remove the skillet from the heat and set it aside.",
    "Preferably in a cast-iron skillet, cook the bacon over medium heat until it is well cooked and crisp.  Remove and drain the bacon on paper towels and let it cool.  When the bacon is cool crumble it and set it aside.  While the bacon cools, drain the bacon drippings from the pan, except for approximately 1 tablespoon.  Return the skillet to the heat and add the butter to the remaining bacon drippings.  Once the butter is melted and well blended with the bacon drippings add the sliced potatoes, season with salt and pepper, and cook them over medium heat until their bottoms are crisp.  Turn the potatoes over and season the other side with salt and pepper.  Add the garlic, caramelized onions, green onions, and the crumbled bacon.  Cook the potatoes until their bottoms are as crisp as the opposite sides.  Keep them warm while you finish cooking the other components of the meal.  Just before serving, toss the potatoes several times to mix the potatoes, onions and bacon."
  ],
  "remarks": "When I made these potatoes I found that it was best if you limited the amount of potatoes to what can fit in the skillet in a single layer.  In the finished product, the potatoes came out with crisp, brown crusts on both sides.  I didn’t use bacon and they still came out excellent.  I did have to cook the potatoes in two separate batches.  I would recommend that you use the largest skillet you have and limit the quantity of potatoes to what you can fit into the skillet in a single layer.  That way you don’t have to work in batches.  The recipe lends itself to less than 3-pounds of potatoes and the results are “excellent.” These potatoes are served by Michael Velardi, of Pappas Brothers Steakhouse in  with their T-bone steaks. Yield:  Serves 4. Source:  The Food of Texas by Caroline Stuart, published by Periplus Editions (HK) Ltd., © 2000 by Periplus Editions (HK) Ltd. Skillet Potatoes and T-bone Steak",
  "yield": "",
  "source": "",
  "category": "07 - Vegetables"
}